{
  //فلترة فروع المحافظات
  getCompany(event) {
    this.inputFormField["branch"] = null; //يصفر حقل الفروع
    //فروع كل محافظة
    let First_Sections = [
      {Selected_Value: "بغداد", Showed_Value: ["توزيع كهرباء الكرخ", "توزيع كهرباء الرصافة", "توزيع كهرباء مدينة الصدر"], Company: "شركة توزيع كهرباء بغداد",},
      {Selected_Value: "بابل", Showed_Value: ["توزيع كهرباء بابل"], Company: "شركة توزيع كهرباء الفرات الاوسط",},
      {Selected_Value: "كربلاء المقدسة", Showed_Value: ["توزيع كهرباء كربلاء المقدسة"], Company: "شركة توزيع كهرباء الفرات الاوسط",},
      {Selected_Value: "النجف الاشرف", Showed_Value: ["توزيع كهرباء النجف الاشرف"], Company: "شركة توزيع كهرباء الفرات الاوسط",},
      {Selected_Value: "القادسية", Showed_Value: ["توزيع كهرباء الديوانية"], Company: "شركة توزيع كهرباء الفرات الاوسط",},
      {Selected_Value: "ذي قار", Showed_Value: ["توزيع كهرباء ذي قار","توزيع كهرباء شمال الناصرية",], Company: "شركة توزيع كهرباء الجنوب",},
      {Selected_Value: "البصرة", Showed_Value: ["توزيع كهرباء شمال البصرة","توزيع كهرباء البصرة",], Company: "شركة توزيع كهرباء الجنوب",},
      {Selected_Value: "ميسان", Showed_Value: ["توزيع كهرباء ميسان",], Company: "شركة توزيع كهرباء الجنوب",},
      {Selected_Value: "المثنى", Showed_Value: ["توزيع كهرباء المثنى",], Company: "شركة توزيع كهرباء الجنوب",},
      {Selected_Value: "نينوى", Showed_Value: ["توزيع كهرباء اطراف نينوى", "توزيع كهرباء مركز نينوى"], Company: "شركة توزيع كهرباء الشمال",},
      {Selected_Value: "صلاح الدين", Showed_Value: ["توزيع كهرباء جنوب صلاح الدين", "توزيع كهرباء صلاح الدين",], Company: "شركة توزيع كهرباء الشمال",},
      {Selected_Value: "كركوك", Showed_Value: ["توزيع كهرباء كركوك",], Company: "شركة توزيع كهرباء الشمال",},
      {Selected_Value: "ديالى", Showed_Value: ["توزيع كهرباء ديالى", "توزيع كهرباء شمال ديالى",], Company: "شركة توزيع كهرباء الوسط",},
      {Selected_Value: "الانبار", Showed_Value: ["توزيع كهرباء الفرات الاعلى", "توزيع كهرباء مركز الانبار", "توزيع كهرباء شرق الانبار",], Company: "شركة توزيع كهرباء الوسط",},
      {Selected_Value: "واسط", Showed_Value: ["توزيع كهرباء واسط"], Company: "شركة توزيع كهرباء الوسط",},
    ];

    let Result = First_Sections.find((Finding) => event == Finding.Selected_Value);
    if(Result){
      document.getElementById("14761").style.display = "block";
      this.group_of_form[0].fields[2].properties[0].values = Result.Showed_Value;
      this.inputFormField.CompanyType = Result.Company;
    }else{
      document.getElementById("14761").style.display = "none";
      this.group_of_form[0].fields[2].properties[0].values = [];
      this.inputFormField.CompanyType = " ";
    }
  },

  //فلترة قطاعات الفروع
  gitSections(event) {
    this.inputFormField["section"] = null; //يصفر حقل القطاعات
    //قطاعات كل فرع
    let Second_Sections = [
        {
          Selected_Values: "توزيع كهرباء الكرخ", Showed_Value: ["قطاع الكرخ الشمالي", "قطاع الكرخ الجنوبي", "قطاع الكاظمية", "قطاع الحرية", "قطاع السلام", "قطاع البياع",
            "قطاع العامل", "قطاع الكرخ المركز", "قطاع الشعلة", "قطاع الدورة", "قطاع ابي غريب", "قطاع الغزالية"],
        },
        {
          Selected_Values: "توزيع كهرباء الرصافة", Showed_Value: ["قطاع الرصافة الشمالي","قطاع الرصافة الجنوبي", "قطاع فلسطين", "قطاع الرصافة المركز", "قطاع الرصافة اطراف الجنوبي",
            "قطاع الاعظمية"],
        },
        {
          Selected_Values: "توزيع كهرباء مدينة الصدر", Showed_Value: ["قطاع اور", "قطاع الراشدية", "قطاع الصدر الاول", "قطاع الصدر الثاني", "قطاع الصدر الثالث", "قطاع البنوك",
            "قطاع الكمالية", "قطاع المنتظر", "قطاع الحسينية", "قطاع بوب الشام", "قطاع البلديات", "قطاع الامين", "قطاع العبيدي", "قطاع الشعب", "قطاع العطاء",],
        },
        {
          Selected_Values: "توزيع كهرباء بابل", Showed_Value: ["الحمزة الغربي", "الشوملي","الهاشمية", "المسيب", "الاسكندرية", "الفيحاء", "الرافدين", "النيل", "ابي غرق", "كوثى",
            "الكفل", "الحلة", "المحاويل", "القاسم",],
        },
        {Selected_Values: "توزيع كهرباء كربلاء المقدسة", Showed_Value: ["الهندية","عين التمر","الحسينية - كربلاء", "الجدول الغربي", "الجنوبي","المركز - كربلاء","الشمالي","الحر"],},
        {Selected_Values: "توزيع كهرباء النجف الاشرف", Showed_Value: ["الجنوبي - النجف", "العروبة", "الشمالي - النجف", "الحيدرية", "الكوفة", "العباسية", "المناذرة", "المشخاب",],},
        {Selected_Values: "توزيع كهرباء الديوانية", Showed_Value: ["الديوانية الاول", "الديوانية الثاني", "الشامية - الديوانية", "عفك", "الدغارة", "الحمزة - الديوانية", "غماس",],},
        {Selected_Values: "توزيع كهرباء ذي قار", Showed_Value: ["الجزيرة", "الشامية", "الفرات", "الاهوار", "جنوب ذي قار",],},
        {Selected_Values: "توزيع كهرباء شمال الناصرية", Showed_Value: ["الشطرة", "الغراف", "القلعة", "الرفاعي",],},
        {Selected_Values: "توزيع كهرباء شمال البصرة", Showed_Value: ["الزبير", "سفوان", "شط العرب", "شهداء الجراحي", "الدير", "القرنة", "المدينة",],},
        {Selected_Values: "توزيع كهرباء البصرة", Showed_Value: ["5 ميل", "العشار", "الفاو", "المركز", "الجمهورية", "الجنينة", "غرب البصرة", "ابي الخصيب", "شمال البصرة", "القبلة",],},
        {Selected_Values: "توزيع كهرباء ميسان", Showed_Value: ["العمارة الأول", "العمارة الثاني", "شمال العمارة", "شرق العمارة", "غرب العمارة",],},
        {Selected_Values: "توزيع كهرباء المثنى", Showed_Value: ["الصوب الكبير", "الصوب الصغير", "الرميثة", "الوركاء", "الخضر",],},
        {Selected_Values: "توزيع كهرباء اطراف نينوى", Showed_Value: ["الغربي", "محلبية وبادوش", "تلكيف", "برطلة", "بعشيقة", "الشرقي", "الجنوبي - نينوى", "سنجار",],},
        {Selected_Values: "توزيع كهرباء مركز نينوى", Showed_Value: ["مركز نينوى",],},
        {Selected_Values: "توزيع كهرباء جنوب صلاح الدين", Showed_Value: ["جنوب صلاح الدين",],},
        {Selected_Values: "توزيع كهرباء صلاح الدين", Showed_Value: ["صلاح الدين",],},
        {Selected_Values: "توزيع كهرباء كركوك", Showed_Value: ["كركوك",],},
        {Selected_Values: "توزيع كهرباء ديالى", Showed_Value: ["الخالص", "بعقوبة الاطراف", "هبهب", "بهرز", "بلدروز", "الوجيهية", "مقدادية", "مندلي", "المنصورية" , "جديدة الشط",],},
        {Selected_Values: "توزيع كهرباء شمال ديالى", Showed_Value: ["العظيم", "جلولاء", "كشكولات", "خانقين",],},
        {Selected_Values: "توزيع كهرباء الفرات الاعلى", Showed_Value: ["حديثة", "عنة", "القائم", "الرمانة", "بروانة", "راوه", "البغدادي",],},
        {Selected_Values: "توزيع كهرباء مركز الانبار", Showed_Value: ["الرمادي", "غرب الرمادي", "هيت", "الخالدية", "الرطبة",],},
        {Selected_Values: "توزيع كهرباء شرق الانبار", Showed_Value: ["الفلوجة الشمالي", "الفلوجة الجنوبي", "الصقلاوية", "الكرمة", "العامرية"],},
        {
          Selected_Values: "توزيع كهرباء واسط", Showed_Value: ["الكوت الاول", "الكوت الثاني", "الكوت الثالث", "الحكيم", "الصويرة", "العزيزية", "الزبيدية", "تاج الدين", "النعمانية",
            "الاحرار", "بدرة", "الحي", "الموفقية", "البشائر",],
        },
    ];

    let Result = Second_Sections.find((Finding) => event == Finding.Selected_Values);
    if(Result){
      this.group_of_form[0].fields[3].properties[0].values = Result.Showed_Value;
      document.getElementById("14762").style.display = "block";
    }else{
      document.getElementById("14762").style.display = "none";
      this.group_of_form[0].fields[3].properties[0].values = [];
    }
  },

  //فلترة صيانات القطاعات
  getMaintain(event) {
    this.inputFormField["maintains"] = null; //يصفر حقل الصيانات
    //فروع كل قطاع
    let Third_Sections = [
      //محافظة بغداد
      //"توزيع كهرباء الكرخ"
      {Selected_Value: "قطاع الكرخ الشمالي", Showed_Value: ["النصر","المشاهدة","الطارمية", "شاطئ الطارمية", "العبايجي"],}, //صيانات قطاع الكرخ الشمالي
      {Selected_Value: "قطاع الكرخ الجنوبي", Showed_Value: ["المحمودية","الرشيد","اليوسفية","الزنبرانية","صدر اللطيفية","اللطيفية", "عويريج"],},//صيانات قطاع الكرخ الجنوبي
      {Selected_Value: "قطاع الكاظمية", Showed_Value: ["الكاظمية","العطيفية","سبع البور","التاجي"],},//صيانات قطاع الكاظمية
      {Selected_Value: "قطاع الحرية", Showed_Value: ["الحرية"],},//صيانات قطاع الحرية
      {Selected_Value: "قطاع السلام", Showed_Value: ["الكرامة","العلاوي","الطوبجي"],},//صيانات قطاع السلام
      {Selected_Value: "قطاع البياع", Showed_Value: ["الاعلام", "السيدية", "البياع"],},//صيانات قطاع البياع
      {Selected_Value: "قطاع العامل", Showed_Value: ["العامل", "الجهاد", "الرضوانية"],},//صيانات قطاع العامل
      {Selected_Value: "قطاع الكرخ المركز", Showed_Value: ["الخضراء والعامرية", "اليرموك", "المنصور","الجامعة والعدل", "كرادة مريم"],},//صيانات قطاع الكرخ المركز
      {Selected_Value: "قطاع الشعلة", Showed_Value: ["صيانة الشعلة", "الدوانم"],},//صيانات قطاع الشعلة
      {Selected_Value: "قطاع الدورة", Showed_Value: ["الميكانيك","الدورة الشمالي","الدورة الجنوبي"],},//صيانات قطاع الدورة
      {Selected_Value: "قطاع ابي غريب", Showed_Value: ["النصر والسلام","الزيتون","الشهداء",],},//صيانات قطاع ابي غريب
      {Selected_Value: "قطاع الغزالية", Showed_Value: ["الكفاءات", "الغزالية",],},//صيانات قطاع الغزالية
      //"توزيع كهرباء الرصافة"
      {Selected_Value: "قطاع الرصافة الشمالي", Showed_Value: ["الفضل","المثنى","السعدون"],},//صيانات قطاع الرصافة الشمالي
      {Selected_Value: "قطاع الرصافة الجنوبي", Showed_Value: ["الزعفرانية","جسر ديالى","المدائن"],},//صيانات قطاع الرصافة الجنوبي
      {Selected_Value: "قطاع فلسطين", Showed_Value: ["فلسطين","الغدير"],},//صيانات قطاع فلسطين
      {Selected_Value: "قطاع الرصافة المركز", Showed_Value: ["بغداد الجديدة","الفتح"],},//صيانات قطاع الرصافة المركز
      {Selected_Value: "قطاع الرصافة اطراف الجنوبي", Showed_Value: ["النهروان","الوحدة"],},//صيانات قطاع الرصافة اطراف الجنوبي
      {Selected_Value: "قطاع الاعظمية", Showed_Value: ["الاعظمية","الوزيرية"],},//صيانات قطاع الاعظمية
      //"توزيع كهرباء مدينة الصدر"
      {Selected_Value: "قطاع اور", Showed_Value: ["صيانات قطاع اور"],},//صيانات قطاع اور
      {Selected_Value: "قطاع الراشدية", Showed_Value: ["صيانات قطاع الراشدية"],},//صيانات قطاع الراشدية
      {Selected_Value: "قطاع الصدر الاول", Showed_Value: ["صيانات قطاع الصدر الاول"],},//صيانات قطاع الصدر الاول
      {Selected_Value: "قطاع الصدر الثاني", Showed_Value: ["صيانات قطاع الصدر الثاني"],},//صيانات قطاع الصدر الثاني
      {Selected_Value: "قطاع الصدر الثالث", Showed_Value: ["صيانات قطاع الصدر الثالث"],},//صيانات قطاع الصدر الثالث
      {Selected_Value: "قطاع البنوك", Showed_Value: ["صيانات قطاع البنوك"],},//صيانات قطاع البنوك
      {Selected_Value: "قطاع الكمالية", Showed_Value: ["صيانات قطاع الكمالية"],},//صيانات قطاع الكمالية
      {Selected_Value: "قطاع المنتظر", Showed_Value: ["صيانات قطاع المنتظر"],},//صيانات قطاع المنتظر
      {Selected_Value: "قطاع الحسينية", Showed_Value: ["صيانات قطاع الحسينية"],},//صيانات قطاع الحسينية
      {Selected_Value: "قطاع بوب الشام", Showed_Value: ["صيانات قطاع بوب الشام"],},//صيانات قطاع بوب الشام
      {Selected_Value: "قطاع البلديات", Showed_Value: ["صيانات قطاع البلديات"],},//صيانات قطاع البلديات
      {Selected_Value: "قطاع الامين", Showed_Value: ["صيانات قطاع الامين"],},//صيانات قطاع الامين
      {Selected_Value: "قطاع العبيدي", Showed_Value: ["صيانات قطاع العبيدي"],},//صيانات قطاع العبيدي
      {Selected_Value: "قطاع الشعب", Showed_Value: ["صيانات قطاع الشعب"],},//صيانات قطاع الشعب
      {Selected_Value: "قطاع العطاء", Showed_Value: ["صيانات قطاع العطاء"],},//صيانات قطاع العطاء
      //"قطاعات توزيع كهرباء بابل"
      {Selected_Value: "الحمزة الغربي", Showed_Value: ["الحمزة الغربي",],},//قطاع الحمزة الغربي
      {Selected_Value: "الشوملي", Showed_Value: ["الشوملي",],},//قطاع الشوملي
      {Selected_Value: "الهاشمية", Showed_Value: ["الهاشمية",],},//قطاع الهاشمية
      {Selected_Value: "المسيب", Showed_Value: ["المسيب", "السدة",],},//قطاع المسيب
      {Selected_Value: "الاسكندرية", Showed_Value: ["الاسكندرية",],},//قطاع الاسكندرية
      {Selected_Value: "الفيحاء", Showed_Value: ["الفيحاء - بابل",],},//قطاع الفيحاء
      {Selected_Value: "الرافدين", Showed_Value: ["الرافدين",],},//قطاع الرافدين
      {Selected_Value: "النيل", Showed_Value: ["النيل",],},//قطاع النيل
      {Selected_Value: "ابي غرق", Showed_Value: ["ابي غرق",],},//قطاع ابي غرق
      {Selected_Value: "كوثى", Showed_Value: ["كوثى",],},//قطاع كوثى
      {Selected_Value: "الكفل", Showed_Value: ["الكفل",],},//قطاع الكفل
      {Selected_Value: "الحلة", Showed_Value: ["الحلة",],},//قطاع الحلة
      {Selected_Value: "المحاويل", Showed_Value: ["المحاويل", "الامام", "تونس",],},//قطاع المحاويل
      {Selected_Value: "القاسم", Showed_Value: ["القاسم", "الشهداء - بابل", "الطليعة",],},//قطاع القاسم
      //"قطاعات توزيع كهرباء كربلاء"
      {Selected_Value: "الهندية", Showed_Value: ["الهندية"],},//قطاع الهندية
      {Selected_Value: "عين التمر", Showed_Value: ["عين التمر"],},//قطاع عين التمر
      {Selected_Value: "الحسينية - كربلاء", Showed_Value: ["الحسينية - كربلاء"],},//قطاع الحسينية - كربلاء
      {Selected_Value: "الجدول الغربي", Showed_Value: ["الجدول الغربي"],},//قطاع الجدول الغربي
      {Selected_Value: "الجنوبي", Showed_Value: ["الجنوبي"],},//قطاع الجنوبي
      {Selected_Value: "المركز - كربلاء", Showed_Value: ["المركز - كربلاء"],},//قطاع المركز - كربلاء
      {Selected_Value: "الشمالي", Showed_Value: ["الشمالي"],},//قطاع الشمالي
      {Selected_Value: "الحر", Showed_Value: ["الحر"],},//قطاع الحر
      //"قطاعات توزيع كهرباء النجف"
      {Selected_Value: "الجنوبي - النجف", Showed_Value: ["الجنوبي - النجف",],},//قطاع الجنوبي - النجف
      {Selected_Value: "العروبة", Showed_Value: ["العروبة",],},//قطاع العروبة
      {Selected_Value: "الشمالي - النجف", Showed_Value: ["الشمالي - النجف",],},//قطاع الشمالي - النجف
      {Selected_Value: "الحيدرية", Showed_Value: ["الحيدرية",],},//قطاع الحيدرية
      {Selected_Value: "الكوفة", Showed_Value: ["الكوفة",],},//قطاع الكوفة
      {Selected_Value: "العباسية", Showed_Value: ["العباسية",],},//قطاع العباسية
      {Selected_Value: "المناذرة", Showed_Value: ["المناذرة",],},//قطاع المناذرة
      {Selected_Value: "المشخاب", Showed_Value: ["المشخاب",],},//قطاع المشخاب
      //"قطاعات توزيع كهرباء الديوانية"
      {Selected_Value: "الديوانية الاول", Showed_Value: ["الديوانية الاول",],},//قطاع الديوانية الاول
      {Selected_Value: "الديوانية الثاني", Showed_Value: ["الديوانية الثاني",],},//قطاع الديوانية الثاني
      {Selected_Value: "الشامية - الديوانية", Showed_Value: ["الشامية - الديوانية",],},//قطاع الشامية - الديوانية
      {Selected_Value: "عفك", Showed_Value: ["عفك",],},//قطاع عفك
      {Selected_Value: "الدغارة", Showed_Value: ["الدغارة",],},//قطاع الدغارة
      {Selected_Value: "الحمزة - الديوانية", Showed_Value: ["الحمزة - الديوانية",],},//قطاع الحمزة - الديوانية
      {Selected_Value: "غماس", Showed_Value: ["غماس",],},//قطاع غماس
      //قطاعات توزيع كهرباء ذي قار
      {Selected_Value: "الجزيرة", Showed_Value: ["سومر", "الجزيرة", "النور",],},// قطاع الجزيرة
      {Selected_Value: "الشامية", Showed_Value: ["الشامية", "البطحاء", "الشموخ", "الفضلية", "الاسكان"],},// قطاع الشامية
      {Selected_Value: "الفرات", Showed_Value: ["الفرات", "الشهداء(مقر القطاع)", "اور",],},// قطاع الفرات
      {Selected_Value: "الاهوار", Showed_Value: ["الجبايش", "المنار", "الفهود", "الاصلاح", "سيد دخيل",],},// قطاع الاهوار
      {Selected_Value: "جنوب ذي قار", Showed_Value: ["السوق", "الشموع", "العكيكة", "الكرمة", "الطار",],},// قطاع جنوب ذي قار
      //قطاعات توزيع كهرباء الناصرية
      {Selected_Value: "الشطرة", Showed_Value: ["الشعلة", "اكد",],},// قطاع الشطرة
      {Selected_Value: "الغراف", Showed_Value: ["الغراف", "الدواية",],},// قطاع الغراف
      {Selected_Value: "القلعة", Showed_Value: ["الفجر", "قلعة سكر",],},// قطاع القلعة
      {Selected_Value: "الرفاعي", Showed_Value: ["الرفاعي 1", "الرفاعي 2", "النصر(مقر القطاع)",],},// قطاع الرفاعي
      //قطاعات توزيع كهرباء شمال البصرة
      {Selected_Value: "الزبير", Showed_Value: ["الخطوة", "المربد", "الشعيبة", "الدريهمية",],},// قطاع الزبير
      {Selected_Value: "سفوان", Showed_Value: ["سفوان", "ام قصر", "خور الزبير",],},// قطاع سفوان
      {Selected_Value: "شط العرب", Showed_Value: ["التنومة", "الصالحية", "الفيحاء", "كتيبان", "الزريجي",],},// قطاع شط العرب
      {Selected_Value: "شهداء الجراحي", Showed_Value: ["كرمة علي", "الهارثة", "شهداء الجراحي",],},// قطاع شهداء الجراحي
      {Selected_Value: "الدير", Showed_Value: ["الدير", "النشوة", "الشافي"],},// قطاع الدير
      {Selected_Value: "القرنة", Showed_Value: ["القرنة", "الشرش", "الثغر",],},// قطاع القرنة
      {Selected_Value: "المدينة", Showed_Value: ["المدينة", "الصادق", "عز الدين سليم", "الماجدية",],},// قطاع المدينة
      //قطاعات توزيع كهرباء البصرة
      {Selected_Value: "5 ميل", Showed_Value: ["5 ميل", "الجامعة(مقر القطاع)", "غرب الصلال", "حي الغدير",],},// قطاع 5 ميل
      {Selected_Value: "العشار", Showed_Value: ["العشار", "البراضعية",],},// قطاع العشار
      {Selected_Value: "الفاو", Showed_Value: ["البحار", "الفاو", "السيبة",],},// قطاع الفاو
      {Selected_Value: "المركز", Showed_Value: ["البصرة", "المشراق",],},// قطاع المركز
      {Selected_Value: "الجمهورية", Showed_Value: ["الجمهورية", "الموفقية",],},// قطاع الجمهورية
      {Selected_Value: "الجنينة", Showed_Value: ["الجبيلة", "الجنينة",],},// قطاع الجنينة
      {Selected_Value: "غرب البصرة", Showed_Value: ["الجمعيات", "حي الحسين", "حي العباس",],},// قطاع غرب البصرة
      {Selected_Value: "ابي الخصيب", Showed_Value: ["الساحل", "الصناعية", "السياب", "حمدان", "كوت الصلحي", "ابي الخصيب",],},// قطاع ابي الخصيب
      {Selected_Value: "شمال البصرة", Showed_Value: ["السكك", "المعقل", "حي البتول",],},// قطاع شمال البصرة
      {Selected_Value: "القبلة", Showed_Value: ["القبلة", "حي المهندسين", "دور الشرطة", "حي الجهاد",],},// قطاع القبلة
      //قطاعات توزيع كهرباء ميسان
      {Selected_Value: "العمارة الأول", Showed_Value: ["بني هاشم", "العمارة الاولى", "العمارة الرابعة", "الكحلاء",],},// قطاع العمارة الاول
      {Selected_Value: "العمارة الثاني", Showed_Value: ["العمارة الثانية", "العمارة الثالثة", "المشرح",],},// قطاع العمارة الثاني
      {Selected_Value: "شمال العمارة", Showed_Value: ["الكميت", "علي الغربي", "علي الشرقي",],},// قطاع شمال العمارة
      {Selected_Value: "شرق العمارة", Showed_Value: ["القلعة الأولى", "القلعة الثانية", "العزيز", "ناحية الخير", "المجر الكبير",],},// قطاع شرق العمارة
      {Selected_Value: "غرب العمارة", Showed_Value: ["العدل", "الميمونة", "السلام", "سيد احمد",],},// قطاع غرب العمارة
      //قطاعات توزيع كهرباء المثنى
      {Selected_Value: "الصوب الكبير", Showed_Value: ["الصوب الكبير",],},// قطاع الصوب الكبير
      {Selected_Value: "الصوب الصغير", Showed_Value: ["الصوب الصغير",],},// قطاع الصوب الصغير
      {Selected_Value: "الرميثة", Showed_Value: ["شرق الرميثه",],},// قطاع الرميثة
      {Selected_Value: "الوركاء", Showed_Value: ["الوركاء", "السوير", "النجمي",],},// قطاع الوركاء
      {Selected_Value: "الخضر", Showed_Value: ["الخضر", "الدراجي",],},// قطاع الخضر
      //قطاعات توزيع كهرباء اطراف نينوى
      {Selected_Value: "الغربي", Showed_Value: ["الغربي",],},// قطاع الغربي
      {Selected_Value: "محلبية وبادوش", Showed_Value: ["محلبية وبادوش",],},// قطاع محلبية وبادوش
      {Selected_Value: "تلكيف", Showed_Value: ["تلكيف",],},// قطاع تلكيف
      {Selected_Value: "برطلة", Showed_Value: ["برطلة",],},// قطاع برطلة
      {Selected_Value: "بعشيقة", Showed_Value: ["بعشيقة",],},// قطاع بعشيقة
      {Selected_Value: "الشرقي", Showed_Value: ["الشرقي",],},// قطاع الشرقي
      {Selected_Value: "الجنوبي - نينوى", Showed_Value: ["الجنوبي - نينوى",],},// قطاع الجنوبي - نينوى
      {Selected_Value: "سنجار", Showed_Value: ["سنجار",],},// قطاع سنجار
      //قطاعات توزيع كهرباء مركز نينوى
      {Selected_Value: "مركز نينوى", Showed_Value: ["مركز نينوى",],},//قطاع مركز نينوى
      //قطاعات توزيع كهرباء جنوب صلاح الدين
      {Selected_Value: "جنوب صلاح الدين", Showed_Value: ["جنوب صلاح الدين"],},//قطاع جنوب صلاح الدين
      //قطاعات توزيع كهرباء صلاح الدين
      {Selected_Value: "صلاح الدين", Showed_Value: ["صلاح الدين",],},//قطاع صلاح الدين
      //قطاعات توزيع كهرباء كركوك
      {Selected_Value: "كركوك", Showed_Value: ["كركوك",],},// قطاع كركوك
      //قطاعات توزيع كهرباء ديالى
      {Selected_Value: "الخالص", Showed_Value: ["الخالص المركز", "الخالص الاطراف", "الاسود", "السعدية", "مفرزة الزركانية", "مفرزة الناي", "دار السلام"],},// قطاع الخالص
      {Selected_Value: "بعقوبة الاطراف", Showed_Value: ["شرق بني سعد", "غرب بني سعد", "العبارة", "حد مزيد والباوية"],},// قطاع بعقوبة الاطراف
      {Selected_Value: "هبهب", Showed_Value: ["هبهب", "سيف سعد",],},//صيانات هبهب
      {Selected_Value: "بهرز", Showed_Value: ["بهرز المركز", "بهرز الاطراف",],},//صيانات بهرز
      {Selected_Value: "بلدروز", Showed_Value: ["بلدروز الاطراف", "بلدروز الشمالي", "بلدروز الجنوبي",],},//صيانات بلدروز
      {Selected_Value: "الوجيهية", Showed_Value: ["الوجيهية", "ابي صيدا", "زهيرات",],},//صيانات الوجيهية
      {Selected_Value: "مقدادية", Showed_Value: ["المقدادية الشرقي", "المقدادية الغربي", "نوفل", "سنسل", ],},//صيانات المقدادية
      {Selected_Value: "مندلي", Showed_Value: ["مندلي", "قزانية",],},//صيانات مندلي
      {Selected_Value: "المنصورية", Showed_Value: ["المنصورية",],},//صيانات المنصورية
      {Selected_Value: "جديدة الشط", Showed_Value: ["جديدة الشط", "الحويش", "منصورية الشط",],},//صيانات جديدة الشط
      //قطاعات توزيع شمال ديالى
      {Selected_Value: "العظيم", Showed_Value: ["الشرقي / شمال ديالى", "الغربي / شمال ديالى", "الاطراف",],},//قطاع العظيم
      {Selected_Value: "جلولاء", Showed_Value: ["جلولاء الاول", "جلولاء الثاني", "السعدية / شمال ديالى",],},//قطاع جلولاء
      {Selected_Value: "كشكولات", Showed_Value: ["كشكولات", "حمرين", "قرة تبة", "جبارة"],},//قطاع كشكولات
      {Selected_Value: "خانقين", Showed_Value: ["المركز / شمال ديالى", "الاطراف / شمال ديالى"],},//قطاع خانقين
      //قطاعات توزيع الفرات الاعلى
      {Selected_Value: "حديثة", Showed_Value: ["السد", "حديثة", "حقلانية",],},// قطاع حديثة
      {Selected_Value: "عنة", Showed_Value: ["عنة",],},// قطاع عنة
      {Selected_Value: "القائم", Showed_Value: ["القائم", "العبيدي", "الكرابلة",],},// قطاع القائم
      {Selected_Value: "الرمانة", Showed_Value: ["الرمانة",],},// قطاع الرمانة
      {Selected_Value: "بروانة", Showed_Value: ["بروانة", "السكران",],},// قطاع بروانة
      {Selected_Value: "راوه", Showed_Value: ["راوة",],},// قطاع راوه
      {Selected_Value: "البغدادي", Showed_Value: ["البغدادي", "الدولاب",],},// قطاع البغدادي
      //قطاعات توزيع الانبار
      {Selected_Value: "الرمادي", Showed_Value: ["الرمادي",],},// قطاع الرمادي
      {Selected_Value: "غرب الرمادي", Showed_Value: ["الرحالية", "غرب الرمادي", "التاميم", "الوفاء", "اليرموك / مركز الانبار",],},// قطاع غرب الرمادي
      {Selected_Value: "هيت", Showed_Value: ["الفرات / مركز الانبار", "هيت", "كبيسة", "المحمدي",],},// قطاع هيت
      {Selected_Value: "الخالدية", Showed_Value: ["الخالدية",],},// قطاع الخالدية
      {Selected_Value: "الرطبة", Showed_Value: ["الرطبة",],},// قطاع الرطبة
      //قطاعات توزيع شرق الانبار
      {Selected_Value: "الفلوجة الشمالي", Showed_Value: ["الشمالي / شرق الانبار", "النساف", "الحضرة", "الجغيفي الثانية", "المختار",],},//صيانات الفلوجة الشمالي
      {Selected_Value: "الفلوجة الجنوبي", Showed_Value: ["الجنوبي / شرق الانبار", "الشرقية", "النعيمية", "الحصي", "الاكرمين",],},//صيانات الفلوجة الجنوبي
      {Selected_Value: "الصقلاوية", Showed_Value: ["الصقلاوية", "ابو سديرة",],},//صيانات الصقلاوية
      {Selected_Value: "الكرمة", Showed_Value: ["الجزيرة / شرق الانبار", "الكرمة / شرق الانبار", "الخيرات", "السمنت", "شمال ذراع دجلة"],},//صيانات الكرمة
      {Selected_Value: "العامرية", Showed_Value: ["الشروق", "الصمود"],},//صيانات العامرية
      //قطاعات توزيع كهرباء واسط
      {Selected_Value: "الكوت الاول", Showed_Value: ["الزهراء", "شيخ سعد"],},//صيانات الكوت الاول
      {Selected_Value: "الكوت الثاني", Showed_Value: ["الكرامة / واسط", "ناحية واسط القديمة",],},//صيانات الكوت الثاني
      {Selected_Value: "الكوت الثالث", Showed_Value: ["الكوت الجديدة"],},//صيانات الكوت الثالث
      {Selected_Value: "الحكيم", Showed_Value: ["الحكيم"],},//صيانات الحكيم
      {Selected_Value: "الصويرة", Showed_Value: ["الرحمانية"],},//صيانات الصويرة
      {Selected_Value: "العزيزية", Showed_Value: ["الدبوني",],},//صيانات العزيزية
      {Selected_Value: "الزبيدية", Showed_Value: ["الزبيدية"],},//صيانات الزبيدية
      {Selected_Value: "تاج الدين", Showed_Value: ["تاج الدين",],},//صيانات تاج الدين
      {Selected_Value: "النعمانية", Showed_Value: ["النعمانية"],},//صيانات النعمانية
      {Selected_Value: "الاحرار", Showed_Value: ["الاحرار", "المزاك"],},//صيانات الاحرار
      {Selected_Value: "بدرة", Showed_Value: ["بدرة", "جصان"],},//صيانات بدرة
      {Selected_Value: "الحي", Showed_Value: ["الحي",],},//صيانات الحي
      {Selected_Value: "الموفقية", Showed_Value: ["الموفقية / واسط",],},//صيانات الموفقية
      {Selected_Value: "البشائر", Showed_Value: ["البشائر",],},//صيانات البشائر
    ];

    let Result = Third_Sections.find((Finding) => event === Finding.Selected_Value);
    if(Result){
      this.group_of_form[0].fields[4].properties[0].values = Result.Showed_Value;
      document.getElementById("14763").style.display = "block";
    }else{
      this.group_of_form[0].fields[4].properties[0].values = [];
      document.getElementById("14763").style.display = "none";
    }
  },
}