{
  //فلترة فروع المحافظات
  getCompany(event) {
    //يصفر حقل الفروع
    this.inputFormField["branch"] = null;
    //مصفوفة فروع كل محافظة
    var sectionss = [
      //شركة توزيع كهرباء بغداد
      ["توزيع كهرباء الكرخ", "توزيع كهرباء الرصافة", "توزيع كهرباء مدينة الصدر"],//فروع بغداد
      
      //شركة توزيع كهرباء الفرات الاوسط
      ["توزيع كهرباء بابل"], //فروع بابل
      ["توزيع كهرباء كربلاء المقدسة"], //فروع كربلاء
      ["توزيع كهرباء النجف الاشرف"], //فروع النجف
      ["توزيع كهرباء الديوانية"], //فروع الديوانية (القادسية)

      //شركة توزيع كهرباء الجنوب
      ["توزيع كهرباء ذي قار","توزيع كهرباء شمال الناصرية",], //فرع ذي قار
      ["توزيع كهرباء شمال البصرة","توزيع كهرباء البصرة",], //فرع البصرة
      ["توزيع كهرباء ميسان",], //فرع ميسان
      ["توزيع كهرباء المثنى",], //فرع المثنى

      //شركة تزويع كهرباء الشمال
      ["توزيع كهرباء اطراف نينوى", "توزيع كهرباء مركز نينوى"], //فرع نينوى
      ["توزيع كهرباء جنوب صلاح الدين", "توزيع كهرباء صلاح الدين",], //فرع صلاح الدين
      ["توزيع كهرباء كركوك",], //فرع كركوك

      //شركة توزيع كهرباء الوسط
      ["توزيع كهرباء ديالى", "توزيع كهرباء شمال ديالى", ], //فرع ديالى
      ["توزيع كهرباء الفرات الاعلى", "توزيع كهرباء مركز الانبار", "توزيع كهرباء شرق الانبار",], //الانبار
      ["توزيع كهرباء واسط"], //واسط
    ],
    //قيم مال سلكتر المحافظات
    Selected_Values = [
      "بغداد", "بابل", "كربلاء المقدسة", "النجف الاشرف", "القادسية", "ذي قار", "البصرة", "ميسان", "المثنى", "نينوى",
      "صلاح الدين", "كركوك", "ديالى", "الانبار", "واسط"
    ];

    for(var i = 0; i < Selected_Values.length; i++){
      if(event == Selected_Values[i]){
        this.group_of_form[0].fields[2].properties[0].values = sectionss[i];
        document.getElementById("14761").style.display = "block";
        break;
      }else{
        document.getElementById("14761").style.display = "none";
        this.group_of_form[0].fields[2].properties[0].values = [];
      }
    }

    var Central_Company = ["بابل", "كربلاء المقدسة", "النجف الاشرف", "القادسية",], //"شركة توزيع كهرباء الفرات الاوسط"
        Southern_Company = ["ذي قار", "البصرة", "ميسان", "المثنى",], //"شركة توزيع كهرباء الجنوب"
        Northern_Company = ["نينوى", "صلاح الدين", "كركوك",], //"شركة توزيع كهرباء الشمال"
        Middle_Company = ["ديالى", "الانبار", "واسط",]; //"شركة توزيع كهرباء الوسط"
    
    if(event == "بغداد"){
      this.inputFormField.CompanyType = "شركة توزيع كهرباء بغداد";
    }else if(Central_Company.includes(event)){
      this.inputFormField.CompanyType = "شركة توزيع كهرباء الفرات الاوسط";
    }else if(Southern_Company.includes(event)){
      this.inputFormField.CompanyType = "شركة توزيع كهرباء الجنوب";
    }else if(Northern_Company.includes(event)){
      this.inputFormField.CompanyType = "شركة توزيع كهرباء الشمال";
    }else if(Middle_Company.includes(event)){
      this.inputFormField.CompanyType = "شركة توزيع كهرباء الوسط";
    }else{
      this.inputFormField.CompanyType = "";
    }
  },

  //فلترة قطاعات الفروع
  gitSections(event) {
    //يصفر حقل القطاعات
    this.inputFormField["section"] = null;
    //مصفوفة فروع كل محافظة
    var Selected_Values = [
      //شركة توزيع كهرباء بغداد
      "توزيع كهرباء الكرخ", //فروع بغداد
      "توزيع كهرباء الرصافة",
      "توزيع كهرباء مدينة الصدر",
      //شركة توزيع كهرباء الفرات الاوسط
      "توزيع كهرباء بابل", //فروع بابل
      "توزيع كهرباء كربلاء المقدسة", //فروع كربلاء
      "توزيع كهرباء النجف الاشرف", //فروع النجف
      "توزيع كهرباء الديوانية", //فروع الديوانية (القادسية)
      //شركة توزيع كهرباء الجنوب
      "توزيع كهرباء ذي قار","توزيع كهرباء شمال الناصرية", //فرع ذي قار
      "توزيع كهرباء شمال البصرة","توزيع كهرباء البصرة", //فرع البصرة
      "توزيع كهرباء ميسان", //فرع ميسان
      "توزيع كهرباء المثنى", //فرع المثنى
      //شركة تزويع كهرباء الشمال
      "توزيع كهرباء اطراف نينوى", "توزيع كهرباء مركز نينوى", //فرع نينوى
      "توزيع كهرباء جنوب صلاح الدين", "توزيع كهرباء صلاح الدين", //فرع صلاح الدين
      "توزيع كهرباء كركوك", //فرع كركوك
      //شركة توزيع كهرباء الوسط
      "توزيع كهرباء ديالى", "توزيع كهرباء شمال ديالى", //فرع ديالى
      "توزيع كهرباء الفرات الاعلى", "توزيع كهرباء مركز الانبار", "توزيع كهرباء شرق الانبار", //الانبار
      "توزيع كهرباء واسط", //واسط
    ];
    //مصفوفة قطاعات الفروع
    var sectionss = [
      //محافظة بغداد
      [
        "قطاع الكرخ الشمالي", "قطاع الكرخ الجنوبي", "قطاع الكاظمية", "قطاع الحرية", "قطاع السلام", "قطاع البياع", 
        "قطاع العامل", "قطاع الكرخ المركز", "قطاع الشعلة", "قطاع الدورة", "قطاع ابي غريب", "قطاع الغزالية"
      ],//"توزيع كهرباء الكرخ"
      [
        "قطاع الرصافة الشمالي","قطاع الرصافة الجنوبي","قطاع فلسطين","قطاع الرصافة المركز","قطاع الرصافة اطراف الجنوبي","قطاع الاعظمية"
      ],//"توزيع كهرباء الرصافة"
      [
        "قطاع اور", "قطاع الراشدية", "قطاع الصدر الاول", "قطاع الصدر الثاني", "قطاع الصدر الثالث", "قطاع البنوك",
        "قطاع الكمالية", "قطاع المنتظر", "قطاع الحسينية", "قطاع بوب الشام", "قطاع البلديات", "قطاع الامين", 
        "قطاع العبيدي", "قطاع الشعب", "قطاع العطاء",
      ],//"توزيع كهرباء مدينة الصدر"
      
      //محافظة بابل
      [
        "الحمزة الغربي", "الشوملي","الهاشمية", "المسيب", "الاسكندرية", "الفيحاء", "الرافدين", "النيل", "ابي غرق",
        "كوثى", "الكفل", "الحلة", "المحاويل", "القاسم",
      ],//"قطاعات توزيع كهرباء بابل"
      
      //محافظة كربلاء
      [
        "الهندية","عين التمر","الحسينية - كربلاء","الجدول الغربي","الجنوبي","المركز - كربلاء","الشمالي","الحر"
      ],//"قطاعات توزيع كهرباء كربلاء"
      
      //محافظة النجف
      [
        "الجنوبي - النجف", "العروبة", "الشمالي - النجف", "الحيدرية", "الكوفة", "العباسية", "المناذرة", "المشخاب",
      ],//"قطاعات توزيع كهرباء النجف"
      
      //محافظة الديوانية
      [
        "الديوانية الاول", "الديوانية الثاني", "الشامية - الديوانية", "عفك", "الدغارة", "الحمزة - الديوانية", "غماس",
      ],//"قطاعات توزيع كهرباء الديوانية"
      
      //محافظة ذي قار
      [
        "الجزيرة", "الشامية", "الفرات", "الاهوار", "جنوب ذي قار",
      ], //قطاعات توزيع كهرباء ذي قار
      [
        "الشطرة", "الغراف", "القلعة", "الرفاعي",
      ], //قطاعات توزيع كهرباء الناصرية
      
      //محافظة البصرة
      [
        "الزبير", "سفوان", "شط العرب", "شهداء الجراحي", "الدير", "القرنة", "المدينة",
      ], //قطاعات توزيع كهرباء شمال البصرة
      [
        "5 ميل", "العشار", "الفاو", "المركز", "الجمهورية", "الجنينة", "غرب البصرة", "ابي الخصيب", "شمال البصرة", "القبلة",
      ], //قطاعات توزيع كهرباء البصرة
      
      //محافظة ميسان
      [
        "العمارة الأول", "العمارة الثاني", "شمال العمارة", "شرق العمارة", "غرب العمارة",
      ],//قطاعات توزيع كهرباء ميسان
      
      //محافظة المثنى
      [
        "الصوب الكبير", "الصوب الصغير", "الرميثة", "الوركاء", "الخضر",
      ],//قطاعات توزيع كهرباء المثنى
      
      //محافظة نينوى
      [
        "الغربي", "محلبية وبادوش", "تلكيف", "برطلة", "بعشيقة", "الشرقي", "الجنوبي - نينوى", "سنجار",
      ],//قطاعات توزيع كهرباء اطراف نينوى
      [
        "مركز نينوى",
      ], //قطاعات توزيع كهرباء مركز نينوى
      
      //محافظة صلاح الدين
      [
        "جنوب صلاح الدين",
      ],//قطاعات توزيع كهرباء جنوب صلاح الدين
      [
        "صلاح الدين",
      ],//قطاعات توزيع كهرباء صلاح الدين
      
      //محافظة كركوك
      [
        "كركوك",
      ],//قطاعات توزيع كهرباء كركوك
      
      //محافظة ديالى
      [
        "الخالص", "بعقوبة الاطراف", "هبهب", "بهرز", "بلدروز", "الوجيهية", "مقدادية", "مندلي", "المنصورية" , "جديدة الشط",
      ],//قطاعات توزيع كهرباء ديالى
      [
        "العظيم", "جلولاء", "كشكولات", "خانقين",
      ],//قطاعات توزيع شمال ديالى
      
      //محافظة الانبار
      [
        "حديثة", "عنة", "القائم", "الرمانة", "بروانة", "راوه", "البغدادي",
      ], //قطاعات توزيع الفرات الاعلى
      [
        "الرمادي", "غرب الرمادي", "هيت", "الخالدية", "الرطبة",
      ], //قطاعات توزيع الانبار
      [
        "الفلوجة الشمالي", "الفلوجة الجنوبي", "الصقلاوية", "الكرمة", "العامرية"
      ], //قطاعات توزيع شرق الانبار
      
      //محافظة واسط
      [
        "الكوت الاول", "الكوت الثاني", "الكوت الثالث", "الحكيم", "الصويرة", "العزيزية", "الزبيدية", "تاج الدين", 
        "النعمانية", "الاحرار", "بدرة", "الحي", "الموفقية", "البشائر",
      ],//قطاعات توزيع كهرباء واسط
    ];

    for(var i = 0; i < Selected_Values.length; i++){
      if(event == Selected_Values[i]){
        this.group_of_form[0].fields[3].properties[0].values = sectionss[i];
        document.getElementById("14762").style.display = "block";
        break;
      }else{
        document.getElementById("14762").style.display = "none";
        this.group_of_form[0].fields[3].properties[0].values = [];
      }
    }
  },

//فلترة صيانات القطاعات
getMaintain(event) {
  //يصفر حقل الصيانات
    this.inputFormField["maintains"] = null;
    //مصفوفة قطاعات الفروع
    var sectionss = [
      //محافظة بغداد
      //"توزيع كهرباء الكرخ"
      "قطاع الكرخ الشمالي", "قطاع الكرخ الجنوبي", "قطاع الكاظمية", "قطاع الحرية", "قطاع السلام", "قطاع البياع", 
      "قطاع العامل", "قطاع الكرخ المركز", "قطاع الشعلة", "قطاع الدورة", "قطاع ابي غريب", "قطاع الغزالية",
      //"توزيع كهرباء الرصافة"
      "قطاع الرصافة الشمالي","قطاع الرصافة الجنوبي","قطاع فلسطين","قطاع الرصافة المركز",
      "قطاع الرصافة اطراف الجنوبي","قطاع الاعظمية",
      //"توزيع كهرباء مدينة الصدر"
      "قطاع اور", "قطاع الراشدية", "قطاع الصدر الاول", "قطاع الصدر الثاني", "قطاع الصدر الثالث", "قطاع البنوك",
      "قطاع الكمالية", "قطاع المنتظر", "قطاع الحسينية", "قطاع بوب الشام", "قطاع البلديات", "قطاع الامين", 
      "قطاع العبيدي", "قطاع الشعب", "قطاع العطاء",
      
      //محافظة بابل
      //"قطاعات توزيع كهرباء بابل"
      "الحمزة الغربي", "الشوملي","الهاشمية", "المسيب", "الاسكندرية", "الفيحاء", "الرافدين", "النيل", "ابي غرق",
      "كوثى", "الكفل", "الحلة", "المحاويل", "القاسم",
      
      //محافظة كربلاء
      //"قطاعات توزيع كهرباء كربلاء"
      "الهندية","عين التمر","الحسينية - كربلاء","الجدول الغربي","الجنوبي","المركز - كربلاء","الشمالي","الحر",
      
      //محافظة النجف
      //"قطاعات توزيع كهرباء النجف"
      "الجنوبي - النجف", "العروبة", "الشمالي - النجف", "الحيدرية", "الكوفة", "العباسية", "المناذرة", "المشخاب",
      
      //محافظة الديوانية
      //"قطاعات توزيع كهرباء الديوانية"
      "الديوانية الاول", "الديوانية الثاني", "الشامية - الديوانية", "عفك", "الدغارة", "الحمزة - الديوانية", "غماس",
      
      //محافظة ذي قار
      //قطاعات توزيع كهرباء ذي قار
      "الجزيرة", "الشامية", "الفرات", "الاهوار", "جنوب ذي قار",
      //قطاعات توزيع كهرباء الناصرية
      "الشطرة", "الغراف", "القلعة", "الرفاعي",
      
      //محافظة البصرة
      //قطاعات توزيع كهرباء شمال البصرة
      "الزبير", "سفوان", "شط العرب", "شهداء الجراحي", "الدير", "القرنة", "المدينة",
      //قطاعات توزيع كهرباء البصرة
      "5 ميل", "العشار", "الفاو", "المركز", "الجمهورية", "الجنينة", "غرب البصرة", "ابي الخصيب", "شمال البصرة", "القبلة",
      
      //محافظة ميسان
      //قطاعات توزيع كهرباء ميسان
      "العمارة الأول", "العمارة الثاني", "شمال العمارة", "شرق العمارة", "غرب العمارة",
      
      //محافظة المثنى
      //قطاعات توزيع كهرباء المثنى
      "الصوب الكبير", "الصوب الصغير", "الرميثة", "الوركاء", "الخضر",
      
      //محافظة نينوى
      //قطاعات توزيع كهرباء اطراف نينوى
      "الغربي", "محلبية وبادوش", "تلكيف", "برطلة", "بعشيقة", "الشرقي", "الجنوبي - نينوى", "سنجار",
      //قطاعات توزيع كهرباء مركز نينوى
      "مركز نينوى",
      
      //محافظة صلاح الدين
      //قطاعات توزيع كهرباء جنوب صلاح الدين
      "جنوب صلاح الدين",
      //قطاعات توزيع كهرباء صلاح الدين
      "صلاح الدين",
      
      //محافظة كركوك
      //قطاعات توزيع كهرباء كركوك
      "كركوك",
      
      //محافظة ديالى
      //قطاعات توزيع كهرباء ديالى
      "الخالص", "بعقوبة الاطراف", "هبهب", "بهرز", "بلدروز", "الوجيهية", "مقدادية", "مندلي", "المنصورية" , "جديدة الشط",
      //قطاعات توزيع شمال ديالى
      "العظيم", "جلولاء", "كشكولات", "خانقين",
      
      //محافظة الانبار
      //قطاعات توزيع الفرات الاعلى
      "حديثة", "عنة", "القائم", "الرمانة", "بروانة", "راوه", "البغدادي",
      //قطاعات توزيع الانبار
      "الرمادي", "غرب الرمادي", "هيت", "الخالدية", "الرطبة",
      //قطاعات توزيع شرق الانبار
      "الفلوجة الشمالي", "الفلوجة الجنوبي", "الصقلاوية", "الكرمة", "العامرية",
      
      //محافظة واسط
      //قطاعات توزيع كهرباء واسط
      "الكوت الاول", "الكوت الثاني", "الكوت الثالث", "الحكيم", "الصويرة", "العزيزية", "الزبيدية", "تاج الدين", 
      "النعمانية", "الاحرار", "بدرة", "الحي", "الموفقية", "البشائر",
    ];
    
    //مصفوفة صيانات القطاعات
    var maintain = [
      //شركة توزيع كهرباء بغداد
      //محافظة بغداد
      //"توزيع كهرباء الكرخ"
      ["النصر","المشاهدة","الطارمية", "شاطئ الطارمية", "العبايجي"],//صيانات قطاع الكرخ الشمالي
      ["المحمودية","الرشيد","اليوسفية","الزنبرانية","صدر اللطيفية","اللطيفية","عويريج"],//صيانات قطاع الكرخ الجنوبي
      ["الكاظمية","العطيفية","سبع البور","التاجي"],//صيانات قطاع الكاظمية
      ["الحرية"],//صيانات قطاع الحرية
      ["الكرامة","العلاوي","الطوبجي"],//صيانات قطاع السلام
      ["الاعلام", "السيدية", "البياع"],//صيانات قطاع البياع
      ["العامل", "الجهاد", "الرضوانية"],//صيانات قطاع العامل  
      ["الخضراء والعامرية", "اليرموك", "المنصور","الجامعة والعدل","كرادة مريم"],//صيانات قطاع الكرخ المركز
      ["صيانة الشعلة", "الدوانم"],//صيانات قطاع الشعلة
      ["الميكانيك","الدورة الشمالي","الدورة الجنوبي"],//صيانات قطاع الدورة
      ["النصر والسلام","الزيتون","الشهداء",],//صيانات قطاع ابي غريب
      ["الكفاءات", "الغزالية",],//صيانات قطاع الغزالية
      
      //"توزيع كهرباء الرصافة"
      ["الفضل","المثنى","السعدون"],//صيانات قطاع الرصافة الشمالي
      ["الزعفرانية","جسر ديالى","المدائن"],//صيانات قطاع الرصافة الجنوبي
      ["فلسطين","الغدير"],//صيانات قطاع فلسطين
      ["بغداد الجديدة","الفتح"],//صيانات قطاع الرصافة المركز
      ["النهروان","الوحدة"],//صيانات قطاع الرصافة اطراف الجنوبي
      ["الاعظمية","الوزيرية"],//صيانات قطاع الاعظمية
      
      //"توزيع كهرباء مدينة الصدر"
      ["صيانات قطاع اور"],//صيانات قطاع اور
      ["صيانات قطاع الراشدية"],//صيانات قطاع الراشدية
      ["صيانات قطاع الصدر الاول"],//صيانات قطاع الصدر الاول
      ["صيانات قطاع الصدر الثاني"],//صيانات قطاع الصدر الثاني
      ["صيانات قطاع الصدر الثالث"],//صيانات قطاع الصدر الثالث
      ["صيانات قطاع البنوك"],//صيانات قطاع البنوك
      ["صيانات قطاع الكمالية"],//صيانات قطاع الكمالية
      ["صيانات قطاع المنتظر"],//صيانات قطاع المنتظر
      ["صيانات قطاع الحسينية"],//صيانات قطاع الحسينية
      ["صيانات قطاع بوب الشام"],//صيانات قطاع بوب الشام
      ["صيانات قطاع البلديات"],//صيانات قطاع البلديات
      ["صيانات قطاع الامين"],//صيانات قطاع الامين
      ["صيانات قطاع العبيدي"],//صيانات قطاع العبيدي
      ["صيانات قطاع الشعب"],//صيانات قطاع الشعب
      ["صيانات قطاع العطاء"], //صيانات قطاع العطاء
      
      //شركة توزيع كهرباء الفرات الاوسط
      // محافظة بابل
      //"قطاعات توزيع كهرباء بابل"
      ["الحمزة الغربي",],//قطاع الحمزة الغربي
      ["الشوملي",],//قطاع الشوملي
      ["الهاشمية",],//قطاع الهاشمية
      ["المسيب", "السدة",],//قطاع المسيب
      ["الاسكندرية",],//قطاع الاسكندرية
      ["الفيحاء - بابل",],//قطاع الفيحاء
      ["الرافدين",],//قطاع الرافدين
      ["النيل",],//قطاع النيل
      ["ابي غرق",],//قطاع ابي غرق
      ["كوثى",],//قطاع كوثى
      ["الكفل",],//قطاع الكفل
      ["الحلة",],//قطاع الحلة
      ["المحاويل", "الامام", "تونس",],//قطاع المحاويل
      ["القاسم", "الشهداء - بابل", "الطليعة",],//قطاع القاسم

      // محافظة كربلاء
      //"قطاعات توزيع كهرباء كربلاء"
      ["الهندية"],//قطاع الهندية
      ["عين التمر"],//قطاع عين التمر
      ["الحسينية - كربلاء"],//قطاع الحسينية - كربلاء
      ["الجدول الغربي"],//قطاع الجدول الغربي
      ["الجنوبي"],//قطاع الجنوبي
      ["المركز - كربلاء"],//قطاع المركز - كربلاء
      ["الشمالي"],//قطاع الشمالي
      ["الحر"],//قطاع الحر

      // محافظة النجف
      //"قطاعات توزيع كهرباء النجف"
      ["الجنوبي - النجف",],//قطاع الجنوبي - النجف
      ["العروبة",],//قطاع العروبة
      ["الشمالي - النجف",],//قطاع الشمالي - النجف
      ["الحيدرية",],//قطاع الحيدرية
      ["الكوفة",],//قطاع الكوفة
      ["العباسية",],//قطاع العباسية
      ["المناذرة",],//قطاع المناذرة
      ["المشخاب",],//قطاع المشخاب

      // محافظة الديوانية
      //"قطاعات توزيع كهرباء الديوانية"
      ["الديوانية الاول",],//قطاع الديوانية الاول
      ["الديوانية الثاني",],//قطاع الديوانية الثاني
      ["الشامية - الديوانية",],//قطاع الشامية - الديوانية
      ["عفك",],//قطاع عفك
      ["الدغارة",],//قطاع الدغارة
      ["الحمزة - الديوانية",],//قطاع الحمزة - الديوانية
      ["غماس",],//قطاع غماس

      // شركة توزيع كهرباء الجنوب
      // محافظة ذي قار
      //قطاعات توزيع كهرباء ذي قار
      ["سومر", "الجزيرة", "النور",],// قطاع الجزيرة
      ["الشامية", "البطحاء", "الشموخ", "الفضلية", "الاسكان"],// قطاع الشامية
      ["الفرات", "الشهداء(مقر القطاع)", "اور",],// قطاع الفرات
      ["الجبايش", "المنار", "الفهود", "الاصلاح", "سيد دخيل",],// قطاع الاهوار
      ["السوق", "الشموع", "العكيكة", "الكرمة", "الطار",],// قطاع جنوب ذي قار
      
      //قطاعات توزيع كهرباء الناصرية
      ["الشعلة", "اكد",],// قطاع الشطرة
      ["الغراف", "الدواية",], // قطاع الغراف
      ["الفجر", "قلعة سكر",],// قطاع القلعة
      ["الرفاعي 1", "الرفاعي 2", "النصر(مقر القطاع)",], // قطاع الرفاعي

      // محافظة البصرة
      //قطاعات توزيع كهرباء شمال البصرة
      ["الخطوة", "المربد", "الشعيبة", "الدريهمية",], // قطاع الزبير
      ["سفوان", "ام قصر", "خور الزبير",], // قطاع سفوان
      ["التنومة", "الصالحية", "الفيحاء", "كتيبان", "الزريجي",], // قطاع شط العرب
      ["كرمة علي", "الهارثة", "شهداء الجراحي",], // قطاع شهداء الجراحي
      ["الدير", "النشوة", "الشافي"], // قطاع الدير
      ["القرنة", "الشرش", "الثغر",], // قطاع القرنة
      ["المدينة", "الصادق", "عز الدين سليم", "الماجدية",], // قطاع المدينة
      
      //قطاعات توزيع كهرباء البصرة
      ["5 ميل", "الجامعة(مقر القطاع)", "غرب الصلال", "حي الغدير",], // قطاع 5 ميل
      ["العشار", "البراضعية",], // قطاع العشار
      ["البحار", "الفاو", "السيبة",], // قطاع الفاو
      ["البصرة", "المشراق",], // قطاع المركز
      ["الجمهورية", "الموفقية",], // قطاع الجمهورية
      ["الجبيلة", "الجنينة",], // قطاع الجنينة
      ["الجمعيات", "حي الحسين", "حي العباس",], // قطاع غرب البصرة
      ["الساحل", "الصناعية", "السياب", "حمدان", "كوت الصلحي", "ابي الخصيب",], // قطاع ابي الخصيب
      ["السكك", "المعقل", "حي البتول",], // قطاع شمال البصرة
      ["القبلة", "حي المهندسين", "دور الشرطة", "حي الجهاد",], // قطاع القبلة

      // محافظة ميسان
      //قطاعات توزيع كهرباء ميسان
      ["بني هاشم", "العمارة الاولى", "العمارة الرابعة", "الكحلاء",],// قطاع العمارة الاول
      ["العمارة الثانية", "العمارة الثالثة", "المشرح",],// قطاع العمارة الثاني
      ["الكميت", "علي الغربي", "علي الشرقي",],// قطاع شمال العمارة
      ["القلعة الأولى", "القلعة الثانية", "العزيز", "ناحية الخير", "المجر الكبير",],// قطاع شرق العمارة
      ["العدل", "الميمونة", "السلام", "سيد احمد",],// قطاع غرب العمارة

      // محافظة المثنى
      //قطاعات توزيع كهرباء المثنى
      ["الصوب الكبير",], // قطاع الصوب الكبير
      ["الصوب الصغير",], // قطاع الصوب الصغير
      ["شرق الرميثه",], // قطاع الرميثة
      ["الوركاء", "السوير", "النجمي",], // قطاع الوركاء
      ["الخضر", "الدراجي",], // قطاع الخضر

      //شركة توزيع كهرباء الشمال
      // محافظة نينوى
      //قطاعات توزيع كهرباء اطراف نينوى
      ["الغربي",], // قطاع الغربي
      ["محلبية وبادوش",], // قطاع محلبية وبادوش
      ["تلكيف",], // قطاع تلكيف
      ["برطلة",], // قطاع برطلة
      ["بعشيقة",], // قطاع بعشيقة
      ["الشرقي",], // قطاع الشرقي
      ["الجنوبي - نينوى",], // قطاع الجنوبي - نينوى
      ["سنجار",], // قطاع سنجار
      
      //قطاعات توزيع كهرباء مركز نينوى
      ["مركز نينوى",], //قطاع مركز نينوى

      // محافظة صلاح الدين
      //قطاعات توزيع كهرباء جنوب صلاح الدين
      ["جنوب صلاح الدين"], //قطاع جنوب صلاح الدين

      //قطاعات توزيع كهرباء صلاح الدين
      ["صلاح الدين",], //قطاع صلاح الدين

      // محافظة كركوك
      //قطاعات توزيع كهرباء كركوك
      ["كركوك",], // قطاع كركوك

      // شركة توزيع كهرباء الوسط
      // محافظة ديالى
      //قطاعات توزيع كهرباء ديالى
      ["الخالص المركز", "الخالص الاطراف", "الاسود", "السعدية", "مفرزة الزركانية", "مفرزة الناي", "دار السلام"],// قطاع الخالص
      ["شرق بني سعد", "غرب بني سعد", "العبارة", "حد مزيد والباوية"],// قطاع بعقوبة الاطراف
      ["هبهب", "سيف سعد",],//صيانات هبهب
      ["بهرز المركز", "بهرز الاطراف",],//صيانات بهرز
      ["بلدروز الاطراف", "بلدروز الشمالي", "بلدروز الجنوبي",],//صيانات بلدروز
      ["الوجيهية", "ابي صيدا", "زهيرات",],//صيانات الوجيهية
      ["المقدادية الشرقي", "المقدادية الغربي", "نوفل", "سنسل", ],//صيانات المقدادية
      ["مندلي", "قزانية",],//صيانات مندلي
      ["المنصورية", ],//صيانات المنصورية
      ["جديدة الشط", "الحويش", "منصورية الشط", ],//صيانات جديدة الشط

      //قطاعات توزيع شمال ديالى
      ["الشرقي / شمال ديالى", "الغربي / شمال ديالى", "الاطراف",],//قطاع العظيم
      ["جلولاء الاول", "جلولاء الثاني", "السعدية / شمال ديالى",],//قطاع جلولاء
      ["كشكولات", "حمرين", "قرة تبة", "جبارة"],//قطاع كشكولات
      ["المركز / شمال ديالى", "الاطراف / شمال ديالى"],//قطاع خانقين

      // محافظة الانبار
      //قطاعات توزيع الفرات الاعلى
      ["السد", "حديثة", "حقلانية",], // قطاع حديثة
      ["عنة",], // قطاع عنة
      ["القائم", "العبيدي", "الكرابلة",], // قطاع القائم
      ["الرمانة",], // قطاع الرمانة
      ["بروانة", "السكران",], // قطاع بروانة
      ["راوة",], // قطاع راوه
      ["البغدادي", "الدولاب",], // قطاع البغدادي

      //قطاعات توزيع الانبار
      ["الرمادي",], // قطاع الرمادي
      ["الرحالية", "غرب الرمادي", "التاميم", "الوفاء", "اليرموك / مركز الانبار",], // قطاع غرب الرمادي
      ["الفرات / مركز الانبار", "هيت", "كبيسة", "المحمدي",], // قطاع هيت
      ["الخالدية",], // قطاع الخالدية
      ["الرطبة",], // قطاع الرطبة

      //قطاعات توزيع شرق الانبار
      ["الشمالي / شرق الانبار", "النساف", "الحضرة", "الجغيفي الثانية", "المختار",],//صيانات الفلوجة الشمالي
      ["الجنوبي / شرق الانبار", "الشرقية", "النعيمية", "الحصي", "الاكرمين",],//صيانات الفلوجة الجنوبي
      ["الصقلاوية", "ابو سديرة",],//صيانات الصقلاوية
      ["الجزيرة / شرق الانبار", "الكرمة / شرق الانبار", "الخيرات", "السمنت", "شمال ذراع دجلة"],//صيانات الكرمة
      ["الشروق", "الصمود"],//صيانات العامرية

      //محافظة واسط
      //قطاعات توزيع كهرباء واسط
      ["الزهراء", "شيخ سعد"],//صيانات الكوت الاول
      ["الكرامة / واسط", "ناحية واسط القديمة",],//صيانات الكوت الثاني
      ["الكوت الجديدة"],//صيانات الكوت الثالث
      ["الحكيم"],//صيانات الحكيم
      ["الرحمانية"],//صيانات الصويرة
      ["الدبوني",],//صيانات العزيزية
      ["الزبيدية"],//صيانات الزبيدية
      ["تاج الدين",],//صيانات تاج الدين
      ["النعمانية"],//صيانات النعمانية
      ["الاحرار", "المزاك"],//صيانات الاحرار
      ["بدرة", "جصان"],//صيانات بدرة
      ["الحي",],//صيانات الحي
      ["الموفقية / واسط",],//صيانات الموفقية
      ["البشائر",],//صيانات البشائر
    ];

    for(var i = 0; i < sectionss.length; i++){
      if(event == sectionss[i] ){
        this.group_of_form[0].fields[4].properties[0].values = maintain[i];
        document.getElementById("14763").style.display = "block";
        break;
      }else{
        this.group_of_form[0].fields[4].properties[0].values = [];
        document.getElementById("14763").style.display = "none";
      }
    }
  },
}