{
  if (this.tab_click == "form") {
    var Fields_ID = [
        //المعلومات الشخصية للمتقدم بالشمول
        //المعلومات الشخصية للمتقدم بالشمول
        //اسم الوكيل
        "76036", //اسم الوكيل الاول
        "76108", //اسم الوكيل الثاني
        "76109", //اسم الوكيل الثالث
        "76110", //اسم الوكيل الرابع
        //اسم الوريث
        "76037", //اسم الوريث الاول
        "76111", //اسم الوريث الثاني
        "76112", //اسم الوريث الثالث
        "76113", //اسم الوريث الرابع
        //معلومات السكن و العمل
        "75395", //اسم المدرسة الابتدائية
        "75396", //اسم المدرسة المتوسطة
        "75397", //اسم المدرسة الاعدادية
        "75399", //اسم المعهد
        "75398", //اسم الجامعة
        "75400", //اخرى
        //معلومات السجن او الاعتقال
        "75407", //اذكر الادلة الرسمية
        "75408", //اذكر الادلة الغير رسمية
      ],
      Fields_Prog = [
        //المعلومات الشخصية للمتقدم بالشمول
        //اسم الوكيل
        "wakeelname", //اسم الوكيل الاول
        "WakeelSecondName", //اسم الوكيل الثاني
        "WakeelThirdName", //اسم الوكيل الثالث
        "WakeelFourthName", //اسم الوكيل الرابع
        //اسم الوريث
        "namewareeth", //اسم الوريث الاول
        "WareethSecondName", //اسم الوريث الثاني
        "WareethThirdName", //اسم الوريث الثالث
        "WareethFourthName", //اسم الوريث الرابع
        //معلومات السكن و العمل
        "primeryshcool", //اسم المدرسة الابتدائية
        "secandryshcool", //اسم المدرسة المتوسطة
        "secanaryyschool", //اسم المدرسة الاعدادية
        "maeed", //اسم المعهد
        "collage", //اسم الجامعة
        "any", //اخرى
        //معلومات السجن او الاعتقال
        "adela", //اذكر الادلة الرسمية
        "aleela", //اذكر الادلة الغير رسمية
      ];

    for (var i = 0; i < Fields_ID.length; i++) {
      if (this.form_data[Fields_Prog[i]] == null) {
        document.getElementById(Fields_ID[i]).style.visibility = "collapse";
      }
    }
  }
}
