{
    First_Filter(event){
        var Showed_Values = [
            //وزارات
            [
                //"وزارة الداخلية", "وزارة الدفاع", "وزارة الخارجية", "وزارة الصحة", "وزارة البيئة",
                "وزارة التجارة", "وزارة الاتصالات",  "وزارة الصناعة والمعادن", "وزارة المالية", "وزارة النفط",
                "وزارة الاعمار والاسكان و البلديات والاشغال العامة", "وزارة النقل", "وزارة العدل",
                "وزارة الثقافة والسياحة والاثار", "وزارة التربية", "وزارة الموارد المائية", "وزارة الكهرباء",
                "وزارة التخطيط", "وزارة العمل والشؤون الاجتماعية", "وزارة الزراعة", "وزارة الشباب والرياضة",
                "وزارة الهجرة والمهجرين", "وزارة التعليم العالي والبحث العلمي",
            ],
            //محافظات
            [
                //"محافظة البصرة", "محافظة ديالى", "محافظة النجف الاشرف", "محافظة واسـط", "محافظة المثـنى", "محافظة ذي قـار",
                //"محافظة ميسـان", "محافظة الانبار",
                "محافظة بغداد", "محافظة كربلاء المقدسة", "محافظة نينوى", "محافظة بابـل", "محافظة كركـوك",
                "محافظة الديوانيـة", "محافظة صلاح الديـن",
            ],
            //جهات غير مرتبطة بوزارة
            [
                //"مكتب رئيس الوزراء", "رئاسة الجمهورية", "مجلس النواب", "امانة بغداد", "جهاز المخابرات الوطني",
                //"البنك المركزي العراقي", "المفوضية العليا المستقلة للانتخابات", "جهاز الامن الوطني", "سلطة الطيران المدني",
                //"المصرف العراقي التجاري", "جهاز مكافحة الإرهاب", "اللجنة الأولمبية الوطنية العراقية",
                //"مستشارية الأمن القومي", "شبكة الإعلام العراقي", "مركز العمليات الوطني", "الهيأة العليا للتنسيق بين المحافظات",
                //"هيئة الحشد الشعبي", "مجلس القضاء الأعلى", "ديوان الوقف الشيعي", "العتبة الحسينية المقدسة",
                //"العتبة العباسية المقدسة",
                "الامانة العامة لمجلس الوزراء", "المحكمة الإتحادية العليا", "المجمع العلمي العراقي", "بيت الحكمة",
                "المفوضية العليا لحقوق الانسان في العراق", "هيئة استثمار بغداد", "الهيئة العليا للحج والعمرة",
                "هيئة الاوراق المالية", "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية",
                "هيئة النزاهة", "هيئة دعاوى الملكية", "الهيئة الوطنية للمساءلة والعدالة", "الهيئة الوطنية للاستثمار",
                "هيئة الاعلام والاتصالات", "هيئة المنافذ الحدودية", "هيئة التصنيع الحربي", "هيئة الطاقة الذرية",
                "الهيئة العامة لمراقبة الواردات الاتحادية", "مجلس الدولة", "مجلس الخدمة الاتحادي",
                "مجلس شؤون المنافسة ومنع الاحتكار", "ديوان الرقابة المالية الاتحادية", "ديوان الوقف السني",
                "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية", "مؤسسة الشهداء", "مؤسسة السجناء السياسيين",
            ],
        ];

        var Original_Values = [
            "وزارة", "محافظة", "جهات غير مرتبطة بوزارة"
        ];

        this.inputFormField["PassValue"] = null;
        this.inputFormField["circle"] = null;

        if(Original_Values.includes(event)){
            for(var i = 0; i < Original_Values.length; i++){
                if(event == Original_Values[i]){
                    document.getElementById("48109").style.display = "block";
                    this.group_of_form[0].fields[3].properties[0].values = Showed_Values[i];
                    break;
                }
            }
        }else{
            document.getElementById("48109").style.display = "none";
            this.group_of_form[0].fields[3].properties[0].values = [];
        }
    },

    Second_Filter(event){
        this.inputFormField["DeptType"] = null;

        var Selected_Values = [
            [
                "محافظة نينوى", "مؤسسة الشهداء", "ديوان الرقابة المالية الاتحادية", "هيئة التصنيع الحربي", 
                "الهيئة العليا للحج والعمرة", "وزارة الاتصالات", "وزارة الهجرة والمهجرين", "وزارة العدل"
            ],//0
            [
                "محافظة صلاح الديـن", "محافظة الديوانيـة"
            ],//1
            [
                "محافظة كركـوك"
            ],//2
            [
                "محافظة بغداد", "محافظة كربلاء المقدسة", "مؤسسة السجناء السياسيين",
                "الهيئة العامة لمراقبة الواردات الاتحادية", "هيئة دعاوى الملكية", "الهيئة الوطنية للاستثمار",
                "هيئة الاعلام والاتصالات", "هيئة النزاهة", "المجمع العلمي العراقي", 
                "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية", "الهيئة الوطنية للمساءلة والعدالة",
                "وزارة التخطيط", "وزارة الثقافة والسياحة والاثار", "وزارة العمل والشؤون الاجتماعية",
                "وزارة الكهرباء", "وزارة الموارد المائية", "وزارة النفط", "وزارة الشباب والرياضة", "وزارة التجارة",
                "وزارة الصناعة والمعادن"
            ],//3
            [
                "محافظة بابـل", "مجلس شؤون المنافسة ومنع الاحتكار",
                "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية", "هيئة الطاقة الذرية",
                "وزارة التربية"
            ],//4
            [
                "هيئة الاوراق المالية", "بيت الحكمة", "مجلس الخدمة الاتحادي", "ديوان الوقف السني", "وزارة النقل",
                "وزارة المالية"
            ],//5
            [
                "هيئة استثمار بغداد", "مجلس الدولة", "المفوضية العليا لحقوق الانسان في العراق",
                "وزارة التعليم العالي والبحث العلمي"
            ],//6
            [
                "هيئة المنافذ الحدودية", "وزارة الزراعة", "وزارة الاعمار والاسكان و البلديات والاشغال العامة"
            ],//7
        ];

        var Showed_Values =[
            ["مديرية", "دائرة", "تشكيل مستقل"],//0
            ["الديوان", "مديرية", "دائرة", "تشكيل مستقل"],//1
            ["الديوان", "تشكيل مستقل"],//2
            ["دائرة", "تشكيل مستقل"],//3
            ["مديرية", "تشكيل مستقل"],//4
            ["دائرة",],//5
            ["تشكيل مستقل"],//6
            ["مديرية", "دائرة",],//7
        ];

        var found = false;
        for(var i = 0; i < Selected_Values.length; i++){
            if(Selected_Values[i].includes(event)){
                document.getElementById("73157").style.display = "block";
                this.group_of_form[0].fields[4].properties[0].values = Showed_Values[i];
                found = true;
                break;
            }
        }

        if(!found){
            document.getElementById("73157").style.display = "none";
            this.group_of_form[0].fields[4].properties[0].values = [];
        }
    },

    Third_Filter(event){
        //الديوان
        var Values1 = [
            //ديوان صلاح الدين
            [
                "ديوان محافظة صلاح الدين",
            ],
            //ديوان كركوك
            [
                "ديوان محافظة كركوك",
            ],
             //ديوان الديوانية
            [
                "ديوان محافظة الديوانية",
            ],    
        ];

        //المديريات
        var Values2 = [
            //مديريات بابل
            [
                "مديرية التدقيق والرقابة الداخلية", "مديرية العقود الحكومية",
            ],
            //مديريات نينوى
            [
                "مديرية بلديات نينوى", "مديرية بلدية الموصل", "مديرية ماء نينوى", "مديرية مجاري نينوى",
                "مديرية مباني نينوى", "مديرية إسكان نينوى", "مديرية طرق وجسور نينوى", "مديرية زراعة نينوى",
                "مديرية شباب ورياضة نينوى", "مديرية العمل والشؤون الاجتماعية نينوى", "مديرية التخطيط العمراني",
            ],
            //مديريات صلاح الدين
            [
                "مديرية بلديات صلاح الدين والمؤسسات", "مديرية بلدية تكريت", "مديرية بلدية سامراء",
                "مديرية الرياضة والشباب", "مديرية زراعة صلاح الدين", "مديرية الطرق والجسور في صلاح الدين",
                "مديرية التخطيط العمراني", "مديرية ماء صلاح الدين", "مديرية مجاري صلاح الدين",
            ],
            //مديريات الديوانية
            ["مديرية مجاري الديوانية", "مديرية الرياضة والشباب", "مديرية ماء الديوانية",],
            //مديريات مجلس شؤون المنافسة
            ["مديرية الأمور الإدارية والمالية", "مديرية الأمور القانونية", "مديرية التخطيط",],
            //مديريات مؤسسة الشهداء
            [
                "مديرية شؤون المديريات واللجان", "مديرية الوثائق والمحفوظات", "مديرية الاعلام والعلاقات العامة",
                "مديرية الشؤون التعليمية والثقافية", "مديرية الأراضي والعقارات", "مديريات تخليد التضحيات",
                "مديرية الرقابة الداخلية والتدقيق",
            ],
            //ديوان الرقابة المالية الاتحادي
            ["مديرية التدقيق والرقابة الداخلية",],
            //هيئة التصنيع الحربي
            ["مديرية التدقيق والرقابة الداخلية",],
            //الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية
            [
                "مديرية الشؤون القانونية", "مديرية التخطيط والمتابعة", "مديرية الرقابة النووية",
                "مديرية الرقابة على حظر الانتشار", "مديرية الامن النووي والاشعاعي", "مديرية الطوارئ النووية والاشعاعية",
                "مديرية الرقابة الاشعاعية", "مديرية الأجهزة والمختبرات", "مديرية مراقبة التعرض الشخصي",
                "مديرية البحث والتطوير", "مديرية الأمور الإدارية والمالية",
            ],
            //هيئة الطاقة الذرية
            [
                "مديرية الشؤون القانونية والإدارية والمالية", "مديرية التطبيقات والمختبرات الاشعاعية والنووية",
                "مديرية النفايات المشعة وتصفية المنشأت النووية", "مديرية السياسات والبرامج العلمية",
                "مديرية الامن والأمان النووي والاشعاعي", "مديرية المشاريع والاسناد الفني",
            ],
            //هيئة المنافذ الحدودية
            [
                "مديرية التدقيق والرقابة الداخلية", "مديرية نافذة التبادل التجاري الواحد",
                "مديرية منفذ مطار بغداد الدولي", "مديرية منفذ المنذرية الحدودي", "مديرية منفذ مندلي الحدودي",
                "مديرية منفذ ربيعة الحدودي", "مديرية منفذ القائم الحدودي", "مديرية منفذ الوليد الحدودي",
                "مديرية منفذ طريبيل الحدودي", "مديرية منفذ عرعر الحدودي", "مديرية منفذ مطار النجف الاشرف",
                "مديرية منفذ مطار كركوك الدولي", "مديرية منفذ مطار الناصرية الدولي", "مديرية منفذ الشيب الحدودي",
                "مديرية منفذ مطار البصرة الدولي", "مديرية منفذ الشلامجة الحدودي", "مديرية منفذ سفوان الحدودي",
                "مديرية منفذ ميناء ام قصر الشمالي", "مديرية منفذ ميناء ام قصر الأوسط", "مديرية منفذ ميناء ام قصر الجنوبي",
                "مديرية منفذ ميناء خور الزبير", "مديرية منفذ ميناء المعقل", "مديرية منفذ زرباطية الحدودي",
            ],
            //هيئة الحج والعمرة
            ["مديرية التدقيق والرقابة الداخلية",],
            //وزارة الزراعة
            ["مديرية الزراعة في محافظة كركوك",],
            //وزارة الاتصالات
            ["مديرية التدقيق والرقابة الداخلية",],
            //وزارة الاعمار والاسكان
            [
                "مديرية البلديات العامة", "المديرية العامة للماء", "المديرية العامة للمجاري",
                "المديرية العامة للتخطيط العمراني",
            ],
            //وزارة التربية
            [
                "المديرية العامة للشؤون الفنية", "المديرية العامة للشؤون الإدارية والمالية", "مديرية التلفزيون التربوي",
                "مديرية التدقيق والرقابة الداخلية",
            ],
            //وزارة الهجرة والمهجرين
            ["مديرية التدقيق والرقابة الداخلية",],
            //وزارة العدل
            ["مديرية التدقيق والرقابة الداخلية",],
        ];

        //دائرة
        var Values3 = [
            //دوائر نينوى
            ["الدائرة الإدارية و المالية",],
            //صلاح الدين
            ["دائرة المباني", "دائرة الإسكان"],
            //دوائر الديوانية
            ["دائرة إسكان الديوانية"],
            //دوائر بغداد
            ["الدائرة الإدارية و المالية",],
            //دوائر كربلاء
            ["دائرة المشاريع",],
            //دوائر هيأة الاوراق المالية
            [
                "الدائرة الإدارية والقانونية", "دائرة الإفصاح المالي", "دائرة نظم الأسواق", "دائرة الرقابة والتفتيش",
                "دائرة نظم المعلومات", "دائرة التخطيط والدراسات",
            ],
            //دوائر مؤسسة السجناء السياسيين
            [
                "مديرية التدقيق والرقابة الداخلية", "الدائرة الإدارية و المالية", "الدائرة القانونية",
                "دائرة الشؤون الاقتصادية والاستثمار", "دائرة شؤون المديريات واللجان الخاصة",
                "دائرة العلاقات والإعلام والشؤون الثقافية",
            ],
            //دوائر تخصيص الواردات الاتحادية
            ["الدائرة الإدارية والمالية والقانونية", "دائرة الشؤون الفنية والمتابعة",],
            //بيت الحكمة
            [
                " رئيس مجلس الامناء", "مكتب رئيس مجلس الأمناء", "مجلس الأمناء", "مستشار رئيس مجلس الامناء",
                " مكتب الأمين العام", "مركز المعلومات ودعم اتخاذ القرار", "قسم الدراسات التاريخية",
                "قسم دراسات الاديان", "قسم الدراسات الفلسفية", "قسم الدراسات القانونية",
                "قسم الدراسات السياسية والاستراتيجية", "قسم الدراسات الاجتماعية", "قسم الدراسات الاقتصادية",
                "قسم الدراسات اللغوية والترجمية", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم شؤون المرأة",
                "مكتب التصاريح الأمنية", "الشعبة القانونية", "شعبة التدقيق", "شعبة التنسيق والمتابعة",
                "شعبة تقويم الاداء المؤسسي", "شعبة تكنلوجيا المعلومات", "شعبة الموارد البشرية", "شعبة الحسابات",
                "شعبة النشر والتوزيع", "شعبة العلاقات العامة", "شعبة العقود", "شعبة المكتبة", "شعبة الصيانة",
            ],
            //دوائر هيئة دعاوي الملكية
            ["الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة التخطيط والمتابعة وتكنولوجيا المعلومات والتدريب", "دوائر المناطق"],
            //دوائر مجلس الخدمة الاتحادي
            [
                "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة البحوث والدراسات الإدارية",
                "دائرة التطوير الاداري", "دائرة التنسيق والمتابعة مع الوزارات والجهات الحكومية",
                "مديرية التدقيق والرقابة الداخلية", "مديرية تكنولوجيا المعلومات", "مكتب رئيس المجلس",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التصاريح الأمنية", "قسم الاعلام والعلاقات العامة",
                "قسم العقود", "قسم سكرتارية المجلس",
            ],
            //دوائر الهيئة الوطنية للاستثمار
            [
                "الدائرة الاقتصادية والفنية", "الدائرة الإدارية و المالية", "دائرة العلاقات والإعلام", "الدائرة القانونية",
                "دائرة النافذة الواحدة وخدمات المستثمرين",
            ],
            //دوائر هيئة الاعلام والاتصالات
            [
                "الدائرة القانونية", "دائرة المتابعة وشؤون المحافظات", "دائرة تنظيم الاتصالات",
                "دائرة جودة الخدمة ومراقبة الطيف الترددي", "دائرة العلاقات العامة", "دائرة التنظيم الإعلامي",
                "الدائرة الإدارية و المالية", "دائرة التدقيق والرقابة الداخلية", "دائرة تنظيم تكنولوجيا والخدمات الرقمية",
                "دائرة الخدمة الشاملة", "دائرة التخطيط والتطوير", "دائرة التصاريح الأمنية", "دائرة الصيانة والخدمات",
            ],
            //دوائر مؤسسة الشهداء
            [
                "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة الاقتصاد والاستثمار والتنمية",
                "دائرة حماية المقابر الجماعية والمفقودين", "دائرة الشؤون الاجتماعية والصحية",
                "صندوق الشهداء",
            ],
            //ديوان الرقابة المالية الاتحادي
            [
                "دائرة الشؤون الفنية والدراسات", "الدائرة القانونية", "الدائرة الإدارية و المالية",
                "دائرة التدقيق والمتابعة", "دائرة تدقيق نشاط الحكم المركزي", "دائرة تدقيق نشاط الشركات",
                "دائرة تدقيق النشاط الصناعي", "دائرة تدقيق نشاط التمويل والتوزيع", "دائرة تدقيق نشاط الزراعة والتعمير",
                "دائرة تدقيق نشاط الخدمات العامة", "دائرة تدقيق النشاط الاجتماعي", "دائرة تدقيق المنطقة الأولى",
                "دائرة تدقيق المنطقة الثانية", "دائرة تدقيق المنطقة الثالثة", "دائرة تدقيق المنطقة الرابعة",
                "دائرة تدقيق المنطقة الخامسة", "دائرة تدقيق المنطقة السادسة", "دائرة تدقيق المنطقة السابعة",
                "دائرة تدقيق المنطقة الثامنة",
            ],
            //هيئة التصنيع الحربي
            [
                "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة البحث والتطوير الحربي", "الدائرة الاقتصادية",
                "الدائرة الفنية", "الدائرة الأمنية", "قسم التصاريح الأمنية", 
            ],
            //هيئة النزاهة
            [
                "دائرة التحقيقات", "الدائرة القانونية", "دائرة الوقاية", "دائرة التعليم والعلاقات العامة",
                "دائرة العلاقات مع المنظمات غير الحكومية", "الدائرة الإدارية و المالية", "دائرة الاسترداد",
                "دائرة التخطيط والبحوث",
            ],
            //هيئة المنافذ الحدودية
            [
                "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة العمليات والخطط",
            ],
            //المفوضية العليا لحقوق الانسان في العراق
            [
                "دائرة شؤون الأحزاب والتنظيمات السياسية", "الدائرة الإدارية و المالية",
                "دائرة العمليات وتكنولوجيا المعلومات", "الدائرة القانونية", "دائرة الاعلام والاتصال الجماهيري",
            ],
            //المجمع العلمي
            ["الدائرة الإدارية والمالية والقانونية",],
            //ديوان اوقاف الديانات
            [
                "الدائرة الهندسية", "دائرة اوقاف المحافظات", "الدائرة الإدارية و المالية", "الدائرة القانونية",
                "دائرة شؤون الصابئة المندائيين", "دائرة شؤون المسيحيين", "دائرة شؤون الايزيديين",
            ],
            //هيئة الحج والعمرة
            [
                "دائرة التخطيط والمتابعة", "دائرة الخدمات", "دائرة الارشاد والبحوث", "الدائرة القانونية",
                "الدائرة الإدارية و المالية", "قسم العلاقات والاعلام",
            ],
            //ديوان الوقف السني
            [
                "الدائرة القانونية", "الدائرة الإدارية و المالية", "الدائرة الهندسية",
                "دائرة التعليم الديني والدراسات الإسلامية", "دائرة المؤسسات الدينية والخيرية",
                "دائرة التخطيط والمتابعة","دائرة الاضرحة والمقامات والمراقد السنية", "دائرة البحوث والدراسات",
                "دائرة صندوق الزكاة والصدقات", "دائرة الاحتفالات الدينية والمولد النبوي الشريف",
                "كلية الامام الأعظم (رحمه الله) الجامعة", "هيئة إدارة واستثمار أموال الوقف السني",
            ],
            //الهيئة الوطنية العليا للمسائلة والعدالة
            [
                "الدائرة الإعلامية", "الدائرة المعلوماتية", "دائرة المفتش العام", "الدائرة القانونية",
                "دائرة المتابعة والتنفيذ", "دائرة الملاحقات المالية والاقتصادية", "الدائرة الإدارية و المالية",
            ],
            //وزارة النقل
            [
                "الدائرة الإدارية و المالية", "الدائرة القانونية", "الدائرة الفنية", "دائرة العقود والتراخيص",
                "دائرة التخطيط والمتابعة", "الشركة العامة لموانئ العراق", "الشركة العامة للخطوط الجوية العراقية",
                "الشركة العامة لسكك حديد العراق", "الشركة العامة لادارة المطارات والملاحة الجوية", 
                "الشركة العامة للنقل البحري", "الشركة العامة للنقل البري", "الشركة العامة لنقل المسافرين والوفود",
                "الشركة العامة لادارة النقل الخاص", "الشركة العامة لادارة مشاريع النقل والمواصلات",
                "الهيئة العامة للأنواء الجوية والرصد الزلزالي", "الهيئة البحرية العراقية العليا",
            ],
            //وزارة التخطيط
            [
                "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة العقود الحكومية العامة",
                "دائرة تخطيط القطاعات", "دائرة البرامج الاستثمارية", "دائرة التعاون الدولي", "دائرة التنمية البشرية",
                "دائرة التنمية الإقليمية", "دائرة السياسات الاقتصادية والمالية",
                "دائرة الإدارة التنفيذية الاستراتيجية التخفيف من الفقر",
            ],
            //وزارة الزراعة
            [
                "دائرة البيطرة", "دائرة البستنة", "دائرة الارشاد والتدريب الزراعي", "الشركة العامة للتجهيزات الزراعية",
                "دائرة فحص وتصديق البذور", "دائرة الغابات والتصحر", "دائرة الأراضي الزراعية", "دائرة الثروة الحيوانية",
                "شركة مابين النهرين العامة للبذور", "دائرة البحوث الزراعية", "دائرة وقاية المزروعات",
            ],
            //وزارة الاتصالات
            [
                "الدائرة القانونية", "دائرة التخطيط والمتابعة", "الدائرة الإدارية و المالية",
                "دائرة العلاقات الخارجية والاعلام",
            ],
            //وزارة الاعمار والاسكان
            [
                "المركز الوطني للمختبرات الانشائية", "المركز الوطني للاستشارات الهندسية", "دائرة الاعمار الهندسي",
                "دائرة الاشغال والصيانة العامة", "دائرة الإسكان", "دائرة المباني", "دائرة الطرق والجسور",
                "دائرة بحوث البناء", "صندوق الإسكان العراقي", "شركة حمورابي العامة للمقاولات الانشائية",
                "شركة اشور العامة للمقاولات الانشائية", "شركة الفاروق العامة للمقاولات الانشائية",
                "شركة الفاو الهندسية العامة",
            ],
            //وزارة الثقافة
            [
                "دائرة الشؤون الإدارية", "دائرة العلاقات الثقافة العامة", "دائرة قصر المؤتمرات", "دائرة الفنون الموسيقية",
                "دائرة السينما والمسرح", "دائرة الفنون العامة",
            ],
            //وزارة العمل
            [
                "مركز الوزارة", "دائرة العمل والتدريب المهني", "دائرة التقاعد والضمان الاجتماعي للعمال",
            ],
            //وزارة الهجرة والمهجرين
            [
                "الدائرة القانونية", "دائرة التخطيط والمتابعة", "الدائرة الإدارية و المالية", "دائرة المعلومات والبحوث",
                "دائرة شؤون الهجرة", "دائرة شؤون الفروع",
            ],
            //وزارة العدل
            [
                "الدائرة الإدارية و المالية", "دائرة التسجيل العقاري", "دائرة العلاقات العدلية", "دائرة رعاية القاصرين",
                "دائرة الكاتب العدول", "دائرة التنفيذ", "دائرة التخطيط العدلي", "الدائرة القانونية",
                "دائرة الإصلاح العراقية", "دائرة اصلاح الاحداث", "دائرة الوقائع العراقية", "دائرة حقوق الانسان",
            ],
            //وزارة الكهرباء
            ["قسم التدريب والتطوير", "دائرة التشغيل والتحكم",],
            //وزارة الموارد المائية
            ["مركز الوزارة", "دائرة كري الأنهر",],
            //وزارة النفط
            ["مركز الوزارة",],
            //وزارة الشباب والرياضة
            [
                "دائرة الدراسات وتطوير الملاكات والقيادات الشبابية", "دائرة الطب الرياضي والعلاج الطبيعي",
                "دائرة التنسيق والمتابعة", "دائرة التربية البدنية والرياضة", "دائرة الشؤون القانونية",
                "دائرة العلاقات والتعاون الدولي", "دائرة الشؤون الإدارية والمالية", "دائرة الشؤون الفنية",
                "دائرة شؤون الإقليم والمحافظات", "دائرة الاستثمار والتمويل الذاتي", "دائرة ثقافة وفنون الشباب",
                "الشركة العامة للاستثمارات الرياضية", "دائرة الرعاية العلمية",
            ],
            //وزارة التجارة
            [
                "الدائرة الإدارية و المالية", "دائرة تطوير القطاع الخاص", "دائرة تسجيل الشركات", "الدائرة القانونية",
                "دائرة العلاقات الاقتصادية الخارجية", "دائرة الرقابة التجارية والمالية", "دائرة التخطيط والمتابعة",
            ],
            //وزارة الصناعة والمعادن
            [
                "الدائرة الإدارية و المالية", "الدائرة الفنية", "دائرة الاستثمارات", "الدائرة القانونية",
                "دائرة التطوير والتنظيم الصناعي", "دائرة التخطيط", "الدائرة الاقتصادية",
                "دائرة الرقابة الداخلية والتدقيق",
            ],
            //وزارة المالية
            [
                "مكتب السيد الوزير والوكيل", "الدائرة الاقتصادية", "الدائرة الإدارية و المالية", "الدائرة القانونية",
                "دائرة الموازنة", "دائرة الدين العام", "دائرة المحاسبة",
            ],
        ];

        //تشكيل مستقل
        var Values4 = [
            //التشكيلات المستقلة نينوى
            [
                "مجلس التخطيط والتنمية", "مكتب المحافظ", "السكرتير العام", "مكتب التصاريح الأمنية",
                "قسم المراسلات السرية", "قسم الحسابات والموازنة", "قسم حسابات تنمية الأقاليم", "قسم العقود",
                "قسم تقنية المعلومات", "قسم شؤون المرأة", "قسم الاعلام والاتصال الحكومي", "قسم البحث والتطوير",
                "قسم تقويم الأداء", "قسم حقوق الانسان", "قسم إدارة الجودة", "قسم شؤون المواطنين",
                "قسم التنسيق الحكومي وإدارة المراسم", "قسم التخطيط العام", "قسم عمليات الامن السيبراني SOG",
                "المستشار التنسيقي", "المستشار الفني", "المستشار الإداري", "المستشار القانوني", "مستشار التخطيط",
                "قسم التنظيم المالي", "قسم التخطيط المالي", "قسم تعظيم الموارد المالية المحلية",
                "قسم الموارد البشرية والإدارية", "قسم التنمية والدراسات", "قسم القانونية والاملاك",
                "مكتب النائب الأول للمحافظ", "مكتب النائب الثاني للمحافظ", "مدير المكتب", "معاون الشؤون الإدارية",
                "قسم إدارة الموارد البشرية", "قسم الشؤون القانونية", "قسم الأملاك", "قسم التقاعد",
                "قسم إلادارة العامة والخدمات الإدارية", "قسم المكتبة المركزية", "السكرتارية",
                "معاونية شؤون النازحين والمنظمات", "قسم المركز المشترك للتنسيق والرصد GCMC", "قسم العمل التطوعي",
                "معاونية شؤون الخدمات", "قسم المتابعة والخدمات", "قسم الطاقة", "قسم التطوير الريفي",
                "معاونية التنمية والدراسات", "قسم الدراسات", "قسم تنمية المهارات", "قسم الإحصاء", "معاونية الاعمار",
                "قسم اداراة المشاريع", "قسم هندسة الإدارة المحلية", "قسم الاشراف على تنفيذ المشاريع امانة",
            ],
            //التشكيلات المستقلة صلاح الدين
            [
                "قائممقامية قضاء تكريت", "قائممقامية قضاء العلم", "قائممقامية قضاء سامراء", "قائممقامية قضاء بيجي",
                "قائممقامية قضاء الدور", "قائممقامية قضاء الطوز", "قائممقامية قضاء امرلي", "قائممقامية قضاء الضلوعية",
                "قائممقامية قضاء بلد", "قائممقامية قضاء الدجيل", "قائممقامية قضاء الشرقاط", "قسم العمل والتدريب المهني",
                "قسم رعاية ذوي الاحتياجات الخاصة", "قسم الصحة والسلامة المهنية",
            ],
            //تشكيلات كركوك
            [
                "قائممقامية قضاء مركز كركوك", "قائممقامية قضاء الحويجة", "قائممقامية قضاء الدبس",
                "قائممقامية قضاء داقوق", "مكتبة كركوك المركزية",
            ],
            //تشكيلات الديوانية
            [
                "هيأة رعاية ذوي الإعاقة والاحتياجات الخاصة", "قسم التقاعد", "قسم الشؤون المالية",
            ],
            //تشكيلات بغداد
            [
                "النائب الفني", "النائب الإداري", "قسم تعظيم الموارد المالية", "قسم التخطيط المالي",
                "قسم التنظيم المالي", "قسم الملاكات", "قسم الشؤون البلدية", "قسم نظم المعلومات", "قسم الهندسة",
                "قسم إدارة الموارد البشرية", "قسم الخدمات", "قسم المخازن", "قسم الأملاك", "قسم الحسابات",
                "قسم التعويضات", "قسم شؤون المواطنين", "قسم التخطيط العام", "قسم التدقيق والرقابة الداخلية",
                "قسم الإدارة العامة والتنسيق الحكومي", "مكتب المحافظ", "مكتب التصاريح الأمنية", "القسم القانوني",
                "قسم تمكين المرأة", "قسم الاعلام والاتصال الحكومي",
            ],
            //تشكيلات بابل
            [
                "مكتب المحافظ", "قسم المراسم", "هيئة استثمار بابل", "معاون مدير المديرية", "مكتب مدير المديرية",
                "قسم الشؤون الإدارية", "قسم التعاقدات", "قسم المتابعة والمشاريع", "قسم الرقابة", "قسم التدقيق",
                "قسم التحقيق", "قسم الشكاوي والتبليغات", "معاون التخطيط", "المعاون الإداري", "المعاون الفني",
                "المعاون المالي", "المعاون القانوني", "هيئة المستشارين", "قسم التنظيم المالي", "قسم التخطيط المالي",
                "قسم إدارة الملاك", "قسم تعظيم الموارد المالية المحلية", "قسم حسابات الخطة", "قسم المخازن",
                "قسم الحسابات", "قسم الشؤون القانونية", "قسم الأملاك", "قسم اللامركزية الإدارية",
                "قسم المتابعة والجهد الخدمي", "قسم الإحصاء ونظم المعلومات الجغرافية GIS",
                "قسم منظمات المجتمع المدني الغير حكومية", "قسم تكنولوجيا المعلومات", "قسم تقويم الأداء",
                "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم التطوير والتنمية المستدامة",
                "مديرية التخطيط والسياسات العامة",
            ],
            //تشكيلات كربلاء
            [
                "مكتب المحافظ", "مكتب النائب الأول للمحافظ", "مكتب النائب الثاني للمحافظ", "الهيئة الاستشارية",
                "قسم إدارة الموارد البشرية", "قسم التخطيط المالي", "قسم التنظيم المالي", "قسم إدارة الملاك",
                "قسم الإدارة العامة", "قسم تعظيم الموارد المالية المحلية", "قسم المشاريع الاستراتيجية",
                "قسم مشاريع التربية والتعليم", "قسم متابعة مشاريع التنمية والخطة الاستثمارية", "قسم الماء والمجاري",
                "قسم الطرق والجسور", "قسم البلديات", "قسم البلدية", "قسم الصحة", "قسم الكهرباء والاتصالات",
                "قسم الخدمات الفنية والمباني والاليات", "قسم تنظيم وتطوير المدن",
                "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم شؤون المواطنين",
                "قسم الاستشارات القانونية والتطوير الإداري", "قسم المرأة والاسرة والطفل", "قسم اعداد القادة",
                "قسم متابعة الدوائر", "قسم خدمات الدوائر", "قسم أملاك المحافظة", "قسم العقود العامة",
                "قسم التنفيذ المباشر", "قسم الشؤون القانونية", "قسم تقويم الأداء", "قسم مركز البيانات",
                "قسم التخطيط والمتابعة", "قسم تكنواوجيا دعم القرار", "قسم التدقيق والرقابة الداخلية",
                "قسم الإحصاء والسياسات العامة", "قسم الاعلام والعلاقات العامة", "قسم الثقافة والفنون",
                "معاون المحافظ لشؤون التنمية والاعمار", "معاون المحافظ لشؤون إدارة الخدمات", "قسم إدارة الخدمات العامة",
            ],
            //تشكيلات مؤسسة السجناء السياسيين
            [
                "مكتب رئيس المؤسسة", "قسم الطعون", "قسم إعادة النظر", "قسم تكنولوجيا المعلومات", "قسم العقود",
                "قسم شؤون المواطنين", "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم التصاريح الأمنية والتنسيق الوزاري",
            ],
            //دوائر تخصيص الواردات الاتحادية
            [
                "قسم الموارد البشرية", "قسم الإدارة", "قسم التقاعد", "قسم الشؤون الهندسية", "قسم الشؤون المالية",
                "قسم الشؤون القانونية", "قسم التمويل الاتحادي", "قسم الإيرادات الاتحادية", "قسم التخصيصات",
                "قسم تقويم الأداء المؤسسي", "قسم تقنية المعلومات", "قسم التدقيق والرقابة الداخلية",
                "نائب رئيس الهيئة", "مستشار الهيئة", "مكتب رئيس الهيئة", "سكرتارية نائب رئيس الهيئة",
                "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم الاعلام والاتصال الحكومي", "قسم التصاريح",
                "سكرتارية مستشار الهيئة",
            ],
            //تشكيلات هيئة دعاوي الملكية
            [
                "قسم تقويم الأداء المؤسسي", "قسم تكنولوجيا المعلومات", "قسم حقوق الانسان", "قسم شؤون المرأة",
                "مكتب رئيس الهيئة", "نائب رئيس الهيئة", "مكتب التصاريح الأمنية", "قسم شؤون المواطنين", "قسم  الاعلام",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "مديرية التدقيق والرقابة الداخلية",
            ],
            //تشكيلات مجلس شؤون المنافسة
            [
                "مكتب رئيس المجلس", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التصاريح الأمنية",
                "قسم حقوق الانسان", "قسم تقويم الأداء المؤسسي", "قسم تكنولوجيا المعلومات والاتصالات", "قسم شؤون المرأة",
                "قسم الاعلام والعلاقات العامة", "قسم التدقيق والرقابة الداخلية", "قسم التجارية", "قسم التدريب",
                "قسم الخدمات الفنية", "قسم الشؤون المالية", "قسم إدارة الموارد البشرية", "قسم التفتيش والمعاينة",
                "قسم الاستشارات القانونية", "قسم الاندماجات والتركز الاقتصادي", "قسم التحقيقات",
                "قسم التعاون الدولي والاتفاقيات", "قسم سياسات المنافسة", "قسم مراقبة السوق", "قسم الإحصاء والخطة العامة",
            ],
            //هيئة استثمار بغداد
            [
                "مكتب رئيس الهيئة", "قسم الاقتصادي والفني", "قسم العلاقات العامة", "قسم النافذة الواحدة وخدمات المستثمرين",
                "قسم الوقاية والتدقيق الداخلي", "قسم إدارة الجودة الشاملة و التطوير المؤسسي",
            ],
            //تشكيلات الهيئة الوطنية للاستثمار
            [
                "مديرية التدقيق والرقابة الداخلية", "قسم تكنولوجيا المعلومات", "قسم تقويم الأداء المؤسسي",
                "قسم العقود الحكومية", "قسم التنسيق مع المحافظات", "قسم شؤون المواطنين", "قسم المتابعة المركزية",
                "القسم الفني", "قسم الجودة والتطوير المؤسسي", "قسم التعاون الدولي", "قسم التصاريح الأمنية",
                "مكتب رئيس الهيئة", "القسم الإداري", "قسم متابعة اللجان", "قسم الاستقبال وخدمات المستثمرين",
                "قسم التنسيق والمتابعة", "قسم المندوبين", "قسم اصدار اجازات الاستثمار", "قسم الإدارة والارشفة",
                "قسم التخطيط والدراسات", "قسم البرنامج الحكومي", "قسم الموارد البشرية", "قسم الحسابات التشغيلية",
                "قسم الصيانة والخدمات", "قسم الاضابير والمراسلات", "قسم حسابات الخطة الاستثمارية", "قسم التدريب والتطوير",
                "قسم التقاعد", "قسم بسماية", "قسم المخازن", "قسم الاليات", "قسم العلاقات", "قسم الترويج",
                "قسم الاعلام والاتصال الحكومي", "قسم الدعاوى", "قسم الاستشارات القانونية", "قسم الاتفاقيات وعقود الاستثمار",
                "نائب رئيس الهيئة الوطنية للاستثمار", "قسم الأملاك والعقارات", "قسم حقوق الانسان", "قسم المدينة الاقتصادية",
                "قسم المعلومات الاقتصادية", "قسم السياسات الاستثمارية",
            ],
            //هيئة الاعلام والاتصالات
            [
                "مكتب رئيس الهيئة", "مكتب مجلس المفوضين", "مكتب المعاون الفني", "مكتب الفرات الأوسط / النجف الاشرف",
                "مكتب الفرات الأوسط / كربلاء المقدسة", "مكتب المنطقة الجنوبية / البصرة", "مكتب المنطقة الجنوبية / ذي قار",
                "مكتب المنطقة الشمالية",
            ],
            //مؤسسة الشهداء
            [
                "مكتب رئيس المؤسسة", "مكتب نائب رئيس المؤسسة", "مكتب مستشار رئيس المؤسسة", "قسم شؤون المواطنين",
                "قسم المتابعة والتنسيق الحكومي", "قسم التصاريح الأمنية", "قسم العقود",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم تقويم الأداء المؤسسي", "قسم الحج والعمرة والزيارات الدينية",
            ],
            //مجلس الدولة
            [
                "سكرتير عام المجلس", "قسم الشؤون الإدارية والمالية", "قسم مصادر التشريعات", "قسم نظم المعلومات",
                "قسم إدارة المحكمة الإدارية العليا", "سكرتارية الهيئات المتخصصة", "قسم إدارة التشريع والفتوى",
                "قسم إدارة محكمة القضاء الإداري", "قسم إدارة محكمة قضاء الموظفين", "قسم العقود",
                "قسم التدقيق والرقابة الداخلية", "قسم التقاعد", "المكتب الفني", "قسم الشؤون القانونية",
                "قسم الخدمات", "قسم التخطيط والمتابعة", "قسم الاعلام والعلاقات العامة", "مكتب التصاريح الأمنية",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التشريفات والمراسم", "قسم سلامة اللغة العربية",
                "قسم شؤون المرأة", "قسم توحيد المبادئ", "مكتب رئيس المجلس", 
            ],
            //ديوان الرقابة المالية الاتحادي
            [
                "مكتب رئيس الديوان", "مكاتب نائبي رئيس الديوان", "المركز التدريبي", "دائرة التخطيط والمتابعة",
                "دائرة البحث والتطوير الحربي", 
            ],
            //هيئة التصنيع الحربي
            [
                "شركة الصناعات الحربية العامة", "الشركة العامة للصناعات النحاسية والميكانيكية", "مكتب رئيس الهيئة",
                "نائب رئيس الهيئة", "قسم الاعلام والاتصال الحكومي", "قسم تكنولوجيا المعلومات", "قسم تمكين المرأة",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم حقوق الانسان", "قسم العقود",
                "قسم تقويم الأداء المؤسسي",
            ],
            //هيئة النزاهة
            [
                "مكتب رئيس الهيئة", "سكرتارية نائب رئيس الهيئة", "الاكاديمية العراقية لمكافحة الفساد",
                "قسم الاتفاقيات والتعاون الدولي", "قسم التحول الرقمي والامن السبراني", "قسم شؤون المرأة",
                "قسم المتابعة", "قسم شؤون المواطنين", "قسم التدقيق والرقابة الداخلية",
                "مكتب الإعلام و الاتصال الحكومي",
            ],
            //الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية
            [
                "مكتب رئيس الهيئة", "قسم الرقابة والتدقيق الداخلي", "قسم تكنولوجيا المعلومات", "مكتب التصاريح الأمنية",
                "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم الاعلام الحكومي", "قسم التقانات البديلة وبرامج الدعم",
                "قسم تقويم الأداء المؤسسي", "قسم حقوق الانسان", "قسم الاتصال الدولي", "قسم تمكين المرأة", "قسم العقود",
                "فروع الهيئة في المحافظات",
            ],
            //هيئة الطاقة الذرية
            [
                "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم الرقابة والتدقيق الداخلي", "قسم العقود الحكومية",
                "مكتب التصاريح الأمنية",
            ],
            //المفوضية العليا لحقوق الانسان في العراق
            [
                "قسم سكرتارية المجلس", "مكتب رئيس المفوضية", "قسم شؤون المحافظات", "قسم النشر والتثقيف",
                "قسم الرصد والتقارير والشكاوى", "قسم الإدارية والمالية", "قسم القانونية", "قسم التخطيط والاحصاء",
                "قسم التدقيق", "قسم العلاقات والاعلام",
            ],
            //هيئة المنافذ الحدودية
            [
                "مركز التدريب والتطوير",
            ],
            //المفوضية العليا المستقلة للانتخابات
            [
                "الأمانة العامة لمجلس المفوضين", "المكاتب الانتخابية في المحافظات",
            ],
            //المجمع العلمي
            [
                "مكتب رئيس المجمع", "الهيئة العامة", "هيأة الرئاسة", "نائب رئيس المجمع", "الأمين العام",
                "قسم الرقابة والتدقيق الداخلي", "قسم الاعلام والعلاقات العامة", "قسم شؤون المرأة",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم اللغات والتراث", "قسم العلوم الإنسانية",
                "قسم العلوم الصرفية", "قسم العلوم الهندسية", "قسم العلوم الطبية", "قسم العلوم الزراعية والبيطرية",
                "قسم التأليف والترجمة والنشر", "قسم الأديان المقارنة", "قسم الإدارة والافراد", "القسم القانوني",
                "القسم المالي", "قسم المكتبة والمخطوطات", "قسم المطبعة", "قسم الخدمات الإدارية", "قسم الهندسة والصيانة",
                "قسم تقنية المعلومات",
            ],
            //ديوان اوقاف الديانات
            [
                "مكتب رئيس الديوان", "معاون مدير الدائرة الهندسية", "قسم التصاميم الهندسية", "قسم مشاريع الوسط",
                "قسم مشاريع نينوى وكركوك", "معاون مدير عام دائرة اوقاف المحافظات", "قسم التخطيط والمتابعة",
                "قسم الخدمات", "قسم التجاري والمخازن", "معاون مدير عام الدائرة الإدارية والمالية",
                "قسم إدارة الموارد البشرية", "قسم الشؤون المالية", "قسم التقاعد", "معاون مدير الدائرة القانونية",
                "قسم العقارات", "قسم تكنولوجيا المعلومات", "قسم الاعلام والاتصال الحكومي",
                "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم شؤون المواطنين", "مكتب التصاريح الأمنية",
                "قسم العقود الحكومي", "قسم التدقيق والرقابة الداخلية", "قسم تمكين المرأة", "قسم البحوث والدراسات",
                "معاون مدير عام دائرة شؤون الصابئة المندائيين", "قسم البصرة والعمارة", "قسم الناصرية و الديوانية",
                "معاون مديرعام دائرة شؤون المسيحيين", "قسم الموصل", "قسم الحمدانية", "قسم كركوك", "قسم القوش",
                "قسم البصرة", "معاون مدير عام دائرة شؤون الايزيديين", "قسم الشيخان", "قسم سنجار", "قسم بعشيقة",
            ],
            //هيئة الحج والعمرة
            [
                "مكتب رئيس الهيئة", "قسم إدارة الجودة", "قسم العقود", "قسم شؤون المواطنين", "قسم العمرة",
                "قسم التصاريح الخارجية", "قسم السياسات الخارجية", "قسم المنافذ الحدودية", "قسم تكنولوجيا المعلومات",
                "مكتب معاون المدير العام لدائرة التخطيط والمتابعة", "قسم التخطيط", "قسم المتابعة", "قسم الدراسات",
                "مكتب معاون المدير العام لدائرة الخدمات", "قسم الهندسة", "قسم النقل والتفويج", "قسم السكن والاعاشة",
                "قسم الخدمات الطبية", "مكتب معاون المدير العام لدائرة الارشاد والبحوث", "قسم الدعاوى والتحقيقات",
                "قسم الاستشارات القانونية", "مكتب معاون المدير العام للدائرة القانونية", "قسم الإدارة",
                "قسم الموارد البشرية", "قسم الحسابات", "قسم مدراء القوافل", "قسم الاستثمار", "قسم المرشد الديني",
                "قسم البحوث", "مكتب معاون المدير العام لدائرة الاعلام والعلاقات", "قسم الاعلام", "قسم العلاقات",
            ],
            //الهيئة الوطنية العليا للمسائلة والعدالة
            [
                "قسم الاعلام", "قسم إدارة الاعلام", "قسم الدراسات الدائرة الإعلامية", "قسم التوجيه", "قسم العلاقات العامة",
                "قسم محاربة الفكر البعثي", "قسم تقويم الأداء المؤسسي", "قسم الحاسوب", "قسم الوثائق", "قسم الأرشيف",
                "قسم إدارة المفتش العام", "قسم الشكاوي والاعتراضات", "قسم المتابعات", "قسم الرقابة والتحقيق",
                "قسم حقوق الانسان", "قسم إدارة الدائرة القانونية", "قسم التكييف القانوني", "قسم الدراسات الدائرة القانونية",
                "قسم التحقيق", "قسم الدعاوى", "قسم المحاقظات", "قسم الامتدادات", "قسم المجتمع المدني", "قسم الجهات الاتحادية",
                "قسم إدارة دائرة المتابعة والتنفيذ", "قسم الملاحقات", "قسم القانونية", "قسم الإحصاء والتقييم",
                "قسم إدارة الملاحقات المالية والاقتصادية", "قسم التقاعد", "قسم التدريب والتطوير", "قسم الشؤون الفنية",
                "قسم الموارد البشرية", "قسم إدارة الدائرة الإدارية والمالية", "قسم المالية والحسابات",
                "مكتب رئيس الهيئة", "قسم شؤون المرأة", "قسم الرقابة الداخلية والتدقيق", "مكتب التصاريح الأمنية",
                "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "نائب رئيس الهيئة", "قسم الطعون التمييزية",
                "قسم شؤون الأعضاء", "قسم الاعلام والاتصال الحكومي", "قسم الاستشارات القانونية", "قسم تقنية المعلومات",
            ],
            //وزارة التخطيط
            [
                "مكتب الوزير", "مكتب الوكل الإداري", "مكتب الوكيل الفني", "هياة الإحصاء ونظم المعلومات الجغرافية",
                "الجهاز المركزي للتقييس والسيطرة النوعية", "المركز الوطني للتطوير الإداري وتقنية المعلومات",
                "الهياة العراقية للاعتماد",
            ],
            //وزارة الاتصالات
            [
                "شعبة المتابعة", "قسم تقويم الأداء المؤسسي", "قسم شؤون المرأة", "قسم شؤون المواطنين", "قسم العقود",
                "قسم التصاريح الأمنية", "قسم إدارة الجودة", "قسم تكنولوجيا المعلومات", "شركة السلام",
                "شركة البريد والتوفير", "شركة الاتصالات والمعلوماتية",
            ],
            //وزارة التربية
            [
                "مكتب الوزير", "هيئة الرأي", "الجهاز التنفيذي لمحو الامية", "قسم ادارة الجودة الشاملة والتطوير المؤسسي",
                "قسم السلامة المهنية", "المستشارون", "قسم العقود", "قسم المتابعة", "قسم شؤون المواطنين",
                "قسم الاعلام والاتصال الحكومي", "قسم الانترنيت والمراسلات الحكومية", "قسم الشؤون القانونية",
                "قسم تأهيل المناصب الإدارية", "قسم التفتيش التربوي", "قسم نادي الكرخ الرياضي",
                "قسم التصاريح الأمنية", "قسم الرقابة", "قسم التدقيق", "قسم الشكاوى والبلاغات", "قسم التحقيقات",
                "قسم تطوير المناهج والاختيارات", "وكيل الوزارة للشؤون الفنية", "وكيل الوزارة للشؤون الإدارية",
                "وكيل الوزارة للشؤون العلمية", 
            ],
            //وزارة الثقافة
            [
                "هيئة السياحة", "الهيئة العامة للاثار والتراث", "دار المأمون للترجمة والنشر", "دار الكتب والوثائق",
                "دار الثقافة والنشر الكردية", "الدار العراقية للأزياء", "دار ثقافة الأطفال", "دار الشؤون الثقافية العامة",
                "الشركة العامة للمدينة السياحية في الحبانية",
            ],
            //وزارة العمل
            [
                "هيئة الحماية الاجتماعية", "هيئة حقوق ذوي الإعاقة والاحتياجات الخاصة",
                "المركز الوطني للصحة والسلامة المهنية",
            ],
            //وزارة التعليم العالي
            [
                "جامعة بغداد", "الجامعة المستنصرية", "جامعة النهرين", "الجامعة العراقية", "الجامعة التكنولوجية",
                "جامعة الكرخ للعلوم", "تكنولوجيا المعلومات والاتصالات", "جامعة ابن سينا", "جامعة الموصل",
                "جامعة نينوى", "جامعة تلعفر", "جامعة الحمدانية", "جامعة كركوك", "جامعة سامراء", "جامعة تكريت",
                "الجامعة التقنية الشمالية", "الجامعة التقنية الوسطى", "الجامعة التقنية الجنوبية", "جامعة الانبار",
                "جامعة الفلوجة", "جامعة ديالى", "جامعة الفرات الأوسط", "جامعة بابل", "جامعة القاسم", "جامعة كربلاء",
                "جامعة الكوفة", "جامعة جابر بن حيان", "جامعة واسط", "جامعة المثنى", "جامعة القادسية", "جامعة ذي قار",
                "جامعة سومر", "جامعة الشطرة", "جامعة ميسان", "جامعة البصرة", "جامعة البصرة للنفط والغاز",
                "هيئة البحث العلمي", "المجلس العراقي للاختصاصات الطبية", "مركز بحوث السرطان والوراثة الطبية",
            ],
            //وزارة الهجرة والمهجرين
            [
                "قسم شؤون المرأة", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التصاريح الأمنية",
                "قسم شؤون المواطنين", "قسم العقود العامة الحكومية", "قسم الاعلام", "قسم الصادر والوارد",
                "قسم تقويم الأداء المؤسسي", "قسم المنظمات والتنسيق", "قسم العلاقات", "قسم الموارد البشرية",
                "قسم الإدارة", "قسم الصيانة", "قسم المخازن", "قسم الحسابات والمالية", "قسم الشؤون الهندسية",
                "قسم السيطرة المخزنية والموجودات الثابتة", "قسم التدريب", "قسم التقاعد",
                "قسم إدارة ومراجعة التقارير والاستراتيجيات", "قسم التخطيط", "قسم المتابعة", "قسم رسم السياسات",
                "قسم الموارد والموازنة", "قسم الدعاوى", "قسم العقود", "قسم العلاقات القانونية",
                "قسم الاستشارات والتشريعات", "قسم حقوق الانسان", "قسم البحوث والدراسات", "قسم الإحصاء وبنك المعلومات",
                "قسم الإدارة الفنية", "قسم تكنولوجيا المعلومات", "قسم إدارة قواعد البيانات", "قسم دول الإقامة",
                "قسم دول المعبر", "مدير مكتب الوزير", "الوكيل الإداري", "مدير مكتب الوكيل الإداري", "مستشار الوزير",
                "الوكيل الفني", "مدير مكتب المدير الفني", "قسم المحافظات الشمالية", "قسم شؤون الكورد الفيلية",
                "قسم التنسيق", "قسم إدارة المكتب", "قسم المحافظات الوسطى", "قسم دول الجوار والمحيط الإقليمي",
                "قسم اللاجئين الأجانب في العراق", "قسم شؤون العودة وإعادة الاجتماع المجتمعي",
                "قسم محافظات إقليم كوردستان", "قسم الفرات الأوسط", "قسم المحافظات الجنوبية",
            ],
            //وزارة العدل
            ["مكتب الوزير", "مكتب وكيل الوزارة الاقدم", "مكتب وكيل الوزارة للشؤون الإدارية والمالي",],
            //وزارة الكهرباء
            [
                "الشركة العامة لانتاج الطاقة الكهربائية / المنطقة الشمالية",
                "الشركة العامة لانتاج الطاقة الكهربائية / المنطقة الوسطى",
                "الشركة العامة لانتاج الطاقة الكهربائية / الفرات الأوسط",
                "الشركة العامة لانتاج الطاقة الكهربائية / المنطقة الجنوبية",
                "الشركة العامة لنقل الطاقة الكهربائية / المنطقة الشمالية",
                "الشركة العامة لنقل الطاقة الكهربائية / المنطقة الوسطى",
                "الشركة العامة لنقل الطاقة الكهربائية / الفرات الأوسط",
                "الشركة العامة لنقل الطاقة الكهربائية / المنطقة الجنوبية",
                "الشركة العامة لتوزيع كهرباء المنطقة الشمالية", "الشركة العامة لتوزيع كهرباء الوسط",
                "الشركة العامة لتوزيع كهرباء بغداد", "الشركة العامة لتوزيع كهرباء الفرات الأوسط",
                "الشركة العامة لتوزيع كهرباء المنطقة الجنوبية",
                "الشركة العامة لفحص وتأهيل منظومات الطاقة الكهربائية",
            ],
            //وزارة الموارد المائية
            [
                "الهيأة العامة لصيانة مشاريع الري والبزل", "الهيأة العامة لتشغيل مشاريع الري والبزل",
                "الهيأة العامة لمشاريع الري والإصلاح", "الهيأة العامة للمساحة", "الهيأة العامة للسدود والخزانات",
                "الهيأة العامة للمياه الجوفية", "المصب العام المدمجة", "شركة الفاو العامة لتنفيذ مشاريع الري",
                "شركة العراق العامة لتنفيذ مشاريع الري", "شركة الرافدين العامة لتنفيذ السدود",
                "المركز الوطني لادارة الموارد المائية", "مركز دراسات مشاريع المنطقة الشمالية",
                "مركز الدراسات والتصاميم", "مركز انعاش الاهوار",
            ],
            //وزارة النفط
            [
                "شركة نفط البصرة", "شركة نفط الشمال", "شركة نفط ذي قار", "شركة نفط ميسان", "شركة نفط الوسط",
                "شركة الاستكشافات النفطية", "شركة الحفر العاقية", "شركة مصافي الوسط", "شركة مصافي الجنوب",
                "شركة مصافي الشمال", "شركة غاز الشمال", "شركة غاز الجنوب", "شركة توزيع المنتجات النفطية",
                "شركة خطوط الانابيب", "الشركة العامة لتعبئة وخدمات الغاز", "شركة تسويق النفط", "شركة المشاريع النفطية",
                "شركة ناقلات النفط", "شركة المعدات الهندسية الثقيلة", "مركز البحث والتطوير النفطي",
                "معهد التدريب النفطي / بغداد", "معهد التدريب النفطي / بيجي", "معهد التدريب النفطي / البصرة",
                "معهد التدريب النفطي / كركوك", "معهد التدريب النفطي / ميسان", "المركز الثقافي النفطي",
                "دار الضيافة",
            ],
            //وزارة الشباب والرياضة
            [
                "مكتب وكيل الوزارة لشؤون الشباب", "مكتب وكيل الوزارة لشؤون الرياضة", "مكتب مستشار شؤون الشباب",
                "مكتب التصاريح الأمنية", "قسم الدفاع المدني", "قسم شؤون المواطنين", "قسم العقود",
                "قسم الاعلام والاتصالات الحكومي", "قسم تقويم الأداء المؤسسي", "قسم شؤون المرأة العراقية",
                "قسم المجلس الوطني للشباب", "قسم المركز الوطني للعمل التطوعي", 
            ],
            //وزارة التجارة
            [
                "مكتب الوزير", "مكتب وكيل الوزارة للشؤون الإدارية", "مكتب وكيل الوزارة للشؤون الاقتصادية",
                "مكتب مستشار الوزارة", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم العقود العامة",
                "قسم الاعلام والاتصال الحكومي", "قسم تقنية المعلومات", "قسم شؤون المواطنين", "قسم التصاريح الأمنية",
                "قسم شؤون المرأة", "قسم تقويم الأداء المؤسسي",
            ],
            //وزارة الصناعة والمعادن
            [
                "مكتب الوزير", "قسم العقود", "قسم العلاقات العامة", "قسم الاعلام", "قسم التصاريح والمعلومات",
                "قسم شؤون المواطنين", "قسم السياسات والإصلاح", "قسم تكنولوجيا المعلومات والاتصالات",
            ],
        ];

        var OValues = ["الديوان", "مديرية", "دائرة", "تشكيل مستقل"];
        this.inputFormField["amannadep"] = null;
        if(OValues.includes(event)){
            document.getElementById("48098").style.display = "block";
        }else{
            document.getElementById("48098").style.display = "none";
        }

        if(event == "الديوان"){
            var statement1 = [
                "محافظة صلاح الديـن", "محافظة كركـوك", "محافظة الديوانيـة",
            ];

            var found = false;
            for(var i = 0; i < statement1.length; i++){
                if(this.inputFormField.circle == statement1[i]){
                    this.group_of_form[0].fields[5].properties[0].values = Values1[i];
                    found = true;
                    break;
                }
            }
            if(!found){
                this.group_of_form[0].fields[5].properties[0].values = [];
            }
        }else if(event == "مديرية"){
            var statement2 = [
                "محافظة بابـل", "محافظة نينوى", "محافظة صلاح الديـن", "محافظة الديوانيـة",
                "مجلس شؤون المنافسة ومنع الاحتكار", "مؤسسة الشهداء", "ديوان الرقابة المالية الاتحادية",
                "هيئة التصنيع الحربي", "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية",
                "هيئة الطاقة الذرية", "هيئة المنافذ الحدودية", "الهيئة العليا للحج والعمرة", "وزارة الزراعة",
                "وزارة الاتصالات", "وزارة الاعمار والاسكان و البلديات والاشغال العامة", "وزارة التربية",
                "وزارة الهجرة والمهجرين", "وزارة العدل",
            ];

            var found = false;
            for(var i = 0; i < statement2.length; i++){
                if(this.inputFormField.circle == statement2[i]){
                    this.group_of_form[0].fields[5].properties[0].values = Values2[i];
                    found = true;
                    break;
                }
            }
            if(!found){
                this.group_of_form[0].fields[5].properties[0].values = [];
            }
        }else if(event == "دائرة"){
            var statement3 = [
                "محافظة نينوى", "محافظة صلاح الديـن", "محافظة الديوانيـة", "محافظة بغداد", "محافظة كربلاء المقدسة",
                "هيئة الاوراق المالية", "مؤسسة السجناء السياسيين", "الهيئة العامة لمراقبة الواردات الاتحادية",
                "بيت الحكمة", "هيئة دعاوى الملكية", "مجلس الخدمة الاتحادي", "الهيئة الوطنية للاستثمار",
                "هيئة الاعلام والاتصالات", "مؤسسة الشهداء", "ديوان الرقابة المالية الاتحادية", "هيئة التصنيع الحربي",
                "هيئة النزاهة", "هيئة المنافذ الحدودية", "المفوضية العليا المستقلة للانتخابات", "المجمع العلمي العراقي",
                "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية", "الهيئة العليا للحج والعمرة",
                "ديوان الوقف السني", "الهيئة الوطنية للمساءلة والعدالة", "وزارة النقل", "وزارة التخطيط",
                "وزارة الزراعة", "وزارة الاتصالات", "وزارة الاعمار والاسكان و البلديات والاشغال العامة",
                "وزارة الثقافة والسياحة والاثار", "وزارة العمل والشؤون الاجتماعية", "وزارة الهجرة والمهجرين",
                "وزارة العدل", "وزارة الكهرباء", "وزارة الموارد المائية", "وزارة النفط",
                "وزارة الشباب والرياضة", "وزارة التجارة", "وزارة الصناعة والمعادن", "وزارة المالية",
            ];

            var found = false;
            for(var i = 0; i < statement3.length; i++){
                if(this.inputFormField.circle == statement3[i]){
                    this.group_of_form[0].fields[5].properties[0].values = Values3[i];
                    found = true;
                    break;
                }
            }

            if(!found){
                this.group_of_form[0].fields[5].properties[0].values = [];
            }
        }else if(event == "تشكيل مستقل"){
            var statement4 = [
                "محافظة نينوى", "محافظة صلاح الديـن", "محافظة كركـوك", "محافظة الديوانيـة", "محافظة بغداد",
                "محافظة بابـل", "محافظة كربلاء المقدسة", "مؤسسة السجناء السياسيين",
                "الهيئة العامة لمراقبة الواردات الاتحادية", "هيئة دعاوى الملكية", "مجلس شؤون المنافسة ومنع الاحتكار",
                "هيئة استثمار بغداد", "الهيئة الوطنية للاستثمار", "هيئة الاعلام والاتصالات", "مؤسسة الشهداء",
                "مجلس الدولة", "ديوان الرقابة المالية الاتحادية", "هيئة التصنيع الحربي", "هيئة النزاهة",
                "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية", "هيئة الطاقة الذرية",
                "هيئة المنافذ الحدودية", "المفوضية العليا المستقلة للانتخابات", "المجمع العلمي العراقي",
                "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية", "الهيئة العليا للحج والعمرة",
                "الهيئة الوطنية للمساءلة والعدالة", "وزارة التخطيط", "وزارة الاتصالات", "وزارة التربية",
                "وزارة الثقافة والسياحة والاثار", "وزارة العمل والشؤون الاجتماعية",
                "وزارة التعليم العالي والبحث العلمي", "وزارة الهجرة والمهجرين", "وزارة العدل", "وزارة الكهرباء",
                "وزارة الموارد المائية", "وزارة النفط", "وزارة الشباب والرياضة", "وزارة التجارة",
                "وزارة الصناعة والمعادن",
            ];

            var found = false
            for(var i = 0; i < statement4.length; i++){
                if(this.inputFormField.circle == statement4[i]){
                    this.group_of_form[0].fields[5].properties[0].values = Values4[i];
                    found = true;
                    break;
                }
            }
            if(!found){
                this.group_of_form[0].fields[5].properties[0].values = [];
            }
        }else{
            this.group_of_form[0].fields[5].properties[0].values = [];
        }
    },

    singleNotification(notifyText, position) {
        this.$toast.error(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    ssingleNotification(notifyText, position) {
        this.$toast.success(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    checkEmployee(event){
        if (event) {
            let loader = this.$loading.show({
                container: this.$refs.formContainer,
                loader: "dots",
                transition: "fade",
                color: "#c30734"
            });

            var Dept_Names = [
                //الوزرارات
                "وزارة الدفاع", "وزارة الداخلية", "وزارة الخارجية", "وزارة المالية", "وزارة النفط", "وزارة الكهرباء",
                "وزارة الاعمار والاسكان و البلديات والاشغال العامة", "وزارة التربية",
                "وزارة التعليم العالي والبحث العلمي", "وزارة الاتصالات", "وزارة الصحة", "وزارة التخطيط",
                "وزارة التجارة", "وزارة الصناعة والمعادن", "وزارة الزراعة", "وزارة العدل",
                "وزارة العمل والشؤون الاجتماعية", "وزارة الموارد المائية", "وزارة النقل",
                "وزارة الثقافة والسياحة والاثار", "وزارة الهجرة والمهجرين", "وزارة الشباب والرياضة", "وزارة البيئة",
                //المحافظات
                "محافظة بغداد", "محافظة واسـط", "محافظة نينوى", "محافظة النجف الاشرف", "محافظة كربلاء المقدسة",
                "محافظة المثـنى", "محافظة ميسـان", "محافظة ديالى", "محافظة الديوانيـة", "محافظة البصرة",
                "محافظة ذي قـار", "محافظة الانبار", "محافظة كركـوك", "محافظة بابـل", "محافظة صلاح الديـن",
                //الهيئات
                "الهيأة العليا للتنسيق بين المحافظات", "الهيئة العليا للحج والعمرة",
                "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية", "هيئة الاوراق المالية",
                "هيئة النزاهة", "هيئة دعاوى الملكية", "الهيئة الوطنية للمساءلة والعدالة", "هيئة الحشد الشعبي",
                "الهيئة الوطنية للاستثمار", "هيئة الاعلام والاتصالات", "هيئة المنافذ الحدودية", "هيئة التصنيع الحربي",
                "هيئة الطاقة الذرية", "الهيئة العامة لمراقبة الواردات الاتحادية", "هيئة استثمار بغداد",
                //مجالس
                "مجلس القضاء الأعلى", "مجلس الدولة", "مجلس الخدمة الاتحادي", "مجلس شؤون المنافسة ومنع الاحتكار",
                //الدواوين
                "ديوان الرقابة المالية الاتحادية", "ديوان الوقف الشيعي", "ديوان الوقف السني",
                "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية",
                //المؤسسة
                "مؤسسة الشهداء", "مؤسسة السجناء السياسيين",
                //العتبات
                "العتبة الحسينية المقدسة", "العتبة العباسية المقدسة",
                // جهات غير مرتبطة بوزارة
                "مكتب رئيس الوزراء", "رئاسة الجمهورية", "مجلس النواب", "الامانة العامة لمجلس الوزراء",
                "المحكمة الإتحادية العليا", "امانة بغداد", "جهاز المخابرات الوطني", "المجمع العلمي العراقي",
                "بيت الحكمة", "البنك المركزي العراقي", "المفوضية العليا المستقلة للانتخابات", "جهاز الامن الوطني",
                "سلطة الطيران المدني", "المصرف العراقي التجاري", "جهاز مكافحة الإرهاب",
                "اللجنة الأولمبية الوطنية العراقية", "مستشارية الأمن القومي", "شبكة الإعلام العراقي",
                "المفوضية العليا لحقوق الانسان في العراق", "مركز العمليات الوطني",
            ],
            passwords = [
                //الوزارات
                "UE3@1", //وزارة الدفاع
                "VI4@1", //وزارة الداخلية
                "KS1@1", //وزارة الخارجية
                "HB1@1", //وزارة المالية
                "LT1@1", //وزارة النفط
                "CN2@1", //وزارة الكهرباء
                "YI9@1", //وزارة الاعمار والاسكان و البلديات والاشغال العامة
                "EY6@1", //وزارة التربية
                "QO5@1", //وزارة التعليم العالي والبحث العلمي
                "PP7@1", //وزارة الاتصالات
                "RN2@1", //وزارة الصحة
                "PM2@1", //وزارة التخطيط
                "LT3@1", //وزارة التجارة
                "IN0@1", //وزارة الصناعة والمعادن
                "KS4@1", //وزارة الزراعة
                "LV6@1", //وزارة العدل
                "XL5@1", //وزارة العمل والشؤون الاجتماعية
                "DE6@1", //وزارة الموارد المائية
                "II1@1", //وزارة النقل
                "OH6@1", //وزارة الثقافة والسياحة والاثار
                "QR2@1", //وزارة الهجرة والمهجرين
                "YD2@1", //وزارة الشباب والرياضة
                "YP3@1", //وزارة البيئة
                //المحافظات
                "LX3@3", //محافظة بغداد
                "MP1@3", //محافظة واسـط
                "AX2@3", //محافظة نينوى
                "UW0@3", //محافظة النجف الاشرف
                "LP4@3", //محافظة كربلاء المقدسة
                "EA6@3", //محافظة المثنى
                "UZ6@3", //محافظة ميسـان
                "BD5@3", //محافظة ديالى
                "NR5@3", //محافظة الديوانية
                "KC2@3", //محافظة البصرة
                "YH1@3", //محافظة ذي قار
                "IZ6@3", //محافظة الانبار
                "JC6@3", //محافظة كركوك
                "DN2@3", //محافظة بابل
                "HQ7@3", //محافظة صلاح الدين
                //الهيئات
                "VK4@2", //الهيئة العليا للتنسيق بين المحافظات
                "OG1@2", //الهيئة العليا للحج والعمرة
                "XU0@2", //الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية
                "KM2@2", //هيئة الاوراق المالية
                "RU6@2", //هيئة النزاهة
                "IM1@2", //هيئة دعاوى الملكية
                "ZH8@2", //الهيئة الوطنية للمساءلة والعدالة
                "QI6@2", //هيئة الحشد الشعبي
                "AW0@2", //الهيئة الوطنية للاستثمار
                "ZJ2@2", //هيئة الاعلام والاتصالات
                "ES3@2", //هيئة المنافذ الحدودية
                "UZ1@2", //هيئة التصنيع الحربي
                "RB0@2", //هيئة الطاقة الذرية
                "TW3@2", //الهيئة العامة لمراقبة الواردات الاتحادية
                "XM6@2", //هيئة استثمار بغداد
                //مجالس
                "IJ6@2", //مجلس القضاء الأعلى
                "NO2@2", //مجلس الدولة
                "IZ8@2", //مجلس الخدمة الاتحادي
                "YO6@2", //مجلس شؤون المنافسة ومنع الاحتكار
                //الدواوين
                "MR7@2", //ديوان الرقابة المالية الاتحادية
                "AE1@2", //ديوان الوقف الشيعي
                "QA1@2", //ديوان الوقف السني
                "YB2@2", //ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية
                //المؤسسة
                "NJ4@2", //مؤسسة الشهداء
                "TA0@2", //مؤسسة السجناء السياسيين
                //العتبات
                "ND7@2", //العتبة الحسينية المقدسة
                "MN3@2", //العتبة العباسية المقدسة
                //جهات غير مرتبطة بوزارة
                "PM1@2", //مكتب رئيس الوزراء
                "JA3@2", //رئاسة الجمهورية
                "NF1@2", //مجلس النواب
                "GS4@2", //الامانة العامة لمجلس الوزراء
                "CV7@2", //"المحكمة الإتحادية العليا"
                "MA9@2", //امانة بغداد
                "YZ3@2", //جهاز المخابرات الوطني
                "FE7@2", //المجمع العلمي العراقي
                "FS8@2", //بيت الحكمة
                "JU8@2", //البنك المركزي العراقي
                "LU8@2", //المفوضية العليا المستقلة للانتخابات
                "SA4@2", //جهاز الامن الوطني
                "GN7@2", //سلطة الطيران المدني
                "TL2@2", //المصرف العراقي التجاري
                "VC1@2", //جهاز مكافحة الإرهاب
                "NP1@2", //اللجنة الأولمبية الوطنية العراقية
                "RE0@2", //مستشارية الأمن القومي
                "LI0@2", //شبكة الإعلام العراقي
                "LC3@2", //المفوضية العليا لحقوق الانسان في العراق
                "UY6@2", //مركز العمليات الوطني
            ];

            let matchFound = false; // Flag to track if a match is found

            for(var i = 0; i < Dept_Names.length; i++){
                if((this.inputFormField["circle"] == Dept_Names[i] && this.inputFormField["PassValue"] == passwords[i]) ||
                    this.inputFormField["PassValue"] == "NDTC6"
                ){
                    matchFound = true;
                    document.getElementById("12698_group").style.display = "block"; // اولًا/ القيادة والادارة 
                    document.getElementById("12699_group").style.display = "block"; // ثانياً/ التخطيط الستراتيجي 
                    document.getElementById("12700_group").style.display = "block"; // ثالثاً / التمكين و الولاء الوظيفي 
                    document.getElementById("12703_group").style.display = "block"; // رابعاً / السلوك و الاستحقاق الوظيفي 
                    document.getElementById("12706_group").style.display = "block"; // خامساً / السلامة والصحة المهنية والبيئة 
                    document.getElementById("12704_group").style.display = "block"; // سادساً / الدعم و التواصل 
                    document.getElementById("12708_group").style.display = "block"; // المقترحات والافكار 
    
                    loader.hide();
                    this.ssingleNotification("تم الدخول بنجاح", "top-right");
                    break; // Exit the loop once a match is found
                }
            }

            if (!matchFound) {
                loader.hide();
                this.singleNotification("اسم او رمز الجهة غير مطابق", "top-right");
            }
        }
    },
    
    First_Hide(event){
        this.inputFormField["governorate"] = null;
        if(event == "فروع الهيئة في المحافظات" || event == "المكاتب الانتخابية في المحافظات"){
            document.getElementById("73433").style.display = "block";
        }else{
            document.getElementById("73433").style.display = "none";
        }
    },
}