{
    //فلترة الجهات في حقل (اسم جهة العمل) على اساس حقل (نوع جهة العمل)
    First_Filter(event){
        let Values = [
            {
                Selected_Value: "وزارة",
                Showed_Value: [
                    //"وزارة الدفاع", "وزارة الخارجية", "وزارة الصحة", "وزارة البيئة",
                    "وزارة التجارة", "وزارة الاتصالات",  "وزارة الصناعة والمعادن", "وزارة المالية", "وزارة النفط", "وزارة الاعمار والاسكان و البلديات والاشغال العامة", "وزارة النقل",
                    "وزارة العدل", "وزارة الثقافة والسياحة والاثار", "وزارة التربية", "وزارة الموارد المائية", "وزارة الكهرباء", "وزارة التخطيط", "وزارة العمل والشؤون الاجتماعية",
                    "وزارة الزراعة", "وزارة الشباب والرياضة", "وزارة الهجرة والمهجرين", "وزارة التعليم العالي والبحث العلمي", "وزارة الداخلية",
                ],
            }, //وزارة
            {
                Selected_Value: "محافظة",
                Showed_Value: [
                    //"محافظة البصرة", "محافظة ديالى", "محافظة النجف الاشرف", "محافظة واسـط", "محافظة المثـنى", "محافظة ذي قـار", "محافظة ميسـان", "محافظة الانبار",
                    "محافظة بغداد", "محافظة كربلاء المقدسة", "محافظة نينوى", "محافظة بابـل", "محافظة كركـوك", "محافظة الديوانيـة", "محافظة صلاح الديـن",
                ],
            }, //محافظة
            {
                Selected_Value: "جهات غير مرتبطة بوزارة",
                Showed_Value: [
                    //"مكتب رئيس الوزراء", "رئاسة الجمهورية", "مجلس النواب", "جهاز المخابرات الوطني", "البنك المركزي العراقي", "المفوضية العليا المستقلة للانتخابات",
                    //"جهاز الامن الوطني", "سلطة الطيران المدني", "المصرف العراقي التجاري", "جهاز مكافحة الإرهاب", "اللجنة الأولمبية الوطنية العراقية", "مستشارية الأمن القومي",
                    //"مركز العمليات الوطني", "الهيأة العليا للتنسيق بين المحافظات", "هيئة الحشد الشعبي", "مجلس القضاء الأعلى", "ديوان الوقف الشيعي",
                    //"العتبة الحسينية المقدسة", "العتبة العباسية المقدسة",
                    "الامانة العامة لمجلس الوزراء", "المحكمة الإتحادية العليا", "المجمع العلمي العراقي", "بيت الحكمة", "المفوضية العليا لحقوق الانسان في العراق",
                    "هيئة استثمار بغداد", "الهيئة العليا للحج والعمرة", "هيئة الاوراق المالية", "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية",
                    "هيئة النزاهة", "هيئة دعاوى الملكية", "الهيئة الوطنية للمساءلة والعدالة", "الهيئة الوطنية للاستثمار", "هيئة الاعلام والاتصالات", "هيئة المنافذ الحدودية",
                    "هيئة التصنيع الحربي", "هيئة الطاقة الذرية", "الهيئة العامة لمراقبة الواردات الاتحادية", "مجلس الدولة", "مجلس الخدمة الاتحادي", "مؤسسة الشهداء",
                    "مجلس شؤون المنافسة ومنع الاحتكار", "ديوان الرقابة المالية الاتحادية", "ديوان الوقف السني", "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية",
                    "مؤسسة السجناء السياسيين", "امانة بغداد", "شبكة الإعلام العراقي",
                ],
            }, //جهات غير مرتبطة بوزارة
        ];

        this.inputFormField["PassValue"] = null;
        this.inputFormField["circle"] = null;

        let Result = Values.find((Finding) => Finding.Selected_Value === event);
        if(Result){
            document.getElementById("48109").style.display = "block";
            this.group_of_form[0].fields[3].properties[0].values = Result.Showed_Value;
        }else{
            document.getElementById("48109").style.display = "none";
            this.group_of_form[0].fields[3].properties[0].values = [];
        }
    },

    //فلترة حقل (نوع التشكيل) على اساس حقل (اسم جهة العمل)
    Second_Filter(event){
        this.inputFormField["DeptType"] = null;

        let Values = [
            {
                Selected_Value: [
                    "محافظة نينوى", "مؤسسة الشهداء", "ديوان الرقابة المالية الاتحادية", "هيئة التصنيع الحربي",  "الهيئة العليا للحج والعمرة", "وزارة الاتصالات", "وزارة العدل",
                    "وزارة الهجرة والمهجرين", "امانة بغداد",
                ],
                Showed_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
            }, //"مديرية", "دائرة", "تشكيل مستقل"
            {
                Selected_Value: ["محافظة صلاح الديـن", "محافظة الديوانيـة"],
                Showed_Value: ["الديوان", "مديرية", "دائرة", "تشكيل مستقل"],
            }, //"الديوان", "مديرية", "دائرة", "تشكيل مستقل"
            {
                Selected_Value: ["محافظة كركـوك"],
                Showed_Value: ["الديوان", "تشكيل مستقل"], 
            }, // "الديوان", "تشكيل مستقل"
            {
                Selected_Value:[
                    "محافظة بغداد", "محافظة كربلاء المقدسة", "مؤسسة السجناء السياسيين", "الهيئة العامة لمراقبة الواردات الاتحادية", "هيئة دعاوى الملكية", "هيئة الاعلام والاتصالات",
                    "الهيئة الوطنية للاستثمار", "هيئة النزاهة", "المجمع العلمي العراقي",  "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية",
                    "الهيئة الوطنية للمساءلة والعدالة", "وزارة التخطيط", "وزارة الثقافة والسياحة والاثار", "وزارة العمل والشؤون الاجتماعية", "وزارة الكهرباء", "وزارة النفط",
                    "وزارة الموارد المائية", "وزارة الشباب والرياضة", "وزارة التجارة", "وزارة الصناعة والمعادن"
                ],
                Showed_Value: ["دائرة", "تشكيل مستقل"],
            }, //"دائرة", "تشكيل مستقل"
            {
                Selected_Value: [
                    "محافظة بابـل", "مجلس شؤون المنافسة ومنع الاحتكار", "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية", "هيئة الطاقة الذرية", "وزارة التربية",
                    "شبكة الإعلام العراقي",
                ],
                Showed_Value: ["مديرية", "تشكيل مستقل"],
            }, //"مديرية", "تشكيل مستقل"
            {
                Selected_Value: ["هيئة الاوراق المالية", "بيت الحكمة", "مجلس الخدمة الاتحادي", "ديوان الوقف السني", "وزارة النقل", "وزارة المالية"],
                Showed_Value: ["دائرة",],
            }, //"دائرة",
            {
                Selected_Value: ["هيئة استثمار بغداد", "مجلس الدولة", "المفوضية العليا لحقوق الانسان في العراق", "وزارة التعليم العالي والبحث العلمي", "وزارة الداخلية",],
                Showed_Value: ["تشكيل مستقل"],
            }, //"تشكيل مستقل"
            {
                Selected_Value: ["هيئة المنافذ الحدودية", "وزارة الزراعة", "وزارة الاعمار والاسكان و البلديات والاشغال العامة"],
                Showed_Value: ["مديرية", "دائرة",],
            }, //"مديرية", "دائرة",
        ];

        let Result = Values.find((Finding) => Finding.Selected_Value.includes(event));
        if(Result){
            document.getElementById("73157").style.display = "block";
            this.group_of_form[0].fields[4].properties[0].values = Result.Showed_Value;
        }else{
            document.getElementById("73157").style.display = "none";
            this.group_of_form[0].fields[4].properties[0].values = [];
        }
    },

    //فلترة حقل (اسم التشكيل) على اساس حقلي (اسم جهة العمل) و(نوع التشكيل)
    Third_Filter(event){
        let Values = [
            {
                FSelected_Value: "محافظة نينوى",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية بلديات نينوى", "مديرية بلدية الموصل", "مديرية ماء نينوى", "مديرية مجاري نينوى", "مديرية مباني نينوى", "مديرية إسكان نينوى",
                        "مديرية طرق وجسور نينوى", "مديرية زراعة نينوى", "مديرية شباب ورياضة نينوى", "مديرية العمل والشؤون الاجتماعية نينوى", "مديرية التخطيط العمراني",
                    ], //المديرية
                    ["الدائرة الإدارية و المالية",], //دائرة
                    [
                        "مجلس التخطيط والتنمية", "مكتب المحافظ", "السكرتير العام", "مكتب التصاريح الأمنية", "قسم المراسلات السرية", "قسم الحسابات والموازنة",
                        "قسم حسابات تنمية الأقاليم", "قسم العقود", "قسم تقنية المعلومات", "قسم شؤون المرأة", "قسم الاعلام والاتصال الحكومي", "قسم البحث والتطوير", "قسم تقويم الأداء",
                        "قسم حقوق الانسان", "قسم إدارة الجودة", "قسم شؤون المواطنين", "قسم التنسيق الحكومي وإدارة المراسم", "قسم التخطيط العام", "قسم عمليات الامن السيبراني SOG",
                        "المستشار التنسيقي", "المستشار الفني", "المستشار الإداري", "المستشار القانوني", "مستشار التخطيط", "قسم التنظيم المالي", "قسم التخطيط المالي",
                        "قسم تعظيم الموارد المالية المحلية", "قسم الموارد البشرية والإدارية", "قسم التنمية والدراسات", "قسم القانونية والاملاك", "مكتب النائب الأول للمحافظ",
                        "مكتب النائب الثاني للمحافظ", "مدير المكتب", "معاون الشؤون الإدارية", "قسم إدارة الموارد البشرية", "قسم الشؤون القانونية", "قسم الأملاك", "قسم التقاعد",
                        "قسم إلادارة العامة والخدمات الإدارية", "قسم المكتبة المركزية", "السكرتارية", "معاونية شؤون النازحين والمنظمات", "قسم المركز المشترك للتنسيق والرصد GCMC",
                        "قسم العمل التطوعي", "معاونية شؤون الخدمات", "قسم المتابعة والخدمات", "قسم الطاقة", "قسم التطوير الريفي", "معاونية التنمية والدراسات", "قسم الدراسات",
                        "قسم تنمية المهارات", "قسم الإحصاء", "معاونية الاعمار", "قسم اداراة المشاريع", "قسم هندسة الإدارة المحلية", "قسم الاشراف على تنفيذ المشاريع امانة",
                    ], //تشكيل مستقل
                ] 
            }, //"محافظة نينوى"
            {
                FSelected_Value: "محافظة صلاح الديـن",
                SSelected_Value: ["الديوان", "مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["ديوان محافظة صلاح الدين",], //الديوان
                    [
                        "مديرية بلديات صلاح الدين والمؤسسات", "مديرية بلدية تكريت", "مديرية بلدية سامراء", "مديرية الرياضة والشباب", "مديرية زراعة صلاح الدين",
                        "مديرية الطرق والجسور في صلاح الدين", "مديرية التخطيط العمراني", "مديرية ماء صلاح الدين", "مديرية مجاري صلاح الدين",
                    ], //المديرية
                    ["دائرة المباني", "دائرة الإسكان"], //دائرة
                    [
                        "قائممقامية قضاء تكريت", "قائممقامية قضاء العلم", "قائممقامية قضاء سامراء", "قائممقامية قضاء بيجي", "قائممقامية قضاء الدور", "قائممقامية قضاء الطوز",
                        "قائممقامية قضاء امرلي", "قائممقامية قضاء الضلوعية", "قائممقامية قضاء بلد", "قائممقامية قضاء الدجيل", "قائممقامية قضاء الشرقاط",
                        "قسم العمل والتدريب المهني", "قسم رعاية ذوي الاحتياجات الخاصة", "قسم الصحة والسلامة المهنية",
                    ], //تشكيل مستقل
                ],
            }, //"محافظة صلاح الديـن"
            {
                FSelected_Value: "محافظة كركـوك",
                SSelected_Value: ["الديوان", "تشكيل مستقل"],
                Showed_Value: [
                    ["ديوان محافظة كركوك",], //الديوان
                    ["قائممقامية قضاء مركز كركوك", "قائممقامية قضاء الحويجة", "قائممقامية قضاء الدبس", "قائممقامية قضاء داقوق", "مكتبة كركوك المركزية",], //تشكيل مستقل
                ]
            }, //"محافظة كركـوك"
            {
                FSelected_Value: "محافظة الديوانيـة",
                SSelected_Value: ["الديوان", "مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["ديوان محافظة الديوانية",], //الديوان
                    ["مديرية مجاري الديوانية", "مديرية الرياضة والشباب", "مديرية ماء الديوانية",], //المديرية
                    ["دائرة إسكان الديوانية"], //دائرة
                    ["هيأة رعاية ذوي الإعاقة والاحتياجات الخاصة", "قسم التقاعد", "قسم الشؤون المالية",], //تشكيل مستقل
                ],
            }, //"محافظة الديوانيـة"
            {
                FSelected_Value: "محافظة بغداد",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["الدائرة الإدارية و المالية",], //دائرة
                    [
                        "النائب الفني", "النائب الإداري", "قسم تعظيم الموارد المالية", "قسم التخطيط المالي", "قسم التنظيم المالي", "قسم الملاكات", "قسم الشؤون البلدية",
                        "قسم نظم المعلومات", "قسم الهندسة", "قسم إدارة الموارد البشرية", "قسم الخدمات", "قسم المخازن", "قسم الأملاك", "قسم الحسابات", "قسم التعويضات",
                        "قسم شؤون المواطنين", "قسم التخطيط العام", "قسم التدقيق والرقابة الداخلية", "قسم الإدارة العامة والتنسيق الحكومي", "مكتب المحافظ", "مكتب التصاريح الأمنية",
                        "القسم القانوني", "قسم تمكين المرأة", "قسم الاعلام والاتصال الحكومي",
                    ], //تشكيل مستقل
                ],
            }, //"محافظة بغداد"
            {
                FSelected_Value: "محافظة بابـل",
                SSelected_Value: ["مديرية", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية", "مديرية العقود الحكومية",], //المديرية
                    [
                        "مكتب المحافظ", "قسم المراسم", "هيئة استثمار بابل", "معاون مدير المديرية", "مكتب مدير المديرية", "قسم الشؤون الإدارية", "قسم التعاقدات", "قسم تقويم الأداء",
                        "قسم المتابعة والمشاريع", "قسم الرقابة", "قسم التدقيق", "قسم التحقيق", "قسم الشكاوي والتبليغات", "معاون التخطيط", "المعاون الإداري", "المعاون الفني",
                        "المعاون المالي", "المعاون القانوني", "هيئة المستشارين", "قسم التنظيم المالي", "قسم التخطيط المالي", "قسم إدارة الملاك", "مديرية التخطيط والسياسات العامة",
                        "قسم تعظيم الموارد المالية المحلية", "قسم حسابات الخطة", "قسم المخازن", "قسم الحسابات", "قسم الشؤون القانونية", "قسم الأملاك", "قسم اللامركزية الإدارية",
                        "قسم المتابعة والجهد الخدمي", "قسم الإحصاء ونظم المعلومات الجغرافية GIS", "قسم منظمات المجتمع المدني الغير حكومية", "قسم تكنولوجيا المعلومات",
                        "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم التطوير والتنمية المستدامة",
                    ], //تشكيل مستقل
                ]
            }, //"محافظة بابـل"
            {
                FSelected_Value: "محافظة كربلاء المقدسة",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["دائرة المشاريع",], //دائرة
                    [
                        "مكتب المحافظ", "مكتب النائب الأول للمحافظ", "مكتب النائب الثاني للمحافظ", "الهيئة الاستشارية", "قسم إدارة الموارد البشرية", "قسم التخطيط المالي",
                        "قسم التنظيم المالي", "قسم إدارة الملاك", "قسم الإدارة العامة", "قسم تعظيم الموارد المالية المحلية", "قسم المشاريع الاستراتيجية", "قسم إدارة الخدمات العامة",
                        "قسم مشاريع التربية والتعليم", "قسم متابعة مشاريع التنمية والخطة الاستثمارية", "قسم الماء والمجاري", "قسم الطرق والجسور", "قسم البلديات", "قسم البلدية",
                        "قسم الصحة", "قسم الكهرباء والاتصالات", "قسم الخدمات الفنية والمباني والاليات", "قسم تنظيم وتطوير المدن", "قسم إدارة الجودة الشاملة و التطوير المؤسسي",
                        "قسم شؤون المواطنين", "قسم الاستشارات القانونية والتطوير الإداري", "قسم المرأة والاسرة والطفل", "قسم اعداد القادة", "قسم متابعة الدوائر",
                        "قسم خدمات الدوائر", "قسم أملاك المحافظة", "قسم العقود العامة", "قسم التنفيذ المباشر", "قسم الشؤون القانونية", "قسم تقويم الأداء", "قسم مركز البيانات",
                        "قسم التخطيط والمتابعة", "قسم تكنواوجيا دعم القرار", "قسم التدقيق والرقابة الداخلية", "قسم الإحصاء والسياسات العامة", "قسم الاعلام والعلاقات العامة",
                        "قسم الثقافة والفنون", "معاون المحافظ لشؤون التنمية والاعمار", "معاون المحافظ لشؤون إدارة الخدمات",
                    ], //تشكيل مستقل
                ],
            }, //"محافظة كربلاء المقدسة"
            {
                FSelected_Value: "مؤسسة السجناء السياسيين",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية التدقيق والرقابة الداخلية", "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة الشؤون الاقتصادية والاستثمار",
                        "دائرة شؤون المديريات واللجان الخاصة", "دائرة العلاقات والإعلام والشؤون الثقافية",
                    ], //دائرة
                    [
                        "مكتب رئيس المؤسسة", "قسم الطعون", "قسم إعادة النظر", "قسم تكنولوجيا المعلومات", "قسم العقود", "قسم شؤون المواطنين",
                        "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم التصاريح الأمنية والتنسيق الوزاري",
                    ], //تشكيل مستقل
                ]
            }, //"مؤسسة السجناء السياسيين"
            {
                FSelected_Value: "الهيئة العامة لمراقبة الواردات الاتحادية",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["الدائرة الإدارية والمالية والقانونية", "دائرة الشؤون الفنية والمتابعة",], //دائرة
                    [
                        "قسم الموارد البشرية", "قسم الإدارة", "قسم التقاعد", "قسم الشؤون الهندسية", "قسم الشؤون المالية", "قسم الشؤون القانونية", "قسم التمويل الاتحادي",
                        "قسم الإيرادات الاتحادية", "قسم التخصيصات", "قسم تقويم الأداء المؤسسي", "قسم تقنية المعلومات", "قسم التدقيق والرقابة الداخلية", "نائب رئيس الهيئة",
                        "مستشار الهيئة", "مكتب رئيس الهيئة", "سكرتارية نائب رئيس الهيئة", "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم الاعلام والاتصال الحكومي",
                        "قسم التصاريح", "سكرتارية مستشار الهيئة",
                    ], //تشكيل مستقل
                ],
            }, //"الهيئة العامة لمراقبة الواردات الاتحادية"
            {
                FSelected_Value: "هيئة دعاوى الملكية",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة التخطيط والمتابعة وتكنولوجيا المعلومات والتدريب", "دوائر المناطق"], //دوائر
                    [
                        "قسم تقويم الأداء المؤسسي", "قسم تكنولوجيا المعلومات", "قسم حقوق الانسان", "قسم شؤون المرأة", "مكتب رئيس الهيئة", "نائب رئيس الهيئة", "قسم  الاعلام",
                        "مكتب التصاريح الأمنية", "قسم شؤون المواطنين", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "مديرية التدقيق والرقابة الداخلية",
                    ], //تشكيل مستقل
                ],
            }, //"هيئة دعاوى الملكية"
            {
                FSelected_Value: "مجلس شؤون المنافسة ومنع الاحتكار",
                SSelected_Value: ["مديرية", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية الأمور الإدارية والمالية", "مديرية الأمور القانونية", "مديرية التخطيط",], //المديرية
                    [
                        "مكتب رئيس المجلس", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التصاريح الأمنية", "قسم حقوق الانسان", "قسم تقويم الأداء المؤسسي", "قسم التحقيقات",
                        "قسم تكنولوجيا المعلومات والاتصالات", "قسم شؤون المرأة", "قسم الاعلام والعلاقات العامة", "قسم التدقيق والرقابة الداخلية", "قسم التجارية", "قسم التدريب",
                        "قسم الخدمات الفنية", "قسم الشؤون المالية", "قسم إدارة الموارد البشرية", "قسم التفتيش والمعاينة", "قسم الاستشارات القانونية", "قسم الإحصاء والخطة العامة",
                        "قسم الاندماجات والتركز الاقتصادي", "قسم التعاون الدولي والاتفاقيات", "قسم سياسات المنافسة", "قسم مراقبة السوق",
                    ], //تشكيل مستقل
                ]
            }, //"مجلس شؤون المنافسة ومنع الاحتكار"
            {
                FSelected_Value: "هيئة استثمار بغداد",
                SSelected_Value: ["تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مكتب رئيس الهيئة", "قسم الاقتصادي والفني", "قسم العلاقات العامة", "قسم النافذة الواحدة وخدمات المستثمرين", "قسم الوقاية والتدقيق الداخلي",
                        "قسم إدارة الجودة الشاملة و التطوير المؤسسي",
                    ],
                ],
            }, //هيئة استثمار بغداد
            {
                FSelected_Value: "الهيئة الوطنية للاستثمار",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["الدائرة الاقتصادية والفنية", "الدائرة الإدارية و المالية", "دائرة العلاقات والإعلام", "الدائرة القانونية", "دائرة النافذة الواحدة وخدمات المستثمرين",], //دائرة
                    [
                        "مديرية التدقيق والرقابة الداخلية", "قسم تكنولوجيا المعلومات", "قسم تقويم الأداء المؤسسي", "قسم العقود الحكومية", "قسم التنسيق مع المحافظات",
                        "قسم شؤون المواطنين", "قسم المتابعة المركزية", "القسم الفني", "قسم الجودة والتطوير المؤسسي", "قسم التعاون الدولي", "قسم التصاريح الأمنية",
                        "مكتب رئيس الهيئة", "القسم الإداري", "قسم متابعة اللجان", "قسم الاستقبال وخدمات المستثمرين", "قسم التنسيق والمتابعة", "قسم المندوبين", "قسم الموارد البشرية",
                        "قسم اصدار اجازات الاستثمار", "قسم الإدارة والارشفة", "قسم التخطيط والدراسات", "قسم البرنامج الحكومي", "قسم الحسابات التشغيلية", "قسم الصيانة والخدمات",
                        "قسم الاضابير والمراسلات", "قسم حسابات الخطة الاستثمارية", "قسم التدريب والتطوير", "قسم التقاعد", "قسم بسماية", "قسم المخازن", "قسم الاليات", "قسم العلاقات",
                        "قسم الترويج", "قسم الاعلام والاتصال الحكومي", "قسم الدعاوى", "قسم الاستشارات القانونية", "قسم الاتفاقيات وعقود الاستثمار", "قسم الأملاك والعقارات",
                        "نائب رئيس الهيئة الوطنية للاستثمار", "قسم حقوق الانسان", "قسم المدينة الاقتصادية", "قسم المعلومات الاقتصادية", "قسم السياسات الاستثمارية",
                    ], //تشكيل مستقل
                ],
            }, //"الهيئة الوطنية للاستثمار"
            {
                FSelected_Value: "هيئة الاعلام والاتصالات",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "الدائرة القانونية", "دائرة المتابعة وشؤون المحافظات", "دائرة تنظيم الاتصالات", "دائرة جودة الخدمة ومراقبة الطيف الترددي", "دائرة العلاقات العامة",
                        "دائرة التنظيم الإعلامي", "الدائرة الإدارية و المالية", "دائرة التدقيق والرقابة الداخلية", "دائرة تنظيم تكنولوجيا والخدمات الرقمية", "دائرة الخدمة الشاملة",
                        "دائرة التخطيط والتطوير", "دائرة التصاريح الأمنية", "دائرة الصيانة والخدمات",
                    ], //دائرة
                    [
                        "مكتب رئيس الهيئة", "مكتب مجلس المفوضين", "مكتب المعاون الفني", "مكتب الفرات الأوسط / النجف الاشرف", "مكتب الفرات الأوسط / كربلاء المقدسة",
                        "مكتب المنطقة الجنوبية / البصرة", "مكتب المنطقة الجنوبية / ذي قار", "مكتب المنطقة الشمالية",
                    ], //تشكيل مستقل
                ],
            }, //"هيئة الاعلام والاتصالات"
            {
                FSelected_Value: "مؤسسة الشهداء",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية شؤون المديريات واللجان", "مديرية الوثائق والمحفوظات", "مديرية الاعلام والعلاقات العامة", "مديرية الشؤون التعليمية والثقافية",
                        "مديرية الأراضي والعقارات", "مديريات تخليد التضحيات", "مديرية الرقابة الداخلية والتدقيق",
                    ], //المديرية
                    [
                        "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة الاقتصاد والاستثمار والتنمية", "دائرة حماية المقابر الجماعية والمفقودين", "صندوق الشهداء",
                        "دائرة الشؤون الاجتماعية والصحية",
                    ], //دائرة
                    [
                        "مكتب رئيس المؤسسة", "مكتب نائب رئيس المؤسسة", "مكتب مستشار رئيس المؤسسة", "قسم شؤون المواطنين", "قسم المتابعة والتنسيق الحكومي", "قسم التصاريح الأمنية",
                        "قسم العقود", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم تقويم الأداء المؤسسي", "قسم الحج والعمرة والزيارات الدينية",
                    ], //تشكيل مستقل
                ] 
            }, //"مؤسسة الشهداء"
            {
                FSelected_Value: "مجلس الدولة",
                SSelected_Value: ["تشكيل مستقل"],
                Showed_Value: [
                    [
                        "سكرتير عام المجلس", "قسم الشؤون الإدارية والمالية", "قسم مصادر التشريعات", "قسم نظم المعلومات", "قسم إدارة المحكمة الإدارية العليا", "قسم توحيد المبادئ",
                        "سكرتارية الهيئات المتخصصة", "قسم إدارة التشريع والفتوى", "قسم إدارة محكمة القضاء الإداري", "قسم إدارة محكمة قضاء الموظفين", "قسم العقود", "قسم التقاعد",
                        "قسم التدقيق والرقابة الداخلية", "المكتب الفني", "قسم الشؤون القانونية", "قسم الخدمات", "قسم التخطيط والمتابعة", "قسم شؤون المرأة", "مكتب رئيس المجلس",
                        "قسم الاعلام والعلاقات العامة", "مكتب التصاريح الأمنية", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التشريفات والمراسم", "قسم سلامة اللغة العربية",
                    ], //تشكيل مستقل
                ],
            }, //"مجلس الدولة"
            {
                FSelected_Value: "ديوان الرقابة المالية الاتحادية",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية",], //المديرية
                    [
                        "دائرة الشؤون الفنية والدراسات", "الدائرة القانونية", "الدائرة الإدارية و المالية", "دائرة التدقيق والمتابعة", "دائرة تدقيق نشاط الحكم المركزي",
                        "دائرة تدقيق نشاط الشركات", "دائرة تدقيق النشاط الصناعي", "دائرة تدقيق نشاط التمويل والتوزيع", "دائرة تدقيق نشاط الزراعة والتعمير",
                        "دائرة تدقيق نشاط الخدمات العامة", "دائرة تدقيق النشاط الاجتماعي", "دائرة تدقيق المنطقة الأولى", "دائرة تدقيق المنطقة الثانية",
                        "دائرة تدقيق المنطقة الثالثة", "دائرة تدقيق المنطقة الرابعة", "دائرة تدقيق المنطقة الخامسة", "دائرة تدقيق المنطقة السادسة",
                        "دائرة تدقيق المنطقة السابعة", "دائرة تدقيق المنطقة الثامنة",
                    ], //دائرة
                    ["مكتب رئيس الديوان", "مكاتب نائبي رئيس الديوان", "المركز التدريبي", "دائرة التخطيط والمتابعة", "دائرة البحث والتطوير الحربي",], //تشكيل مستقل
                ]
            }, //"ديوان الرقابة المالية الاتحادية"
            {
                FSelected_Value: "هيئة التصنيع الحربي",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية",], //المديرية
                    [
                        "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة التخطيط والمتابعة", "دائرة البحث والتطوير الحربي", "الدائرة الاقتصادية", "الدائرة الفنية",
                        "الدائرة الأمنية",
                    ], //دائرة
                    [
                        "شركة الصناعات الحربية العامة", "الشركة العامة للصناعات النحاسية والميكانيكية", "مكتب رئيس الهيئة", "نائب رئيس الهيئة", "قسم الاعلام والاتصال الحكومي",
                        "قسم تكنولوجيا المعلومات", "قسم التصاريح الأمنية", "قسم تمكين المرأة", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم حقوق الانسان", "قسم العقود",
                        "قسم تقويم الأداء المؤسسي",
                    ], //تشكيل مستقل
                ] 
            }, //"هيئة التصنيع الحربي"
            {
                FSelected_Value: "هيئة النزاهة",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "دائرة التحقيقات", "الدائرة القانونية", "دائرة الوقاية", "دائرة التعليم والعلاقات العامة", "دائرة العلاقات مع المنظمات غير الحكومية", "دائرة الاسترداد",
                        "الدائرة الإدارية و المالية", "دائرة التخطيط والبحوث",
                    ], //دائرة
                    [
                        "مكتب رئيس الهيئة", "سكرتارية نائب رئيس الهيئة", "الاكاديمية العراقية لمكافحة الفساد", "قسم الاتفاقيات والتعاون الدولي", "قسم التدقيق والرقابة الداخلية",
                        "قسم الاتفاقيات والتعاون الدولي", "قسم التحول الرقمي والامن السبراني", "قسم شؤون المرأة", "قسم المتابعة", "قسم شؤون المواطنين", "مكتب الإعلام و الاتصال الحكومي",
                    ], //تشكيل مستقل
                ],
            }, //"هيئة النزاهة"
            {
                FSelected_Value: "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية",
                SSelected_Value: ["مديرية", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية الشؤون القانونية", "مديرية التخطيط والمتابعة", "مديرية الرقابة النووية", "مديرية الرقابة على حظر الانتشار", "مديرية الامن النووي والاشعاعي",
                        "مديرية الطوارئ النووية والاشعاعية", "مديرية الرقابة الاشعاعية", "مديرية الأجهزة والمختبرات", "مديرية مراقبة التعرض الشخصي", "مديرية البحث والتطوير",
                        "مديرية الأمور الإدارية والمالية",
                    ], //المديرية
                    [
                        "مكتب رئيس الهيئة", "قسم الرقابة والتدقيق الداخلي", "قسم تكنولوجيا المعلومات", "مكتب التصاريح الأمنية", "قسم إدارة الجودة الشاملة و التطوير المؤسسي",
                        "قسم الاعلام الحكومي", "قسم التقانات البديلة وبرامج الدعم", "قسم تقويم الأداء المؤسسي", "قسم حقوق الانسان", "قسم الاتصال الدولي", "قسم تمكين المرأة",
                        "قسم العقود", "فروع الهيئة في المحافظات",
                    ], //تشكيل مستقل
                ]
            }, //"الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية"
            {
                FSelected_Value: "هيئة الطاقة الذرية",
                SSelected_Value: ["مديرية", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية الشؤون القانونية والإدارية والمالية", "مديرية التطبيقات والمختبرات الاشعاعية والنووية", "مديرية النفايات المشعة وتصفية المنشأت النووية",
                        "مديرية السياسات والبرامج العلمية", "مديرية الامن والأمان النووي والاشعاعي", "مديرية المشاريع والاسناد الفني",
                    ], //المديرية
                    ["قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم الرقابة والتدقيق الداخلي", "قسم العقود الحكومية", "مكتب التصاريح الأمنية",], //تشكيل مستقل
                ]
            }, //"هيئة الطاقة الذرية"
            {
                FSelected_Value: "هيئة المنافذ الحدودية",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية التدقيق والرقابة الداخلية", "مديرية نافذة التبادل التجاري الواحد", "مديرية منفذ مطار بغداد الدولي", "مديرية منفذ المنذرية الحدودي",
                        "مديرية منفذ مندلي الحدودي", "مديرية منفذ ربيعة الحدودي", "مديرية منفذ القائم الحدودي", "مديرية منفذ الوليد الحدودي", "مديرية منفذ طريبيل الحدودي",
                        "مديرية منفذ عرعر الحدودي", "مديرية منفذ مطار النجف الاشرف", "مديرية منفذ مطار كركوك الدولي", "مديرية منفذ مطار الناصرية الدولي",
                        "مديرية منفذ الشيب الحدودي", "مديرية منفذ مطار البصرة الدولي", "مديرية منفذ الشلامجة الحدودي", "مديرية منفذ سفوان الحدودي",
                        "مديرية منفذ ميناء ام قصر الشمالي", "مديرية منفذ ميناء ام قصر الأوسط", "مديرية منفذ ميناء ام قصر الجنوبي", "مديرية منفذ ميناء خور الزبير",
                        "مديرية منفذ ميناء المعقل", "مديرية منفذ زرباطية الحدودي",
                    ], //المديرية
                    ["الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة العمليات والخطط",], //دائرة
                    ["مركز التدريب والتطوير",], //تشكيل مستقل
                ]
            }, //"هيئة المنافذ الحدودية"
            {
                FSelected_Value: "المفوضية العليا المستقلة للانتخابات",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "دائرة شؤون الأحزاب والتنظيمات السياسية", "الدائرة الإدارية و المالية", "دائرة العمليات وتكنولوجيا المعلومات", "الدائرة القانونية",
                        "دائرة الاعلام والاتصال الجماهيري",
                    ], //دائرة
                    ["الأمانة العامة لمجلس المفوضين", "المكاتب الانتخابية في المحافظات",], //تشكيل مستقل
                ],
            }, //"المفوضية العليا المستقلة للانتخابات"
            {
                FSelected_Value: "المجمع العلمي العراقي",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["الدائرة الإدارية والمالية والقانونية",], //دائرة
                    [
                        "مكتب رئيس المجمع", "الهيئة العامة", "هيأة الرئاسة", "نائب رئيس المجمع", "الأمين العام", "قسم الرقابة والتدقيق الداخلي", "قسم الاعلام والعلاقات العامة",
                        "قسم شؤون المرأة", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم اللغات والتراث", "قسم العلوم الإنسانية", "قسم العلوم الصرفية", "قسم العلوم الهندسية",
                        "قسم العلوم الطبية", "قسم العلوم الزراعية والبيطرية", "قسم التأليف والترجمة والنشر", "قسم الأديان المقارنة", "قسم الإدارة والافراد", "القسم القانوني",
                        "القسم المالي", "قسم المكتبة والمخطوطات", "قسم المطبعة", "قسم الخدمات الإدارية", "قسم الهندسة والصيانة", "قسم تقنية المعلومات",
                    ], //تشكيل مستقل
                ],
            }, //"المجمع العلمي العراقي"
            {
                FSelected_Value: "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "الدائرة الهندسية", "دائرة اوقاف المحافظات", "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة شؤون الصابئة المندائيين", "دائرة شؤون المسيحيين",
                        "دائرة شؤون الايزيديين",
                    ], //دائرة
                    [
                        "مكتب رئيس الديوان", "معاون مدير الدائرة الهندسية", "قسم التصاميم الهندسية", "قسم مشاريع الوسط", "قسم مشاريع نينوى وكركوك", "قسم التخطيط والمتابعة",
                        "معاون مدير عام دائرة اوقاف المحافظات", "قسم الخدمات", "قسم التجاري والمخازن", "معاون مدير عام الدائرة الإدارية والمالية", "قسم إدارة الموارد البشرية",
                        "قسم الشؤون المالية", "قسم التقاعد", "معاون مدير الدائرة القانونية", "قسم العقارات", "قسم تكنولوجيا المعلومات", "قسم الاعلام والاتصال الحكومي",
                        "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم شؤون المواطنين", "مكتب التصاريح الأمنية", "قسم العقود الحكومي", "قسم التدقيق والرقابة الداخلية",
                        "قسم تمكين المرأة", "قسم البحوث والدراسات", "معاون مدير عام دائرة شؤون الصابئة المندائيين", "قسم البصرة والعمارة", "قسم الناصرية و الديوانية",
                        "معاون مديرعام دائرة شؤون المسيحيين", "قسم الموصل", "قسم الحمدانية", "قسم كركوك", "قسم القوش", "قسم البصرة", "معاون مدير عام دائرة شؤون الايزيديين",
                        "قسم الشيخان", "قسم سنجار", "قسم بعشيقة",
                    ], //تشكيل مستقل
                ],
            }, //"ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية"
            {
                FSelected_Value: "الهيئة العليا للحج والعمرة",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية",], //المديرية
                    ["دائرة التخطيط والمتابعة", "دائرة الخدمات", "دائرة الارشاد والبحوث", "الدائرة القانونية", "الدائرة الإدارية و المالية", "قسم العلاقات والاعلام",], //دائرة
                    [
                        "مكتب رئيس الهيئة", "قسم إدارة الجودة", "قسم العقود", "قسم شؤون المواطنين", "قسم العمرة", "قسم التصاريح الخارجية", "قسم السياسات الخارجية", "قسم الاعلام",
                        "قسم المنافذ الحدودية", "قسم تكنولوجيا المعلومات", "مكتب معاون المدير العام لدائرة التخطيط والمتابعة", "قسم التخطيط", "قسم المتابعة", "قسم الدراسات",
                        "مكتب معاون المدير العام لدائرة الخدمات", "قسم الهندسة", "قسم النقل والتفويج", "قسم السكن والاعاشة", "قسم الخدمات الطبية", "قسم الدعاوى والتحقيقات",
                        "مكتب معاون المدير العام لدائرة الارشاد والبحوث", "قسم الاستشارات القانونية", "مكتب معاون المدير العام للدائرة القانونية", "قسم الإدارة", "قسم الحسابات",
                        "قسم الموارد البشرية", "قسم مدراء القوافل", "قسم الاستثمار", "قسم المرشد الديني", "قسم البحوث", "مكتب معاون المدير العام لدائرة الاعلام والعلاقات",
                        "قسم العلاقات",
                    ], //تشكيل مستقل
                ]
            }, //"الهيئة العليا للحج والعمرة"
            {
                FSelected_Value: "الهيئة الوطنية للمساءلة والعدالة",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "الدائرة الإعلامية", "الدائرة المعلوماتية", "دائرة المفتش العام", "الدائرة القانونية", "دائرة المتابعة والتنفيذ", "دائرة الملاحقات المالية والاقتصادية",
                        "الدائرة الإدارية و المالية",
                    ], //دائرة
                    [
                        "قسم الاعلام", "قسم إدارة الاعلام", "قسم الدراسات الدائرة الإعلامية", "قسم التوجيه", "قسم العلاقات العامة", "قسم محاربة الفكر البعثي", "قسم تقويم الأداء المؤسسي",
                        "قسم الحاسوب", "قسم الوثائق", "قسم الأرشيف", "قسم إدارة المفتش العام", "قسم الشكاوي والاعتراضات", "قسم المتابعات", "قسم الرقابة والتحقيق", "قسم حقوق الانسان",
                        "قسم إدارة الدائرة القانونية", "قسم التكييف القانوني", "قسم الدراسات الدائرة القانونية", "قسم التحقيق", "قسم الدعاوى", "قسم المحاقظات", "قسم الامتدادات",
                        "قسم المجتمع المدني", "قسم الجهات الاتحادية", "قسم إدارة دائرة المتابعة والتنفيذ", "قسم الملاحقات", "قسم القانونية", "قسم الإحصاء والتقييم", "قسم التقاعد",
                        "قسم إدارة الملاحقات المالية والاقتصادية","قسم التدريب والتطوير", "قسم الشؤون الفنية", "قسم الموارد البشرية", "قسم الاعلام والاتصال الحكومي",
                        "قسم إدارة الدائرة الإدارية والمالية", "قسم المالية والحسابات", "مكتب رئيس الهيئة", "قسم شؤون المرأة", "قسم الرقابة الداخلية والتدقيق",
                        "مكتب التصاريح الأمنية", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "نائب رئيس الهيئة", "قسم الطعون التمييزية", "قسم شؤون الأعضاء",
                        "قسم الاستشارات القانونية", "قسم تقنية المعلومات",
                    ], //تشكيل مستقل
                ],
            }, //"الهيئة الوطنية للمساءلة والعدالة"
            {
                FSelected_Value: "وزارة التخطيط",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة العقود الحكومية العامة", "دائرة تخطيط القطاعات", "دائرة البرامج الاستثمارية",
                        "دائرة التعاون الدولي", "دائرة التنمية البشرية", "دائرة التنمية الإقليمية", "دائرة السياسات الاقتصادية والمالية",
                        "دائرة الإدارة التنفيذية الاستراتيجية التخفيف من الفقر",
                    ], //دائرة
                    [
                        "مكتب الوزير", "مكتب الوكل الإداري", "مكتب الوكيل الفني", "هياة الإحصاء ونظم المعلومات الجغرافية", "الجهاز المركزي للتقييس والسيطرة النوعية",
                        "المركز الوطني للتطوير الإداري وتقنية المعلومات", "الهياة العراقية للاعتماد",
                    ], //تشكيل مستقل
                ],
            }, //"وزارة التخطيط"
            {
                FSelected_Value: "وزارة الاتصالات",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية",], //المديرية
                    ["الدائرة القانونية", "دائرة التخطيط والمتابعة", "الدائرة الإدارية و المالية", "دائرة العلاقات الخارجية والاعلام",], //دائرة
                    [
                        "شعبة المتابعة", "قسم تقويم الأداء المؤسسي", "قسم شؤون المرأة", "قسم شؤون المواطنين", "قسم العقود", "قسم التصاريح الأمنية", "قسم إدارة الجودة",
                        "قسم تكنولوجيا المعلومات", "شركة السلام", "شركة البريد والتوفير", "شركة الاتصالات والمعلوماتية",
                    ], //تشكيل مستقل
                ]
            }, //"وزارة الاتصالات"
            {
                FSelected_Value: "وزارة التربية",
                SSelected_Value: ["مديرية", "تشكيل مستقل"],
                Showed_Value: [
                    ["المديرية العامة للشؤون الفنية", "المديرية العامة للشؤون الإدارية والمالية", "مديرية التلفزيون التربوي", "مديرية التدقيق والرقابة الداخلية",], //المديرية
                    [
                        "مكتب الوزير", "هيئة الرأي", "الجهاز التنفيذي لمحو الامية", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم السلامة المهنية", "المستشارون", "قسم العقود",
                        "قسم المتابعة", "قسم شؤون المواطنين", "قسم الاعلام والاتصال الحكومي", "قسم الانترنيت والمراسلات الحكومية", "قسم الشؤون القانونية", "قسم تأهيل المناصب الإدارية",
                        "قسم التفتيش التربوي", "قسم نادي الكرخ الرياضي", "قسم التصاريح الأمنية", "قسم الرقابة", "قسم التدقيق", "قسم الشكاوى والبلاغات", "قسم التحقيقات",
                        "قسم تطوير المناهج والاختيارات", "وكيل الوزارة للشؤون الفنية", "وكيل الوزارة للشؤون الإدارية", "وكيل الوزارة للشؤون العلمية", 
                    ], //تشكيل مستقل
                ]
            }, //"وزارة التربية"
            {
                FSelected_Value: "وزارة الثقافة والسياحة والاثار",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["دائرة الشؤون الإدارية", "دائرة العلاقات الثقافة العامة", "دائرة قصر المؤتمرات", "دائرة الفنون الموسيقية", "دائرة السينما والمسرح", "دائرة الفنون العامة",], //دائرة
                    [
                        "هيئة السياحة", "الهيئة العامة للاثار والتراث", "دار المأمون للترجمة والنشر", "دار الكتب والوثائق", "دار الثقافة والنشر الكردية", "الدار العراقية للأزياء",
                        "دار ثقافة الأطفال", "دار الشؤون الثقافية العامة", "الشركة العامة للمدينة السياحية في الحبانية",
                    ], //تشكيل مستقل
                ],
            }, //"وزارة الثقافة والسياحة والاثار"
            {
                FSelected_Value: "وزارة العمل والشؤون الاجتماعية",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مركز الوزارة", "دائرة العمل والتدريب المهني", "دائرة التقاعد والضمان الاجتماعي للعمال",], //دائرة
                    ["هيئة الحماية الاجتماعية", "هيئة حقوق ذوي الإعاقة والاحتياجات الخاصة", "المركز الوطني للصحة والسلامة المهنية",], //تشكيل مستقل
                ],
            }, //"وزارة العمل والشؤون الاجتماعية"
            {
                FSelected_Value: "وزارة التعليم العالي والبحث العلمي",
                SSelected_Value: ["تشكيل مستقل"],
                Showed_Value: [
                    [
                        "جامعة بغداد", "الجامعة المستنصرية", "جامعة النهرين", "الجامعة العراقية", "الجامعة التكنولوجية", "جامعة الكرخ للعلوم", "تكنولوجيا المعلومات والاتصالات",
                        "جامعة ابن سينا", "جامعة الموصل", "جامعة نينوى", "جامعة تلعفر", "جامعة الحمدانية", "جامعة كركوك", "جامعة سامراء", "جامعة تكريت", "الجامعة التقنية الشمالية",
                        "الجامعة التقنية الوسطى", "الجامعة التقنية الجنوبية", "جامعة الانبار", "جامعة الفلوجة", "جامعة ديالى", "جامعة الفرات الأوسط", "جامعة بابل", "جامعة القاسم",
                        "جامعة كربلاء", "جامعة الكوفة", "جامعة جابر بن حيان", "جامعة واسط", "جامعة المثنى", "جامعة القادسية", "جامعة ذي قار", "جامعة سومر", "جامعة الشطرة",
                        "جامعة ميسان", "جامعة البصرة", "جامعة البصرة للنفط والغاز", "هيئة البحث العلمي", "المجلس العراقي للاختصاصات الطبية", "مركز بحوث السرطان والوراثة الطبية",
                    ], //تشكيل مستقل
                ],
            }, //"وزارة التعليم العالي والبحث العلمي"
            {
                FSelected_Value: "وزارة الهجرة والمهجرين",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية",], //المديرية
                    ["الدائرة القانونية", "دائرة التخطيط والمتابعة", "الدائرة الإدارية و المالية", "دائرة المعلومات والبحوث", "دائرة شؤون الهجرة", "دائرة شؤون الفروع",], //دائرة
                    [
                        "قسم شؤون المرأة", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم التصاريح الأمنية", "قسم شؤون المواطنين", "قسم العقود العامة الحكومية", "قسم الاعلام",
                        "قسم الصادر والوارد", "قسم تقويم الأداء المؤسسي", "قسم المنظمات والتنسيق", "قسم العلاقات", "قسم الموارد البشرية", "قسم الإدارة", "قسم الصيانة", "قسم التخطيط",
                        "قسم المخازن", "قسم الحسابات والمالية", "قسم الشؤون الهندسية", "قسم السيطرة المخزنية والموجودات الثابتة", "قسم التدريب", "قسم التقاعد", "قسم المتابعة",
                        "قسم إدارة ومراجعة التقارير والاستراتيجيات", "قسم رسم السياسات", "قسم الموارد والموازنة", "قسم الدعاوى", "قسم العقود", "قسم العلاقات القانونية",
                        "قسم الاستشارات والتشريعات", "قسم حقوق الانسان", "قسم البحوث والدراسات", "قسم الإحصاء وبنك المعلومات", "قسم الإدارة الفنية", "قسم تكنولوجيا المعلومات",
                        "قسم إدارة قواعد البيانات", "قسم دول الإقامة", "قسم دول المعبر", "مدير مكتب الوزير", "الوكيل الإداري", "مدير مكتب الوكيل الإداري", "مستشار الوزير",
                        "الوكيل الفني", "مدير مكتب المدير الفني", "قسم المحافظات الشمالية", "قسم شؤون الكورد الفيلية", "قسم التنسيق", "قسم إدارة المكتب", "قسم المحافظات الوسطى", 
                        "قسم دول الجوار والمحيط الإقليمي", "قسم اللاجئين الأجانب في العراق", "قسم شؤون العودة وإعادة الاجتماع المجتمعي", "قسم محافظات إقليم كوردستان",
                        "قسم الفرات الأوسط", "قسم المحافظات الجنوبية",
                    ],
                ]
            }, //"وزارة الهجرة والمهجرين"
            {
                FSelected_Value: "وزارة العدل",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مديرية التدقيق والرقابة الداخلية",], //المديرية
                    [
                        "الدائرة الإدارية و المالية", "دائرة التسجيل العقاري", "دائرة العلاقات العدلية", "دائرة رعاية القاصرين", "دائرة الكاتب العدول", "دائرة التنفيذ",
                        "دائرة التخطيط العدلي", "الدائرة القانونية", "دائرة الإصلاح العراقية", "دائرة اصلاح الاحداث", "دائرة الوقائع العراقية", "دائرة حقوق الانسان",
                    ], //دائرة
                    ["مكتب الوزير", "مكتب وكيل الوزارة الاقدم", "مكتب وكيل الوزارة للشؤون الإدارية والمالية",], //تشكيل مستقل
                ]
            }, //"وزارة العدل"
            {
                FSelected_Value: "وزارة الكهرباء",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["دائرة التدريب والتطوير", "دائرة التشغيل والتحكم",], //دائرة
                    [
                        "الشركة العامة لانتاج الطاقة الكهربائية / المنطقة الشمالية", "الشركة العامة لانتاج الطاقة الكهربائية / المنطقة الوسطى",
                        "الشركة العامة لانتاج الطاقة الكهربائية / الفرات الأوسط", "الشركة العامة لانتاج الطاقة الكهربائية / المنطقة الجنوبية",
                        "الشركة العامة لنقل الطاقة الكهربائية / المنطقة الشمالية", "الشركة العامة لنقل الطاقة الكهربائية / المنطقة الوسطى",
                        "الشركة العامة لنقل الطاقة الكهربائية / الفرات الأوسط", "الشركة العامة لنقل الطاقة الكهربائية / المنطقة الجنوبية",
                        "الشركة العامة لتوزيع كهرباء المنطقة الشمالية", "الشركة العامة لتوزيع كهرباء الوسط", "الشركة العامة لتوزيع كهرباء بغداد",
                        "الشركة العامة لتوزيع كهرباء الفرات الأوسط", "الشركة العامة لتوزيع كهرباء المنطقة الجنوبية", "الشركة العامة لفحص وتأهيل منظومات الطاقة الكهربائية",
                    ], //تشكيل مستقل
                ],
            }, //"وزارة الكهرباء"
            {
                FSelected_Value: "وزارة الموارد المائية",
                SSelected_Value: ["دائرة",  "تشكيل مستقل"],
                Showed_Value: [
                    ["مركز الوزارة", "دائرة كري الأنهر",], //دائرة
                    [
                        "الهيأة العامة لصيانة مشاريع الري والبزل", "الهيأة العامة لتشغيل مشاريع الري والبزل", "الهيأة العامة لمشاريع الري والإصلاح", "الهيأة العامة للمساحة",
                        "الهيأة العامة للسدود والخزانات", "الهيأة العامة للمياه الجوفية", "المصب العام المدمجة", "شركة الفاو العامة لتنفيذ مشاريع الري", "مركز انعاش الاهوار",
                        "شركة العراق العامة لتنفيذ مشاريع الري", "شركة الرافدين العامة لتنفيذ السدود", "المركز الوطني لادارة الموارد المائية", "مركز الدراسات والتصاميم",
                        "مركز دراسات مشاريع المنطقة الشمالية",
                    ], //تشكيل مستقل
                ] 
            }, //"وزارة الموارد المائية"
            {
                FSelected_Value: "وزارة النفط",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["مركز الوزارة",], //دائرة
                    [
                        "شركة نفط البصرة", "شركة نفط الشمال", "شركة نفط ذي قار", "شركة نفط ميسان", "شركة نفط الوسط", "شركة الاستكشافات النفطية", "شركة الحفر العاقية",
                        "شركة مصافي الوسط", "شركة مصافي الجنوب", "شركة مصافي الشمال", "شركة غاز الشمال", "شركة غاز الجنوب", "شركة توزيع المنتجات النفطية",
                        "شركة خطوط الانابيب", "الشركة العامة لتعبئة وخدمات الغاز", "شركة تسويق النفط", "شركة المشاريع النفطية", "شركة ناقلات النفط",
                        "شركة المعدات الهندسية الثقيلة", "مركز البحث والتطوير النفطي", "معهد التدريب النفطي / بغداد", "معهد التدريب النفطي / بيجي",
                        "معهد التدريب النفطي / البصرة", "معهد التدريب النفطي / كركوك", "معهد التدريب النفطي / ميسان", "المركز الثقافي النفطي", "دار الضيافة",
                    ], //تشكيل مستقل
                ],
            }, //وزارة النفط
            {
                FSelected_Value: "وزارة الشباب والرياضة",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "دائرة الدراسات وتطوير الملاكات والقيادات الشبابية", "دائرة الطب الرياضي والعلاج الطبيعي", "دائرة التنسيق والمتابعة", "دائرة التربية البدنية والرياضة",
                        "دائرة الشؤون القانونية", "دائرة العلاقات والتعاون الدولي", "دائرة الشؤون الإدارية والمالية", "دائرة الشؤون الفنية", "دائرة شؤون الإقليم والمحافظات",
                        "دائرة الاستثمار والتمويل الذاتي", "دائرة ثقافة وفنون الشباب", "الشركة العامة للاستثمارات الرياضية", "دائرة الرعاية العلمية",
                    ], //دائرة
                    [
                        "مكتب وكيل الوزارة لشؤون الشباب", "مكتب وكيل الوزارة لشؤون الرياضة", "مكتب مستشار شؤون الشباب", "مكتب التصاريح الأمنية", "قسم الدفاع المدني",
                        "قسم شؤون المواطنين", "قسم العقود", "قسم الاعلام والاتصالات الحكومي", "قسم تقويم الأداء المؤسسي", "قسم شؤون المرأة العراقية", "قسم المجلس الوطني للشباب",
                        "قسم المركز الوطني للعمل التطوعي", 
                    ], //تشكيل مستقل
                ],
            }, //"وزارة الشباب والرياضة"
            {
                FSelected_Value: "وزارة التجارة",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "الدائرة الإدارية و المالية", "دائرة تطوير القطاع الخاص", "دائرة تسجيل الشركات", "الدائرة القانونية", "دائرة العلاقات الاقتصادية الخارجية",
                        "دائرة الرقابة التجارية والمالية", "دائرة التخطيط والمتابعة",
                    ], //دائرة
                    [
                        "مكتب الوزير", "مكتب وكيل الوزارة للشؤون الإدارية", "مكتب وكيل الوزارة للشؤون الاقتصادية", "مكتب مستشار الوزارة", "قسم تقويم الأداء المؤسسي",
                        "قسم العقود العامة", "قسم الاعلام والاتصال الحكومي", "قسم تقنية المعلومات", "قسم شؤون المواطنين", "قسم التصاريح الأمنية", "قسم شؤون المرأة",
                        "قسم ادارة الجودة الشاملة والتطوير المؤسسي",
                    ], //تشكيل مستقل
                ],
            }, //"وزارة التجارة"
            {
                FSelected_Value: "وزارة الصناعة والمعادن",
                SSelected_Value: ["دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "الدائرة الإدارية و المالية", "الدائرة الفنية", "دائرة الاستثمارات", "الدائرة القانونية", "دائرة التطوير والتنظيم الصناعي", "دائرة التخطيط",
                        "الدائرة الاقتصادية", "دائرة الرقابة الداخلية والتدقيق",
                    ], //دائرة
                    [
                        "مكتب الوزير", "قسم العقود", "قسم العلاقات العامة", "قسم الاعلام", "قسم التصاريح والمعلومات", "قسم شؤون المواطنين", "قسم السياسات والإصلاح",
                        "قسم تكنولوجيا المعلومات والاتصالات",
                    ], //تشكيل مستقل
                ],
            }, //"وزارة الصناعة والمعادن"
            {
                FSelected_Value: "وزارة الزراعة",
                SSelected_Value: ["مديرية", "دائرة",],
                Showed_Value: [
                    ["مديرية الزراعة في محافظة كركوك",], //المديرية
                    [
                        "دائرة البيطرة", "دائرة البستنة", "دائرة الارشاد والتدريب الزراعي", "الشركة العامة للتجهيزات الزراعية", "دائرة فحص وتصديق البذور", "دائرة الغابات والتصحر",
                        "دائرة الأراضي الزراعية", "دائرة الثروة الحيوانية", "شركة مابين النهرين العامة للبذور", "دائرة البحوث الزراعية", "دائرة وقاية المزروعات",
                    ], //دائرة
                ]
            }, //"وزارة الزراعة"
            {
                FSelected_Value: "وزارة الاعمار والاسكان و البلديات والاشغال العامة",
                SSelected_Value: ["مديرية", "دائرة",],
                Showed_Value: [
                    ["مديرية البلديات العامة", "المديرية العامة للماء", "المديرية العامة للمجاري", "المديرية العامة للتخطيط العمراني",], //المديرية
                    [
                        "المركز الوطني للمختبرات الانشائية", "المركز الوطني للاستشارات الهندسية", "دائرة الاعمار الهندسي", "دائرة الاشغال والصيانة العامة", "دائرة المباني",
                        "دائرة الطرق والجسور", "دائرة بحوث البناء", "صندوق الإسكان العراقي", "دائرة الإسكان", "شركة حمورابي العامة للمقاولات الانشائية",
                        "شركة الفاو الهندسية العامة", "شركة اشور العامة للمقاولات الانشائية", "شركة الفاروق العامة للمقاولات الانشائية", 
                    ], //دائرة
                ]
            }, //"وزارة الاعمار والاسكان و البلديات والاشغال العامة"
            {
                FSelected_Value: "هيئة الاوراق المالية",
                SSelected_Value: ["دائرة",],
                Showed_Value: [
                    ["الدائرة الإدارية والقانونية", "دائرة الإفصاح المالي", "دائرة نظم الأسواق", "دائرة الرقابة والتفتيش", "دائرة نظم المعلومات", "دائرة التخطيط والدراسات",], //دائرة
                ],
            }, //"هيئة الاوراق المالية"
            {
                FSelected_Value: "بيت الحكمة",
                SSelected_Value: ["دائرة",],
                Showed_Value: [
                    [
                        " رئيس مجلس الامناء", "مكتب رئيس مجلس الأمناء", "مجلس الأمناء", "مستشار رئيس مجلس الامناء", " مكتب الأمين العام", "مركز المعلومات ودعم اتخاذ القرار",
                        "قسم الدراسات التاريخية", "قسم دراسات الاديان", "قسم الدراسات الفلسفية", "قسم الدراسات القانونية", "قسم الدراسات السياسية والاستراتيجية",
                        "قسم الدراسات الاجتماعية", "قسم الدراسات الاقتصادية", "قسم الدراسات اللغوية والترجمية", "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم شؤون المرأة",
                        "مكتب التصاريح الأمنية", "الشعبة القانونية", "شعبة التدقيق", "شعبة التنسيق والمتابعة", "شعبة تقويم الاداء المؤسسي", "شعبة تكنلوجيا المعلومات",
                        "شعبة الموارد البشرية", "شعبة الحسابات", "شعبة النشر والتوزيع", "شعبة العلاقات العامة", "شعبة العقود", "شعبة المكتبة", "شعبة الصيانة",
                    ], //دائرة
                ],
            }, //"بيت الحكمة"
            {
                FSelected_Value: "مجلس الخدمة الاتحادي",
                SSelected_Value: ["دائرة",],
                Showed_Value: [
                    [
                        "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة البحوث والدراسات الإدارية", "دائرة التطوير الاداري", "قسم التصاريح الأمنية", "قسم العقود",
                        "دائرة التنسيق والمتابعة مع الوزارات والجهات الحكومية", "مديرية التدقيق والرقابة الداخلية", "مديرية تكنولوجيا المعلومات", "مكتب رئيس المجلس",
                        "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "قسم الاعلام والعلاقات العامة", "قسم سكرتارية المجلس", 
                    ], //دائرة
                ],
            }, //"مجلس الخدمة الاتحادي"
            {
                FSelected_Value: "ديوان الوقف السني",
                SSelected_Value: ["دائرة",],
                Showed_Value: [
                    [
                        "الدائرة القانونية", "الدائرة الإدارية و المالية", "الدائرة الهندسية", "دائرة التعليم الديني والدراسات الإسلامية", "دائرة المؤسسات الدينية والخيرية",
                        "دائرة التخطيط والمتابعة","دائرة الاضرحة والمقامات والمراقد السنية", "دائرة البحوث والدراسات", "دائرة صندوق الزكاة والصدقات",
                        "دائرة الاحتفالات الدينية والمولد النبوي الشريف", "كلية الامام الأعظم (رحمه الله) الجامعة", "هيئة إدارة واستثمار أموال الوقف السني",
                    ], //دائرة
                ],
            }, //"ديوان الوقف السني"
            {
                FSelected_Value: "وزارة النقل",
                SSelected_Value: ["دائرة",],
                Showed_Value: [
                    [
                        "الدائرة الإدارية و المالية", "الدائرة القانونية", "الدائرة الفنية", "دائرة العقود والتراخيص", "دائرة التخطيط والمتابعة", "الشركة العامة لموانئ العراق",
                        "الشركة العامة للخطوط الجوية العراقية", "الشركة العامة لسكك حديد العراق", "الشركة العامة لادارة المطارات والملاحة الجوية",  "الشركة العامة للنقل البحري",
                        "الشركة العامة للنقل البري", "الشركة العامة لنقل المسافرين والوفود", "الشركة العامة لادارة النقل الخاص", "الشركة العامة لادارة مشاريع النقل والمواصلات",
                        "الهيئة العامة للأنواء الجوية والرصد الزلزالي", "الهيئة البحرية العراقية العليا",
                    ], //دائرة
                ],
            }, //"وزارة النقل"
            {
                FSelected_Value: "وزارة المالية",
                SSelected_Value: ["دائرة",],
                Showed_Value: [
                    [
                        "مكتب السيد الوزير والوكيل", "الدائرة الاقتصادية", "الدائرة الإدارية و المالية", "الدائرة القانونية", "دائرة الموازنة", "دائرة الدين العام",
                        "دائرة المحاسبة",
                    ], //الدائرة
                ],
            }, //"وزارة المالية"
            {
                FSelected_Value: "المفوضية العليا لحقوق الانسان في العراق",
                SSelected_Value: ["تشكيل مستقل"],
                Showed_Value: [
                    [
                        "قسم سكرتارية المجلس", "مكتب رئيس المفوضية", "قسم شؤون المحافظات", "قسم النشر والتثقيف", "قسم الرصد والتقارير والشكاوى", "قسم الإدارية والمالية",
                        "قسم القانونية", "قسم التخطيط والاحصاء", "قسم التدقيق", "قسم العلاقات والاعلام",
                    ], //تشكيل مستقل
                ],
            }, //"المفوضية العليا لحقوق الانسان في العراق"
            {
                FSelected_Value: "امانة بغداد",
                SSelected_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
                Showed_Value: [
                    ["المديرية العامة للحراسات والامن", "مديرية الاعلام والعلاقات العامة",], //مديرية
                    [
                        "دائرة التدقيق والرقابة الداخلية", "الدائرة الإدارية و المالية", "دائرة العقارات", "الدائرة القانونية", "دائرة التخطيط والمتابعة","دائرة ماء بغداد",
                        "دائرة مجاري بغداد", "دائرة المشاريع", "دائرة التصاميم", "دائرة الوحدات الإنتاجية", "دائرة المنتزهات والتشجير", "دائرة بلدية مركز الرصافة",
                        "دائرة بلدية المنطقة الخضراء وطريق المطار", "دائرة بلدية مركز الكرخ", "دائرة بلدية الاعظمية", "دائرة بلدية الشعب", "دائرة بلدية الكاظمية",
                        "دائرة بلدية الشعلة", "دائرة بلدية الصدر الأولى", "دائرة بلدية الصدر الثانية", "دائرة بلدية المنصور", "دائرة بلدية بغداد الجديدة", "دائرة بلدية الغدير",
                        "دائرة بلدية الدورة", "دائرة بلدية الكرادة", "دائرة المخلفات الصلبة والبيئة",
                    ], //دائرة
                    [
                        "قسم العقود العامة", "قسم الاستثمار", "قسم شؤون المرأة", "قسم الدفاع المدني", "مكتب التصاريح الأمنية", "قسم تقويم الأداء المؤسسي", "قسم المعامل البلدي",
                        "قسم ادارة الجودة الشاملة والتطوير المؤسسي", "وكيل امانة بغداد للشؤون الإدارية", "قسم الشؤون السياحية", "وكيل امانة بغداد للشؤون الفنية", "قسم المقابر",
                        "شركة ابن رشد", "الشركة العامة لتنفيذ مشاريع الماء", "قسم تكنولوجيا المعلومات", "قسم الكهرباء والتزينات", "وكيل امانة بغداد للشؤون البلدية", "قسم الترقيم",
                        "قسم بوب الشام والثعالبة البلدي", "قسم الطرق السريعة",
                    ], //تشكيل مستقل
                ]
            }, //"امانة بغداد",
            {
                FSelected_Value: "شبكة الإعلام العراقي",
                SSelected_Value: ["مديرية", "تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مديرية القناة العراقية", "مديرية القناة العراقية الإخبارية", "مديرية القناة الرياضية", "مديرية الاعلام الوطني", "مديرية الإنتاج الدرامي", "مديريات الساندة",
                        "مديرية الإنتاج الوثائقي", "مديرية إذاعة جمهورية العراق من بغداد", "مديرية إذاعة الفرقان", "مديرية راديو العراقية", "مديرية صحيفة الصباح",
                        "مديرية مجلة الشبكة", "مديرية الاعلام الالكتروني", "مديرية النقل", "مديرية العلاقات والاعلام", "مديرية التدقيق والرقابة الداخلية", "مديرية الاعلام الخارجي",
                        "مديرية محطات الإذاعة والتلفزيون", "مديرية  الشؤون الهندسية والاستوديوهات", "مديرية المشاريع والصيانة", "مديرية تكنولوجيا المعلومات IT",
                        "مديرية الشؤون الإدارية", "مدرية الشؤون المالية", "مديرية الشؤون التجارية", "مديرية المطابع", "مديرية الشؤون القانونية", "مديرية التخطيط والاحصاء",
                        "مديرية معهد التدريب الإعلامي", "مديرية الأرشيف الوطني",
                    ], //المديرية
                    [
                        "مكتب رئيس الشبكة", "قطاع الاعلام المرئي", "قسم الديكور", "قسم المكياج والازياء", "قسم الابداع", "قطاع الاعلام المسموع", "قسم الموسيقى", "قسم العقود والمناقصات",
                        "قطاع الاعلام المقروء والالكتروني", "وكالة الانباء العراقية", "القطاع الهندسي", "القطاع الإداري والمالي", "القطاع التجاري", "القطاع القانوني",
                        "قطاع البحث والتطوير", "قسم إدارة الجودة الشاملة و التطوير المؤسسي", "قسم تقويم الأداء المؤسسي"
                    ], //تشكيل مستقل
                ]
            }, //"شبكة الإعلام العراقي",
            {
                FSelected_Value: "وزارة الداخلية",
                SSelected_Value: ["تشكيل مستقل"],
                Showed_Value: [
                    [
                        "مكتب الوزير", "مكتب وكيل الوزارة للشؤون الإدارية والمالية", "وكالة الوزارة لشؤون الشرطة", "مكتب وكيل الوزارة لشؤون الامن الاتحادي",
                        "وكيل الوزارة لشؤون الاستخبارات والتحقيقات الاتحادية",
                    ], //تشكيل مستقل
                ]
            }, //"وزارة الداخلية",
        ];

        this.inputFormField["amannadep"] = null;    
        let Result = Values.find(
            (Finding) => this.inputFormField["circle"] === Finding.FSelected_Value
        );

        if (Result) {
            let Value_Index = Result.SSelected_Value.indexOf(event);
            if (Value_Index !== -1) {
                document.getElementById("48098").style.display = "block";
                this.group_of_form[0].fields[5].properties[0].values = Result.Showed_Value[Value_Index];
            } else {
                document.getElementById("48098").style.display = "none";
                this.group_of_form[0].fields[5].properties[0].values = [];
            }
        } else {
            document.getElementById("48098").style.display = "none";
            this.group_of_form[0].fields[5].properties[0].values = [];
        }

        // let Result = Values.find((Finding) => this.inputFormField["circle"] === Finding.FSelected_Value);
        // let Value_Index = Result.SSelected_Value.indexOf(event);
        /*
        if(Value_Index !== -1 && Result){
            document.getElementById("48098").style.display = "block";
            this.group_of_form[0].fields[5].properties[0].values = Result.Showed_Value[Value_Index];
        }else{
            document.getElementById("48098").style.display = "none";
            this.group_of_form[0].fields[5].properties[0].values = [];
        }
            */
    },

    //التاكد من دخول الموظف الى الاستمارة واختياره لجهته
    singleNotification(notifyText, position) {
        this.$toast.error(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    ssingleNotification(notifyText, position) {
        this.$toast.success(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    checkEmployee(event){
        if (event) {
            let loader = this.$loading.show({
                container: this.$refs.formContainer,
                loader: "dots",
                transition: "fade",
                color: "#c30734"
            });

            let Values = [
                {Selected_Value: "وزارة الدفاع", Password: "UE3@1" },
                {Selected_Value: "وزارة الداخلية", Password: "VI4@1" },
                {Selected_Value: "وزارة الخارجية", Password: "KS1@1" },
                {Selected_Value: "وزارة المالية", Password: "HB1@1" },
                {Selected_Value: "وزارة النفط", Password: "LT1@1" },
                {Selected_Value: "وزارة الكهرباء", Password: "CN2@1" },
                {Selected_Value: "وزارة الاعمار والاسكان و البلديات والاشغال العامة", Password: "YI9@1" },
                {Selected_Value: "وزارة التربية", Password: "EY6@1" },
                {Selected_Value: "وزارة التعليم العالي والبحث العلمي", Password: "QO5@1" },
                {Selected_Value: "وزارة الاتصالات", Password: "PP7@1" },
                {Selected_Value: "وزارة الصحة", Password: "RN2@1" },
                {Selected_Value: "وزارة التخطيط", Password: "PM2@1" },
                {Selected_Value: "وزارة التجارة", Password: "LT3@1" },
                {Selected_Value: "وزارة الصناعة والمعادن", Password: "IN0@1" },
                {Selected_Value: "وزارة الزراعة", Password: "KS4@1" },
                {Selected_Value: "وزارة العدل", Password: "LV6@1" },
                {Selected_Value: "وزارة العمل والشؤون الاجتماعية", Password: "XL5@1" },
                {Selected_Value: "وزارة الموارد المائية", Password: "DE6@1" },
                {Selected_Value: "وزارة النقل", Password: "II1@1" },
                {Selected_Value: "وزارة الثقافة والسياحة والاثار", Password: "OH6@1" },
                {Selected_Value: "وزارة الهجرة والمهجرين", Password: "QR2@1" },
                {Selected_Value: "وزارة الشباب والرياضة", Password: "YD2@1" },
                {Selected_Value: "وزارة البيئة", Password: "YP3@1" },
                {Selected_Value: "محافظة بغداد", Password: "LX3@3" },
                {Selected_Value: "محافظة واسـط", Password: "MP1@3" },
                {Selected_Value: "محافظة نينوى", Password: "AX2@3" },
                {Selected_Value: "محافظة النجف الاشرف", Password: "UW0@3" },
                {Selected_Value: "محافظة كربلاء المقدسة", Password: "LP4@3" },
                {Selected_Value: "محافظة المثـنى", Password: "EA6@3" },
                {Selected_Value: "محافظة ميسـان", Password: "UZ6@3" },
                {Selected_Value: "محافظة ديالى", Password: "BD5@3" },
                {Selected_Value: "محافظة الديوانيـة", Password: "NR5@3" },
                {Selected_Value: "محافظة البصرة", Password: "KC2@3" },
                {Selected_Value: "محافظة ذي قـار", Password: "YH1@3" },
                {Selected_Value: "محافظة الانبار", Password: "IZ6@3" },
                {Selected_Value: "محافظة كركـوك", Password: "JC6@3" },
                {Selected_Value: "محافظة بابـل", Password: "DN2@3" },
                {Selected_Value: "محافظة صلاح الديـن", Password: "HQ7@3" },
                {Selected_Value: "الهيأة العليا للتنسيق بين المحافظات", Password: "VK4@2" },
                {Selected_Value: "الهيئة العليا للحج والعمرة", Password: "OG1@2" },
                {Selected_Value: "الهيئة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايلوجية", Password: "XU0@2" },
                {Selected_Value: "هيئة الاوراق المالية", Password: "KM2@2" },
                {Selected_Value: "هيئة النزاهة", Password: "RU6@2" },
                {Selected_Value: "هيئة دعاوى الملكية", Password: "IM1@2" },
                {Selected_Value: "الهيئة الوطنية للمساءلة والعدالة", Password: "ZH8@2" },
                {Selected_Value: "هيئة الحشد الشعبي", Password: "QI6@2" },
                {Selected_Value: "الهيئة الوطنية للاستثمار", Password: "AW0@2" },
                {Selected_Value: "هيئة الاعلام والاتصالات", Password: "ZJ2@2" },
                {Selected_Value: "هيئة المنافذ الحدودية", Password: "ES3@2" },
                {Selected_Value: "هيئة التصنيع الحربي", Password: "UZ1@2" },
                {Selected_Value: "هيئة الطاقة الذرية", Password: "RB0@2" },
                {Selected_Value: "الهيئة العامة لمراقبة الواردات الاتحادية", Password: "TW3@2" },
                {Selected_Value: "هيئة استثمار بغداد", Password: "XM6@2" },
                {Selected_Value: "مجلس القضاء الأعلى", Password: "IJ6@2" },
                {Selected_Value: "مجلس الدولة", Password: "NO2@2" },
                {Selected_Value: "مجلس الخدمة الاتحادي", Password: "IZ8@2" },
                {Selected_Value: "مجلس شؤون المنافسة ومنع الاحتكار", Password: "YO6@2" },
                {Selected_Value: "ديوان الرقابة المالية الاتحادية", Password: "MR7@2" },
                {Selected_Value: "ديوان الوقف الشيعي", Password: "AE1@2" },
                {Selected_Value: "ديوان الوقف السني", Password: "QA1@2" },
                {Selected_Value: "ديوان اوقاف الديانات المسيحية والايزيدية والصابئة المندائية", Password: "YB2@2" },
                {Selected_Value: "مؤسسة الشهداء", Password: "NJ4@2" },
                {Selected_Value: "مؤسسة السجناء السياسيين", Password: "TA0@2" },
                {Selected_Value: "العتبة الحسينية المقدسة", Password: "ND7@2" },
                {Selected_Value: "العتبة العباسية المقدسة", Password: "MN3@2" },
                {Selected_Value: "مكتب رئيس الوزراء", Password: "PM1@2" },
                {Selected_Value: "رئاسة الجمهورية", Password: "JA3@2" },
                {Selected_Value: "مجلس النواب", Password: "NF1@2" },
                {Selected_Value: "الامانة العامة لمجلس الوزراء", Password: "GS4@2" },
                {Selected_Value: "المحكمة الإتحادية العليا", Password: "CV7@2" },
                {Selected_Value: "امانة بغداد", Password: "MA9@2" },
                {Selected_Value: "جهاز المخابرات الوطني", Password: "YZ3@2" },
                {Selected_Value: "المجمع العلمي العراقي", Password: "FE7@2" },
                {Selected_Value: "بيت الحكمة", Password: "FS8@2" },
                {Selected_Value: "البنك المركزي العراقي", Password: "JU8@2" },
                {Selected_Value: "المفوضية العليا المستقلة للانتخابات", Password: "LU8@2" },
                {Selected_Value: "جهاز الامن الوطني", Password: "SA4@2" },
                {Selected_Value: "سلطة الطيران المدني", Password: "GN7@2" },
                {Selected_Value: "المصرف العراقي التجاري", Password: "TL2@2" },
                {Selected_Value: "جهاز مكافحة الإرهاب", Password: "VC1@2" },
                {Selected_Value: "اللجنة الأولمبية الوطنية العراقية", Password: "NP1@2" },
                {Selected_Value: "مستشارية الأمن القومي", Password: "RE0@2" },
                {Selected_Value: "شبكة الإعلام العراقي", Password: "LI0@2" },
                {Selected_Value: "المفوضية العليا لحقوق الانسان في العراق", Password: "LC3@2" },
                {Selected_Value: "مركز العمليات الوطني", Password: "UY6@2" },
            ];
            let Groups_ID = [
                "12698_group", // اولًا/ القيادة والادارة
                "12699_group", // ثانياً/ التخطيط الستراتيجي 
                "12700_group", // ثالثاً / التمكين و الولاء الوظيفي
                "12703_group", // رابعاً / السلوك و الاستحقاق الوظيفي
                "12706_group", // خامساً / السلامة والصحة المهنية والبيئة
                "12704_group", // سادساً / الدعم و التواصل
                "12708_group", // المقترحات والافكار 
            ];
            
            // let matchFound = false; // Flag to track if a match is found
            let Result = Values.find((Finding) => 
                this.inputFormField["circle"] === Finding.Selected_Value && this.inputFormField["PassValue"] === Finding.Password
            );

            if(Result || this.inputFormField["PassValue"] == "NDTC6"){
                // matchFound = true;
                Groups_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");

                loader.hide();
                this.ssingleNotification("تم الدخول بنجاح", "top-right");
            }else{
                loader.hide();
                this.singleNotification("اسم او رمز الجهة غير مطابق", "top-right");
            }
            // if (!matchFound) {
            //     loader.hide();
            //     this.singleNotification("اسم او رمز الجهة غير مطابق", "top-right");
            // }
        }
    },
    
    //اخفاء واظهار حقل (المحافظة) على اساس حقل (اسم التشكيل) واظهار واخفار حقل (التشكيل الفرعي) عند اختيار احدى تشكيلات وزارة الداخليه من حقل (اسم التشكيل)
    First_Hide(event){
        this.inputFormField["governorate"] = null; //المحافظة
        if(event == "فروع الهيئة في المحافظات" || event == "المكاتب الانتخابية في المحافظات"){
            document.getElementById("73433").style.display = "block"; //المحافظة
        }else{
            document.getElementById("73433").style.display = "none"; //المحافظة
        }

        //------------------------------------------------------------------------------------------------
        const Values = [
            {
                Selected_Value: "مكتب الوزير",
                Showed_Value: ["مكتب الوزير",]
            },
            {
                Selected_Value: "مكتب وكيل الوزارة للشؤون الإدارية والمالية",
                Showed_Value: [
                    "مكتب الوكيل", "مديرية إدارة الموارد البشرية", "مديرية البنى التحتيه", "مديرية التدريب والتاهيل", "مديرية الشؤون المالية",
                    "مديرية الاتصالات والنظم المعلوماتية",
                ],
            },
            {
                Selected_Value: "وكالة الوزارة لشؤون الشرطة",
                Showed_Value: ["مكتب الوكالة", "قيادة شرطة المحافظة", "مديرية المرور", "مديرية الجنائية والحركات",]
            },
            {
                Selected_Value: "مكتب وكيل الوزارة لشؤون الامن الاتحادي",
                Showed_Value: ["مكتب الوكيل", "مديرية شرطة الطاقة", "مديرية الدفاع المدني", "قيادة قوات الحدود", "قيادة قوات الشرطة  الاتحادية", "مديرية شرطة الطاقة",]
            },
            {
                Selected_Value: "وكيل الوزارة لشؤون الاستخبارات والتحقيقات الاتحادية",
                Showed_Value: [
                    "مكتب الوكيل", "مديرية الاستخبارات ومكافحة الإرهاب", "مديرية مكافحة الجريمة المنظمة", "مديرية التقنيات والمعلوماتية", "مديرية مكافحة جرائم  المعلوماتية",
                    "معهد الاستخبارات والتحقيقات الاتحادية"
                ]
            },
        ];

        let MainDept = this.inputFormField.circle === "وزارة الداخلية";
        let Result = Values.find((Finding) => event === Finding.Selected_Value);

        this.inputFormField["SubDeptName"] = null;
        if(Result && MainDept){
            document.getElementById("93642").style.display = "block";
            this.group_of_form[0].fields[6].properties[0].values = Result.Showed_Value;
        }else{
            document.getElementById("93642").style.display = "none";
            this.group_of_form[0].fields[6].properties[0].values = [];
        }
    },

    //فلترة حقل (نوع التشكيل الفرعي) على اساس حقل (التشكيل الفرعي)
    Fourth_Filter(event){
        this.inputFormField["SubDeptType"] = null; //نوع التشكيل الفرعي
        const Values = [
            {
                Selected_Value: ["مكتب الوزير",],
                Showed_Value: ["مديرية", "دائرة", "تشكيل مستقل"],
            },
            {
                Selected_Value: [
                    "مكتب الوكيل", "مديرية إدارة الموارد البشرية", "مديرية البنى التحتيه", "مديرية التدريب والتاهيل", "مديرية الشؤون المالية", "مديرية مكافحة الجريمة المنظمة",
                    "مديرية الاتصالات والنظم المعلوماتية", "مكتب الوكالة", "قيادة شرطة المحافظة", "مديرية المرور", "مديرية الجنائية والحركات", "قيادة قوات الحدود",
                    "قيادة قوات الشرطة  الاتحادية", "مديرية الدفاع المدني", "مديرية الاستخبارات ومكافحة الإرهاب",
                ],
                Showed_Value: ["مديرية", "تشكيل مستقل"],
            },
            {
                Selected_Value: ["مديرية شرطة الطاقة", "مديرية التقنيات والمعلوماتية", "مديرية مكافحة جرائم  المعلوماتية", "معهد الاستخبارات والتحقيقات الاتحادية"],
                Showed_Value: ["تشكيل مستقل"],
            },
        ];

        const Result = Values.find((Finding) => Finding.Selected_Value.includes(event));
        if(Result){
            document.getElementById("93673").style.display = "block";
            this.group_of_form[0].fields[7].properties[0].values = Result.Showed_Value;
        }else{
            document.getElementById("93673").style.display = "none";
            this.group_of_form[0].fields[7].properties[0].values = "";
        }
    },

    //فلترة حقل (التشكيل) على اساس حقلي (التشكيل الفرعي) و(نوع التشكيل الفرعي)
    Fifth_Filter(event){
        const Values = [
            {
                FSelected_Value: "مكتب الوزير",
                Second_Values: [
                    {
                        SSelected_Value: "مكتب الوزير",
                        TSelected_Value: ["دائرة", "مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["الدائرة القانونية", "دائرة العلاقات والاعلام", "دائرة عمليات الوزارة",],//دائرة
                            [
                                "مديرية العقود", "مديرية التخطيط  والمتابعة", "مديرية امن الافراد", "مديرية العامة لشؤون المخدرات والمؤثرات العقلية",
                                "مديرية الأحوال المدنية والجوازات والإقامة", "مديرية أمن وسلامة الوزارة", "مديرية شرطة حماية السفارات والدبلوماسيين", "مديرية شؤون العشائر",
                                "مديرية شؤون الشركات الامنية الخاصة", "مديرية الهويات واجازات السلاح", "مديرية الشرطة العربية والدولية", "مديرية التدقيق والرقابة الداخلية",
                                "مديرية التعاون الدولي", "مديرية الشكاوى", "مديرية شؤون الشهداء والجرحى", "مديرية شؤون الرعاية الصحية لقوى الامن الداخلي",
                                "مديرية حقوق الانسان", "مديرية الاشراف والتقيم لمحاكم قوى الامن الداخلي", "مديرية امن وحماية المطارات", "مديرية الامن السيبراني",
                                "مديرية إدارة الموارد البشرية", "مديرية إدارة الضباط", "مديرية الموظفين المدنيين", "مديرية المراتب", "مديرية الأرشيف", "مديرية الملاك",
                                "مديرية التقاعد", "مديرية التطوع", "مديرية السجلات والوثائق", "مديرية الايفادات",
                            ],//مديرية
                            [
                                "مكتب المستشارين", "فرقة الرد السريع", "مكتب الوزير", "كلية الشرطة", "كلية الشرطة الثانية", "المعهد العالي للتطوير الأمني والإداري",
                                "هيئة تفتيش قوى الامن الداخلي", "محكمة تمييز قوى الامن الداخلي", "المركز الوطني لإدارة الازمات والكوارث", "صندوق شهداء الشرطة",
                                "صندوق التنمية ودعم قوى الامن الداخلي", "مركز البحوث والدراسات", " المكتب الاستشاري الهندسي لوزارة الداخلية"
                            ],//تشكيل مستقل
                        ]
                    },
                ]
            },
            {
                FSelected_Value: "مكتب وكيل الوزارة للشؤون الإدارية والمالية",
                Second_Values: [
                    {
                        SSelected_Value: "مكتب الوكيل",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "مديرية عقارات واسكان وزارة الداخلية", "مديرية الشؤون القانونية", "مديرية التدقيق المركزي", "مديرية الاشغال الهندسية", "مديرية الصيانة والخدمات",
                                "مديرية تصليح اليات مقر الوزارة", "مديرية إدارة الموارد البشرية", "مديرية البنى التحتية", "مديرية  التدريب والتاهيل ", "مديرية الشؤون المالية",
                                "مديرية الاتصالات والنظم المعلوماتية",
                            ], //مديرية
                            ["مكتب وكيل الوزارة الاقدم", "قسم الفحص والقبول",], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية إدارة الموارد البشرية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "مديرية إدارة الضباط", "مديرية الموظفين المدنيين", "مديرية المراتب", "مديرية الأرشيف", "مديرية الملاك", "مديرية التقاعد", "مديرية التطوع",
                                "مديرية السجلات والوثائق", "مديرية الايفادات",
                            ], //مديرية
                            [
                                "قسم الهياكل والقياسات والاستحداث", "قسم الاتصالات والنظم المعلوماتية", "قسم التخطيط والمتابعة", "قسم الصادر والوارد", "قسم الموارد البشرية",
                                "قسم العلاقات والاعلام", "قسم الشؤون القانونية", "قسم الحسابات",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية البنى التحتيه",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية التجهيز", "مديرية التسليح", "مديرية التموين والنقل",], //مديرية
                            [
                                "قسم المستودعات الالية والفنية", "فوج حماية مديرية البنى التحتية", "القسم الإداري", "قسم الحسابات", "قسم التخطيط والمتابعة", "القسم القانوني",
                                "قسم الصيانة والخدمات", "قسم تصليح عجلات البنى التحتية", "قسم مستودعات المواد المعادة والمستهلكة", "قسم تفتيش استهلاك وتصنيف العجلات", "قسم التدريب",
                                "قسم الاتصالات والنظم المعلوماتية", "معمل الحدادة", "معمل النجارة",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية التدريب والتاهيل",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الشؤون التدريبية والتعليمية", "مديرية الشؤون الإدارية والمالية", "مديرية التدريب البدني والعاب الشرطة",], //مديرية
                            ["معاون شؤون التدريب", "قسم القانونية", "قسم التخطيط والمتابعة", "قسم العلاقات والاعلام", "قسم التدقيق", "قسم الاستشارات التدريبية",], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية الشؤون المالية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الحسابات",], //مديرية
                            ["قسم الموارد البشرية", "قسم التخطيط والمتابعة", "قسم القانونية", "قسم تكنولوجيا المعلومات",], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية الاتصالات والنظم المعلوماتية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الاتصالات", "مديرية النظم المعلوماتية",], //مديرية
                            [
                                "المعاون الفني", "المعاون الإداري", "قسم التخطيط والمتابعة", "قسم الموارد البشرية", "قسم الرقابة والتدقيق الداخلي", "قسم الحسابات", "قسم الاليات",
                                "قسم الكاميرات والمراقبة الفديوية", "مركز التدريب والتطوير الاتصالات والمعلوماتية",
                            ], //تشكيل مستقل
                        ]
                    },
                ]
            },
            {
                FSelected_Value: "وكالة الوزارة لشؤون الشرطة",
                Second_Values: [
                    {
                        SSelected_Value: "مكتب الوكالة",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "مديرية الشرطة المجتمعية", "مديرية تدريب شرطة النجدة ", "مديرية إدارة وتدريب الكلاب البوليسية", "مديرية شؤون قوى الامن الداخلي",
                                "مديرية الشؤون القانونية", "مديرية تحقيق الأدلة الجنائية", "مديرية البنى التحتية", "مديرية حماية الاسرة والطفل من العنف الاسري",
                                "مديرية الإدارة والمالية", "مديرية مكافحة المتفجرات", "مديرية شرطة امانة بغداد", "مديرية مكافحة اجرام بغداد الكرخ / الرصافة",
                                "مديرية حماية الشخصيات", "مديرية التسجيل الجنائي", "مديرية المرور", "مديرية الجنائية والحركات",
                            ], //مديرية
                            ["مكتب الوكيل", "قيادة شرطة المحافظة",], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "قيادة شرطة المحافظة",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الشؤون الإدارية والمالية", "مديرية شؤون الافواج", "مديرية حماية المنشآت",], //مديرية
                            [
                                "قسم الجنائية والحركات", "قسم النظم المعلوماتية", "قسم الكاميرات والمراقبة الفديوية", "قسم صندوق شهداء الشرطة", "قسم مكافحة الاجرام",
                                "قسم الشؤون القانونية", "قسم العلاقات والاعلام", "قسم الشرطة العربية والدولية", "قسم شرطة النجدة", "قسم شرطة النجدة النهرية", "قسم شؤون السيطرات",
                                "قسم حماية الطرق الخارجية", "قسم التدريب البدني والعاب الشرطة", "قسم الاتصالات", "قسم شؤون المراة", "قسم التخطيط والمتابعة", "مركز العمليات المشتركة",
                                "مركز التدريب الأساسي في المحافظة", "قسم الرقابة والتدقيق الداخلي", "قسم إدارة وتدريب الكلاب البوليسية", "قسم حماية الاسرة والطفل من العنف الاسري",
                                "قسم التدريب والدورات", "قسم المتابعة واللجان", "قسم حماية الاثار والتراث", "قسم الشرطة القضائية",   
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية المرور",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية تسجيل المركبات واجازات السياقة", "مديرية مرور محافظة بغداد", "مديرية مرور المحافظات", "مديرية هندسة الطرق والعلامات المرورية"], //مديرية
                            [
                                "قسم الرقابة والتدقيق الداخلي", "قسم الجنائية والحركات", "قسم دراجات المراسم والوفود", "قسم الاتصالات (السيطرة المرورية)", "قسم اللجان والمتابعة",
                                "قسم الكاميرات والمراقبة الفديوية", "قسم نظم المعلومات",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية الجنائية والحركات",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الجنائية والحركات", "مديرية الإحصاء الجنائي",], //مديرية
                            [
                                "قسم الأشخاص", "قسم الخطط الأمنية", "قسم الإرهاب والجرائم الجنائية", "قسم الخطف والمفقودين", "قسم متابعة المحكومين والموقوفين",
                                "قسم السيطرة وتنظيم السلاح", "قسم التحليل الاحصائي", "قسم الإحصاء الجنائي", "قسم استمارات مسح الجريمة والمرور",
                            ], //تشكيل مستقل
                        ]
                    },
                ]
            },
            {
                FSelected_Value: "مكتب وكيل الوزارة لشؤون الامن الاتحادي",
                Second_Values: [
                    {
                        SSelected_Value: "مكتب الوكيل",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الشؤون القانونية", "مديرية الشؤون الإدارية", "مديرية شرطة الكهرباء", "مديرية شرطة البيئة", "مديرية شرطة الطاقة", "مديرية الدفاع المدني",], //مديرية
                            [
                                "قيادة قوات الشرطة الاتحادية", "قيادة قوات الحدود", "مكتب الوكيل", "قسم التخطيط والمتابعة", "قسم الاتصالات والنظم المعلوماتية", "قسم الحسابات",
                                "قسم العمليات", "قسم العلاقات والاعلام", "قسم المتابعة واللجان", "قسم التدريب والايفادات",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية شرطة الطاقة",
                        TSelected_Value: ["تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "قسم التخطيط والمتابعة", "قسم المتابعة", "قسم شؤون سيطرات الطاقة", "قسم الشؤون القانونية", "مركز الحركات النفط والطاقة",
                                "قسم الرقابة والتدقيق الداخلي", "ضباط ركن الدفاع الجوي", "الوية شرطة الطاقة",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية الدفاع المدني",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية الدفاع المدني"], //مديرية
                            [
                                "معهد الدفاع المدني", "قسم الرقابة والتدقيق الداخلي", "قسم التخطيط والمتابعة", "القسم القانوني", "قسم عقارات واسكان وزارة الداخلية",
                                "فريق البحث والإنقاذ العراقي", "محطة الاستجابة والسيطرة", "قسم الاشغال الهندسية", "قسم التدقيق", "قسم العمليات", "قسم التفتيش الاختصاصي",
                                "قسم الاليات", "قسم العلاقات والاعلام", "قسم العقود", "قسم الاستجابة للحوادث الكيمياوية والبايولوجية والاشعاعية والنووية (CBRN)",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "قيادة قوات الحدود",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "مديرية الشؤون الإدارية", "مديرية الميرة", "مديرية الدائرة القانونية", "مديرية العمليات", "مديرية الهندسة والمتفجرات",
                                "مديرية الاتصالات والنظم المعلوماتية", "مديرية الرواتب والأمور المالية ", "مديرية الرواتب والأمور المالية", "مديرية التدريب", "مديرية الاشغال الهندسية",
                            ], //مديرية
                            [
                                "لواء المغاوير", "قسم الرقابة والتدقيق الداخلي", "قيادة المنطقة الأولى", "قيادة المنطقة الثانية", "قيادة المنطقة الثالة", "قيادة المنطقة الرابعة",
                                "قيادة المنطقة الخامسة", "قيادة المنطقة السادسة",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "قيادة قوات الشرطة  الاتحادية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "مديرية الشؤون الإدارية", "مديرية الميرة", "مديرية الشؤون القانونية", "مديرية العمليات", "مديرية الهندسة والمتفجرات",
                                "مديرية الاتصالات والنظم المعلوماتية", "مديرية الرواتب والأمور المالية", "مديرية التدريب",
                            ], //مديرية
                            [
                                "امرية حماية السجون", "قيادة منطقة سامراء", "قيادة حفظ القانون", "لواء المهمات الخاصة", "قسم الرقابة والتدقيق الداخلي", "قيادة الفرقة الأولى",
                                "قيادة الفرقة الثانية", "قيادة الفرقة الثالثة", "قيادة الفرقة الرابعة", "قيادة الفرقة الخامسة",
                            ], //تشكيل مستقل
                        ]
                    },
                ]
            },
            {
                FSelected_Value: "وكيل الوزارة لشؤون الاستخبارات والتحقيقات الاتحادية",                   
                Second_Values: [
                    {
                        SSelected_Value: "مكتب الوكيل",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "مديرية استخبارات الشرطة الاتحادية", "مديرية الإدارة والمالية", "مديرية الشؤون القانونية", "مديرية الواجهات والمراقبة السرية",
                                "مديرية الجمع والتحيل الاستخباراتي", "مديرية استخبارات قيادة قوات الشرطة الاتحادية", " المديرية الفنية", "مديرية الاستخبارات ومكافحة الإرهاب",
                                "مديرية مكافحة الجريمة المنظمة", "مديرية التقنيات والمعلوماتية", "مديرية مكافحة جرائم المعلوماتية", 
                            ], //مديرية
                            [
                                "مكتب الوكيل", "خلية الصقور الاستخبارتية", "قسم التخطيط والمتابعة", "قسم التتنسيق الدولي والترجمة الاستخبارية", "قسم المتابعة واللجان",
                                "ضابط متابعة شؤون الفنية", "قسم الرقابة والتدقيق الداخلي", "قسم حماية مواقع الوكالة", "قسم العلاقات والاعلام", "الخلية الاستخبارية",
                                "قسم استخبرات المنطقة الخضراء", "معهد الاستخبارات والتحقيقات الاتحادية",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية الاستخبارات ومكافحة الإرهاب",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [" مديرية الاستخبارات", "مديرية التحقيقات", "مديرية الاستخبارات ومكافحة الإرهاب",], //مديرية
                            [
                                "قسم الموارد البشرية", "القسم الفني", "قسم الحسابات", "القسم القانوني", "قسم التخطيط والمتابعة", "قسم العمليات", "محطة الاستجابة والسيطرة",
                                "قسم الرقابة والتدقيق الداخلي", "قسم العقود", "قسم الاشغال الهندسية", "قسم التسجيل الجنائي", "قسم امن الوافدين", "قسم استخبارات دوائر الإصلاح",
                                "قسم امن الشركات التجارية العراقية والأجنبية", "قسم استخبارات الجامعات والمعاهد", "قسم استخبارات حماية منشآت بغداد",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية مكافحة الجريمة المنظمة",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            ["مديرية مكافحة التهريب والجرائم المالية", "مديرية مكافحة الجريمة المنظمة",], //مديرية
                            [
                                "قسم الموارد البشرية", "القسم الفني", "قسم الحسابات", "القسم القانوني", "قسم التخطيط والمتابعة", "قسم العمليات", "محطة الاستجابة والسيطرة",
                                "قسم الرقابة والتدقيق الداخلي", "قسم الاشغال الهندسية", "قسم استخبارات شرطة الطاقة", "قسم مكافحة الاتجار بالبشر والأعضاء البشرية",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية التقنيات والمعلوماتية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "قسم الاستطلاع الجوي الاستخباري", "قسم الموارد البشرية", "قسم الاشغال الهندسية", "قسم التخطيط والمتابعة", "قسم الجريمة الالكترونية",
                                "قسم التقنيات والمعلوماتية مقر مديرية الاستخبارات ومكافحة الإرهاب / الجريمة المنظمة", "قسم التقنيات والمعلوماتية في بغداد والمحافظات",
                                "قسم تقنيات المراقبة والتعقب", "قسم مراقبة الاتصالات عبر الأقمار الصناعية", "قسم الاعتراض القانوني للاتصالات المحلية", "قسم الاتصالات",
                                "قسم تكنولوجيا المعلومات", "قسم حماية الاتصالات والمعلوماتية", "قسم التراخيص والسيطرة الفنية", "مركز المراقبة والسيطرة الالكترونية",
                                "قسم الاستخبارات المكانية GIS", "القسم القانوني", "قسم الرقابة والتدقيق الداخلي", "قسم الحسابات"
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "مديرية مكافحة جرائم  المعلوماتية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "اقسام مكافحة جرائم المعلوماتية في جانبي الكرخ والرصافة", "قسم الأدلة الرقمية", "قسم مكافحة جرائم المعلوماتية", 
                                "قسم العمليات  النفسية والرصد الالكتروني", "قسم التحقيقات في جرائم المعلوماتية",
                            ], //تشكيل مستقل
                        ]
                    },
                    {
                        SSelected_Value: "معهد الاستخبارات والتحقيقات الاتحادية",
                        TSelected_Value: ["مديرية", "تشكيل مستقل"],
                        Showed_Value: [
                            [
                                "قسم تدريس التحقيق الاستخباري في الجرائم الإرهابية والمنظمة", "قسم تدريس العلوم الأمنية الاستخبارية", "قسم تدريب العلوم الفنية الاستخبارية",
                                "قسم المطعم والخدمات",
                            ], //تشكيل مستقل
                        ]
                    },
                ]
            },
        ];


        const Main_Dept = this.inputFormField.circle === "وزارة الداخلية";
        const Result = Values.find((Finding) => Finding.FSelected_Value === this.inputFormField.amannadep); //المقارنة مع حقل اسم التشكيل
        let Second_Result;

        if(Result){
            Second_Result = Result.Second_Values.find((Finding) => Finding.SSelected_Value === this.inputFormField.SubDeptName); //المقارنة مع حقل التشكيل الفرعي
        }

        if(Main_Dept && Result && Second_Result){
            let Value_Index = Second_Result.TSelected_Value.indexOf(event);
            if (Value_Index !== -1) {
                document.getElementById("93674").style.display = "block";
                this.group_of_form[0].fields[8].properties[0].values = Second_Result.Showed_Value[Value_Index];
            } else {
                document.getElementById("93674").style.display = "none";
                this.group_of_form[0].fields[8].properties[0].values = [];
            }
        }else{
            document.getElementById("93674").style.display = "none";
            this.group_of_form[0].fields[8].properties[0].values = [];
        }
    },
}