{
  if (this.tab_click == "form") {
    var Fields_ID = [
        "69201", //آخرى تذكر
        "30313", //تملء بيانات الترخيص السابقة (اذا كانت الاجابة نعم)
        "30321", //اذا كانت الاجابة نعم قم بملئ الدورات التدريبية في مجال الوقاية من الاشعاع (ترفق نسخة من شهادات التدريب)
      ],
      Fields_Prog = [
        "oth", //آخرى تذكر
        "fdhkh", //تملء بيانات الترخيص السابقة (اذا كانت الاجابة نعم)
        "TVB", //اذا كانت الاجابة نعم قم بملئ الدورات التدريبية في مجال الوقاية من الاشعاع (ترفق نسخة من شهادات التدريب)
      ];

    for (var i = 0; i < Fields_ID.length; i++) {
      document.getElementById(Fields_ID[i]).style.visibility = "collapse";
    }
  }
}
