{
  nuketrash(event) {
    if (event === "علاج اشعاعي") {
      document.getElementById("27404").style.display = "block";
    } else {
      document.getElementById("27404").style.display = "none";
    }
  },

  First_Hide(event){
    this.inputFormField["yui"] = null;//اسم مدير المؤسسة
    this.inputFormField["cvf"] = null;//اسم مالك المؤسسة
    if(event == "قطاع حكومي" || event == "قطاع مختلط"){
      document.getElementById("27389").style.display = "block"; //اسم مدير المؤسسة
      document.getElementById("53730").style.display = "none"; //اسم مالك المؤسسة
    }else if(event == "قطاع خاص"){
      document.getElementById("27389").style.display = "none"; //اسم مدير المؤسسة
      document.getElementById("53730").style.display = "block"; //اسم مالك المؤسسة
    }else{
      document.getElementById("27389").style.display = "none"; //اسم مدير المؤسسة
      document.getElementById("53730").style.display = "none"; //اسم مالك المؤسسة
    }
  },

  Second_Hide(event){
    this.inputFormField["IDNum"] = null;
    this.inputFormField["vbg"] = null;
    if(event == "البطاقة الوطنية"){
      document.getElementById("73118").style.display = "block";
      document.getElementById("27392").style.display = "none";
    }else if(event  == "جواز السفر"){
      document.getElementById("73118").style.display = "none";
      document.getElementById("27392").style.display = "block";
    }else{
      document.getElementById("73118").style.display = "none";
      document.getElementById("27392").style.display = "none";
    }
  },

  getsubCities(event) {
    //تفريغ حقل الاقضية
    this.inputFormField["district"] = null;
    //تفريغ حقل اسم القضاء
    this.inputFormField["FirstDist"] = null;

    var Values = [
      "الانبار",
      "بابل",
      "بغداد",
      "البصرة",
      "ديالى",
      "ذي قار",
      "صلاح الدين",
      "القادسية",
      "كركوك",
      "كربلاء المقدسة",
      "المثنى",
      "ميسان",
      "النجف الاشرف",
      "نينوى",
      "واسط",
    ],
    Second_Values = [
      //الي مابيهن اقضيه
      "اربيل", "السليمانية", "دهوك", "حلبجة",
    ],
    getdistnict =
      [
        [
            "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية",
            "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة", "النخيب",
            "هيت", "الوفاء", "الوليد"
        ],//اقضية الانبار
        [
            "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع",
            "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"
        ],//اقضية بابل
        [
            "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون",
            "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية",//الكرخ
            "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية",
            "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة",
            "ذات السلاسل", "فلسطين"//الرصافة
        ],//اقضية بغداد
        [
            "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر",
            "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق"
        ],//اقضية البصرة
        [
            "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية",
            "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي",
            "قرة تبة", "سيف سعد"
        ],//اقضية ديالى
        [
            "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش",
            "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل",
            "سوق الشيوخ", "عكيكة"
        ],//اقضية ذي قار
        [
            "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي",
            "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "طوز خورماتو", "يثرب", "العوجة"
        ],//اقضية صلاح الدين
        [
            "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية",
            "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"
        ],//اقضية القادسية
        [
            "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق",
            "كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"
        ],//اقضية كركوك
        [
            "عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"
        ],//اقضية كربلاء
        [
            "الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة",
            "السلمان", "السماوة", "السوير"
        ],//اقضية المثنى
        [
            "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير",
            "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"
        ],//اقضية ميسان
        [
            "العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية",
            "النجف", "الشبكة"
        ],//اقضية النجف
        [
            "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة",
            "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة",
            "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف",
            "وانة", "زيلكان", "زمار", "الفاروق"
        ],//اقضية نينوى
        [
            "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية",
            "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)",
            "ناحية واسط"
        ],//اقضية واسط
    ];

    if(Values.includes(event)){
      document.getElementById("73625").style.display = "block"; //سلكتر الاقضية
      for(var i = 0; i < Values.length; i++){
        if(event == Values[i]){
          this.group_of_form[0].fields[9].properties[0].values = getdistnict[i];
          break;
        }else{
          this.group_of_form[0].fields[9].properties[0].values = [];
        }
      }
      document.getElementById("74869").style.display = "none"; //اسم القضاء
    }else if(Second_Values.includes(event)){
      document.getElementById("74869").style.display = "block"; //اسم القضاء
      document.getElementById("73625").style.display = "none"; //سلكتر الاقضية
    }else{
      document.getElementById("73625").style.display = "none"; //سلكتر الاقضية
      document.getElementById("74869").style.display = "none"; //اسم القضاء
    }
  },
}