{
  var Labels_ID = ["29469", "29468"];
  for (var i = 0; i < Labels_ID.length; i++) {
    document.getElementById(Labels_ID[i]).style.cssText =
      "color: red; font-size: 20px; font-weight: bold; padding-top: 10px; padding-bottom: 10px";
  }

  document
    .getElementById("72658")
    .setAttribute(
      "style",
      "color: #ff0000 !important; font-weight: bold; font-size: 20px; padding: 8px 19px; margin: 3px;",
    );

  this.group_of_form[0].fields[8].properties[0].values = [
    "مديرية تنفيذ الدورة",
    "مديرية تنفيذ الكاظمية",
    "مديرية تنفيذ الكرخ",
    "مديرية تنفيذ الكرادة",
    "مديرية تنفيذ الرصافة",
    "مديرية تنفيذ الشعب",
    "مديرية تنفيذ البياع",
    "مديرية تنفيذ المحمودية",
    "مديرية تنفيذ ابي غريب",
    "مديرية تنفيذ بغداد الجديدة",
    "مديرية تنفيذ الزهور",
    "مديرية تنفيذ مدينة الصدر",
    "مديرية تنفيذ المدائن",
    "مديرية تنفيذ الطارمية",
    "مديرية تنفيذ البصرة",
    //"مديرية تنفيذ الناصرية",
    //"مديرية تنفيذ نينوى / الموصل",
    "مديرية تنفيذ الناصرية الثانية",
    "مديرية تنفيذ نينوى / الموصل الثانية",
    "مديرية تنفيذ كركوك الثانية",
    "مديرية تنفيذ الديوانية",
    "مديرية تنفيذ النجف الاشرف",
    "مديرية تنفيذ الغزالية",
    "مديرية تنفيذ الرمادي",
    "مديرية تنفيذ بعقوبة",
    "مديرية تنفيذ كربلاء",
    "مديرية تنفيذ السماوة",
    "مديرية تنفيذ الكوت",
    "مديرية تنفيذ العمارة",
    "مديرية تنفيذ تكريت",
    "مديرية تنفيذ الحلة",
    "مديرية تنفيذ كركوك الاولى",
  ];
}
