{
  if (this.tab_click == "form") {
    var IDs = [
        "67780",
        "67781",
        "72269", //عنوان الشركة الدائن
        "72271", //عنوان شركة المدين
        //الدائن
        "29449", //الاسم الاول
        "29450", //اسم الاب
        "29451", //اسم الجد
        "29453", //الاسم الرابع
        "29454", //تاريخ التولد
        "29474", //رقم هوية الاحوال او البطاقة الموحدة
        "29475", //تاريخ الاصدار
        "29458", //محلة
        "29459", //زقاق
        "29462", //دار
        "29476", //رقم بطاقة السكن
        "29477", //تاريخ الاصدار
        //المدين
        "29470", //الاسم الاول
        "29471", //اسم الاب
        "29472", //اسم الجد
        "29478", //المحافظة
        "29479", //القضاء
      ],
      Progs = [
        "namea",
        "mokual",
        "FirstCompanyLocation", //عنوان الشركة الدائن
        "SecondCompanyLocation", //عنوان شركة المدين
        //الدائن
        "bhaider", //الاسم الاول
        "chaider", //اسم الاب
        "dhaider", //اسم الجد
        "ehaider", //الاسم الرابع
        "fhaider", //تاريخ التولد
        "ASdasdasd", //رقم هوية الاحوال او البطاقة الموحدة
        "dsfsdf", //تاريخ الاصدار
        "jhaider", //محلة
        "khaider", //زقاق
        "zhaider", //دار
        "adsasf", //رقم بطاقة السكن
        "htgdas", //تاريخ الاصدار
        //المدين
        "eshaider", //الاسم الاول
        "ashaider", //اسم الاب
        "nhaider", //اسم الجد
        "governorate", //المحافظة
        "district", //القضاء
      ];

    for (var i = 0; i < IDs.length; i++) {
      if (this.form_data[Progs[i]] == null) {
        document.getElementById(IDs[i]).style.visibility = "collapse";
      }
    }
  }
}
