{
  if (this.tab_click == "form") {
    document.getElementById("89697").style.visibility = "collapse"; //الموظف المعالج
    document.getElementById("93656").style.visibility = "collapse"; //موظف معالجة المعهد

    var All_IDs = [
        //الكروب الاول
        "47954", //نرجو التفضل بالموافقة على منح الاجازة
        "47888", //نرجو التفضل بالموافقة على تجديد اجازة
        "50668", //هل التجديد هو لاول مرة ؟
        "47962", //رقم الاجازة الجدارية للتأسيس
        "47963", //تاريخ اجازة الجدارية
        "47964", //رقم امر التأسيس
        "47965", //تاريخ امر التأسيس
        "47957", //عدد الطلاب للعام الماضي
        "68060", //يبدأ التجديد الجديد اعتبارًا من عام.
        "68771", //ينتهي التجديد الجديد بحلول عام
        "67215", //يبدأ آخر تجديد اعتبارًا من عام.
        "68770", //ينتهي آخر تجديد بحلول عام.
        "47960", //علما ان اخر تجديد الرقم
        "47961", //تاريخ اخر تجديد
        //الكروب الثاني
        "72105", //رقم المقام بسط
        "72106", //رقم العقار المقام
        "50716", //رقم العقار
        "71973", //سلكتر الملاحظية
        "71972", //سلكتر المديرية
        "72421", //اذا في حال مملوك للدولة
        "74257", //مال البلدية
        "73922", //في حال وجود رقم عقار اخر
        //الكروب الثالث
        //مؤسس اول
        "47970",
        "47971",
        "47972",
        "47975",
        "47977",
        "47978",
        "47980",
        //مؤسس ثاني
        "50719",
        "50721",
        "50722",
        "50723",
        "50724",
        "50725",
        "50726",
        //مؤسس ثالث
        "50727",
        "50728",
        "50729",
        "50730",
        "50731",
        "50732",
        "50733",
        //مؤسسين اخرين
        "75777",
        "75605",
        //معلومات الشركة
        "50808",
        "50735",
        "50736",
        //معلومات المدير المفوض
        "50737",
        "50738",
        "50739",
        "50740",
        "67633",
        "67634",
        "71968", //الرقم الضريبي مال المؤجر
        "75781",
        "75782",
        "71697",
      ],
      All_Progs = [
        //الكروب الاول
        "instype", //نرجو التفضل بالموافقة على منح الاجازة
        "type", //نرجو التفضل بالموافقة على تجديد اجازة
        "firstrenewal", //هل التجديد هو لاول مرة ؟
        "cernum", //رقم الاجازة الجدارية للتأسيس
        "ecerdate", //تاريخ اجازة الجدارية
        "estabnum", //رقم امر التأسيس
        "cerdateofestab", //تاريخ امر التأسيس
        "institcapa", //عدد الطلاب للعام الماضي
        "datfrom", //يبدأ التجديد الجديد اعتبارًا من عام.
        "renwedate", //ينتهي التجديد الجديد بحلول عام
        "studyear", //يبدأ آخر تجديد اعتبارًا من عام.
        "lastrenw", //ينتهي آخر تجديد بحلول عام.
        "lastcernum", //علما ان اخر تجديد الرقم
        "lastcerdate", //تاريخ اخر تجديد
        //الكروب الثاني
        "UpperNumberValue", //رقم المقام بسط
        "LowerLandNumber", //رقم العقار المقام
        "estatenumber", //رقم العقار
        "Realestatesub", //سلكتر الملاحظية
        "Realestate", //سلكتر المديرية
        "OwnerName", //اذا في حال مملوك للدولة
        "Municipality", //مال البلدية
        "OtherProDetails", //في حال وجود رقم عقار اخر
        //الكروب الثالث
        //مؤسس اول
        "fname",
        "sname",
        "thname",
        "foname",
        "owncer",
        "ownspec",
        "fownphone",
        //مؤسس ثاني
        "namesinv",
        "secondninv",
        "thirdnsinv",
        "fourthnsinv",
        "educationsinv",
        "majorsinv",
        "phonensin",
        //مؤسس ثالث
        "firstntinv",
        "secondnthirdinv",
        "thirdntinv",
        "fourthnfinv",
        "educationtinv",
        "majorthinv",
        "phonethirdinv",
        //مؤسسين اخرين
        "OtherPeopleExist",
        "OtherPersons",
        //معلومات الشركة
        "thecompanyname",
        "regnumber",
        "regdate",
        //معلومات المدير المفوض
        "ceoname",
        "nationalid",
        "address",
        "phoneceo",
        "specialty",
        "studyyy",
        "taxxnum", //الرقم الضريبي مال المؤجر
        "DMSecondName",
        "DMThirdName",
        "istablyear",
      ];

    for (var i = 0; i < All_Progs.length; i++) {
      if (this.form_data[All_Progs[i]] == null) {
        document.getElementById(All_IDs[i]).style.visibility = "collapse";
      }
    }
  }
}
