{
  //تغيير قيم سلكتر التشكيلات النفطية
  var Showed_Values = [
    "الدائرة الادارية والمالية/ شؤون المواطنين",
    "الدائرة الادارية والمالية/ شؤون الموظفين",
    "شركة نفط الشمال",
    "شركة نفط الوسط",
    "شركة نفط البصرة",
    "شركة نفط ذي قار",
    "شركة نفط ميسان",
    "شركة مصافي الشمال",
    "شركة مصافي الوسط",
    "شركة مصافي الجنوب",
    "شركة غاز الشمال",
    "شركة غاز الجنوب",
    "شركة توزيع المنتجات النفطية",
    "الشركة العامة لتعبة وخدمات الغاز",
    "شركة خطوط الانابيب",
    "شركة الاستكشافات النفطية",
    "شركة المشاريع النفطية",
    "شركة تسويق النفط",
    "شركة الحفر العراقية",
    "شركة ناقلات النفط العراقية",
    "الشركة العامة للمعدات الهندسية الثقيلة",
    "معهد التدريب النفطي / بغداد",
    "معهد التدريب النفطي / بصرة",
    "معهد التدريب النفطي / كركوك",
    "معهد التدريب النفطي / بيجي",
    "معهد التدريب النفطي / ميسان",
    "مركز البحث والتطوير",
    "المركز الثقافي النفطي",
  ];

  this.group_of_form[0].fields[5].properties[0].values = Showed_Values;
}
