{
    First_Function(event, Field_Location){
        this.group_of_form[0].fields[Field_Location].properties[0].values = event;
    },

    First_Filter(event){
        var First_Values = [
            "بغداد", "بابل", "البصرة", "ذي قار", "المثنى", "الانبار", "كركوك", "واسط", "كربلاء المقدسة",
            "النجف الاشرف", "القادسية", "صلاح الدين", "ديالى", "نينوى", "ميسان"
        ],//سلكتر المحافظات
        Second_Values = [
            ["الكاظمية", "المحمودية", "ابي غريب", "الطارمية", "المدائن", "الحسينية", "الشعلة", "الزوراء",],//اقضية بغداد
            ["الحلة", "المحاويل", "الهاشمية", "المسيب", "كوثي", "القاسم", "الحمزة الغربي",],//اقضية بابل
            ["البصرة", "ابي الخصيب", "الزبير", "القرنة", "الفاو", "شط العرب", "المدينة", "الامام الصادق",],//اقضية البصرة
            ["الناصرية", "الرفاعي", "الجبايش", "سوق الشيوخ", "الشطرة",],//اقضية ذي قار
            ["السماوة", "الرميثة", "السلمان", "الخضر",],//اقضية المثنى
            ["الرمادي", "هيت", "الفلوجة", "عانة", "حديثة", "القائم", "راوة", "الرطبة",],//اقضية الانبار والصحراء الغربية
            ["كركوك", "الحويجة", "داقوق", "دبس",],//اقضية كركوك
            ["الكوت", "النعمانية", "الحي", "بدرة", "الصويرة", "العزيزية",],//اقضية واسط
            ["كربلاء", "عين تمر", "الهندية",],//اقضية كربلاء
            ["النجف", "الكوفة", "المناذرة",],//اقضية النجف
            ["الديوانية", "عفك", "الشامية", "المهناوية", "الحمزة الشرقي",],//اقضية الديوانية
            ["تكريت", "سامراء", "بيجي", "بلد", "الدور", "الدجيل", "الشرقاط", "طوز خورماتو",],//اقضية صلاح الدين
            ["بعقوبة", "المقدادية", "الخالص", "خانقين", "بلدروز", "كفري",],//اقضية ديالى
            ["الموصل", "الحمدانية", "تلكيف", "تلعفر", "الشيخان", "الحضر", "البعاج", "مخمور",],//اقضية نينوى
            ["العمارة", "علي الغربي", "ميمونة", "قلعة صالح", "المجر", "الكحلاء",],//اقضية ميسان
        ];//سلكتر الاقضية

        this.inputFormField["FirstSelect"] = null;
        for(var i = 0; i < First_Values.length; i++){
            if(event == First_Values[i]){
                this.First_Function(Second_Values[i], 6);
                break;
            }else{
                this.First_Function([], 6);
            }
        }
    },

    Second_Filter(event){
        //سلكتر الاقضية
        var First_Values = [
            //اقضية بغداد
            "الكاظمية", "المحمودية", "ابي غريب", "الطارمية", "المدائن", "الحسينية", "الشعلة", "الزوراء",
            //اقضية بابل
            "الحلة", "المحاويل", "الهاشمية", "المسيب", "كوثي", "القاسم", "الحمزة الغربي",
            //اقضية البصرة
            "البصرة", "ابي الخصيب", "الزبير", "القرنة", "الفاو", "شط العرب", "المدينة", "الامام الصادق",
            //اقضية ذي قار
            "الناصرية", "الرفاعي", "الجبايش", "سوق الشيوخ", "الشطرة",
            //اقضية المثنى
            "السماوة", "الرميثة", "السلمان", "الخضر",
            //اقضية الانبار والصحراء الغربية
            "الرمادي", "هيت", "الفلوجة", "عانة", "حديثة", "القائم", "راوة", "الرطبة",
            //اقضية كركوك
            "كركوك", "الحويجة", "داقوق", "دبس",
            //اقضية واسط
            "الكوت", "النعمانية", "الحي", "بدرة", "الصويرة", "العزيزية",
            //اقضية كربلاء
            "كربلاء", "عين تمر", "الهندية",
            //اقضية النجف
            "النجف", "الكوفة", "المناذرة",
            //اقضية الديوانية
            "الديوانية", "عفك", "الشامية", "المهناوية", "الحمزة الشرقي",
            //اقضية صلاح الدين
            "تكريت", "سامراء", "بيجي", "بلد", "الدور", "الدجيل", "الشرقاط", "طوز خورماتو",
            //اقضية ديالى
            "بعقوبة", "المقدادية", "الخالص", "خانقين", "بلدروز", "كفري",
            //اقضية نينوى
            "الموصل", "الحمدانية", "تلكيف", "تلعفر", "الشيخان", "الحضر", "البعاج", "مخمور",
            //اقضية ميسان
            "العمارة", "علي الغربي", "ميمونة", "قلعة صالح", "المجر", "الكحلاء",
        ],
        //سلكتر الناحية
        Second_Values = [
            //بغداد
            ["التاجي",],//نواحي الكاظمية
            ["مركز قضاء المحمودية", "اليوسفية", "اللطيفية", "الرشيد",],//نواحي المحمودية
            ["مركز قضاء ابي غريب", "النصر والسلام", "عكركوف",],//نواحي ابي غريب
            ["أبو سريويل", "العبايجي", "المشاهدة", "مركز قضاء الطارمية",],//نواحي الطارمية
            ["مركز قضاء المدائن", "الوحدة", "النهروان", "الجسر",],//نواحي المدائن
            ["مركز قضاء الحسينية", "الراشدية",],//نواحي الحسينية
            ["سبع البور",],//نواحي الشعلة
            ["مركز قضاء الزوراء"],//نواحي الزوراء
            //بابل
            ["ابي غرق", "عنانة وبرنون", "الكفل",],//نواحي الحلة
            ["مركز قضاء المحاويل", "الامام", "النيل",],//نواحي المحاويل
            ["مركز قضاء الهاشمية", "الطليعة", "القاسم", "الشوملي",],//نواحي الهاشمية
            ["مركز قضاء المسيب", "سدة الهندية", "جرف النصر", "الإسكندرية", "سوراء", "المعمورة",],//نواحي المسيب
            ["مركز قضاء كوثى",],//نواحي كوثى
            ["الابراهيمية",],//نواحي القاسم
            ["مركز قضاء الحمزة الغربي", "الحصين",],//نواحي الحمزة الغربي
            //البصرة
            ["مركز قضاء البصرة", "المعقل", "الهارثة",],//نواحي البصرة
            ["مركز قضاء ابي الخصيب",],//نواحي ابي الخصيب
            ["مركز قضاء الزبير", "خور الزبير", "ام قصر", "سفوان",],//نواحي الزبير
            ["مركز قضاء القرنة", "الثغر", "الدير",],//نواحي القرنة
            ["مركز قضاء الفاو", "السيبة",],//نواحي الفاو           
            ["مركز قضاء شط العرب", "النشوة",],//نواحي شط العرب
            ["مركز قضاء المدينة", "الهوير (عز الدين سليم)",],//نواحي المدينة
            ["مركز قضاء الامام الصادق",],//نواحي الامام الصادق
            //ذي قار
            ["مركز قضاء الناصرية", "اور", "الإصلاح", "البطحاء", "سيد دخيل",],//نواحي الناصرية
            ["مركز قضاء الرفاعي", "قلعة سكر", "الفجر", "النصر",],//نواحي الرفاعي
            ["مركز قضاء الجبايش", "الفهود", "المنار (الحمّار)",],//نواحي الجبايش
            ["مركز قضاء سوق الشيوخ", "الطار", "الفضيلة", "كرمة بني سعد",],//نواحي سوق الشيوخ
            ["مركز قضاء الشطرة", "بني زيد", "الدواية", "الغراف",],//نواحي الشطرة
            //المثنى
            ["مركز قضاء السماوة",  "السوير",],//نواحي السماوة
            ["مركز قضاء الرميثة", "النجمي", "الهلال", "المجد",],//نواحي الرميثة
            ["بصيصة",],//نواحي السلمان
            ["مركز قضاء الخضر", "الدراجي",],//نواحي الخضر
            //الانبار والصحراء الغربية
            ["مركز قضاء الرمادي", "الحبانية", "الرحالية", "الوفاء",],//نواحي الرمادي
            ["مركز قضاء هيت", "البغدادي", "الفرات",],//نواحي هيت
            ["مركز قضاء الفلوجة", "الكرمة", "العامرية", "الصقلاوية",],//نواحي الفلوجة
            ["مركز قضاء عانة"],//نواحي عانة
            ["مركز قضاء حديثة"],//نواحي حديثة
            ["مركز قضاء القائم"],//نواحي القائم
            ["مركز قضاء راوة"],//نواحي راوة
            ["مركز قضاء الرطبة", "النخيب", "الوليد",],//نواحي الرطبة
            //كركوك
            [
                "مركز قضاء كركوك", "يايجي", "التون كوبري", "الملتقى (ملا عبد الله)", "تازة خورماتو", "ليلان", "شوان",
                "قرة هنجير (الربيع)",
            ],//نواحي كركوك
            ["مركز قضاء الحويجة", "العباسي", "الرياض", "الزاب",],//نواحي الحويجة
            ["مركز قضاء داقوق", "الرشاد",],//نواحي داقوق
            ["مركز قضاء دبس", "سركران",],//نواحي دبس
            //واسط
            ["مركز قضاء الكوت", "واسط", "شيخ سعد",],//نواحي الكوت
            ["مركز قضاء النعمانية", "الاحرار",],//نواحي النعمانية
            ["مركز قضاء الحي", "البشائر", "الموفقية",],//نواحي الحي
            ["مركز قضاء بدرة", "جصان", "الذهب",],//نواحي بدرة
            ["مركز قضاء الصويرة", "الزبيدية", "الشحيمية",],//نواحي الصويرة
            ["مركز قضاء العزيزية", "تاج الدين", "سيد الشهداء", "الدبوني",],//نواحي العزيزية
            //كربلاء المقدسة
            ["مركز قضاء كربلاء", "الحر", "الحسينية",],//نواحي كربلاء
            ["مركز قضاء عين تمر", "الجدول الغربي", "الخيرات",],//نواحي عين تمر
            ["مركز قضاء الهندية",],//نواحي الهندية
            //النجف الاشرف
            ["مركز قضاء النجف", "الحيدرية", "الرضوية",],//نواحي النجف
            ["مركز قضاء الكوفة", "الكوفة", "العباسية", "الحرية",],//نواحي الكوفة
            ["مركز قضاء المناذرة", "الحيرة", "المشخاب", "القادسية",],//نواحي المناذرة
            //الديوانية
            ["مركز قضاء الديوانية", "الدغارة", "السنية", "الشافعية",],//نواحي الديوانية
            ["مركز قضاء عفك", "آل بدير", "سومر", "نفر",],//نواحي عفك
            ["مركز قضاء الشامية", "غماس", "الصلاحية",],//نواحي الشامية
            ["مركز قضاء المهناوية",],//نواحي المهناوية
            ["السدير", "مركز قضاء الحمزة الشرقي"],//نواحي الحمزة الشرقي
            //صلاح الدين
            ["مركز قضاء تكريت", "العلم",],//نواحي تكريت
            ["مركز قضاء سامراء", "دجلة", "المعتصم",],//نواحي سامراء
            ["مركز قضاء بيجي", "الحجاج",],//نواحي بيجي
            ["مركز قضاء بلد", "يثرب", "الضلوعية",],//نواحي بلد
            ["مركز قضاء الدور",],//نواحي الدور
            ["مركز قضاء الدجيل",],//نواحي الدجيل
            ["مركز قضاء الشرقاط",],//نواحي الشرقاط
            ["مركز قضاء طوز خورماتو", "آمرلي", "سليمان بيك",],//نواحي طوز خورماتو
            //ديالى
            ["مركز قضاء بعقوبة", "بني سعد", "بهرز", "العبارة", "محمد سكران",],//نواحي بعقوبة
            ["مركز قضاء المقدادية", "ابي صيدا", "الوجيهية",],//نواحي المقدادية
            ["مركز قضاء الخالص", "هبهب", "سد العظيم", "السلام", "جديدة الشط", "المنصورية",],//نواحي الخالص
            ["مركز قضاء خانقين", "جلولاء", "السعدية",],//نواحي خانقين
            ["مركز قضاء بلدروز", "قزانية", "كنعان", "مندلي",],//نواحي بلدروز
            ["قره تبة", "جبارة",],//نواحي كفري
            ["بعشيقة", "الشورة", "حمام العليل", "القيارة", "المحلبية", "مركز قضاء الموصل", "حميدات",],//نواحي الموصل
            ["مركز قضاء الحمدانية", "النمرود", "برطلة",],//نواحي الحمدانية
            ["مركز قضاء تلكيف", "وانة", "القوش",],//نواحي تلكيف
            ["مركز قضاء تلعفر", "ربيعة", "زمار", "العياضية",],//نواحي تلعفر
            ["زيلكان",],//نواحي الشيخان
            ["مركز قضاء الحضر", ],//نواحي الحضر
            ["مركز قضاء البعاج", ],//نواحي البعاج
            ["مركز قضاء مخمور", "الكوير", "ديبكة", "قراج", "مخمور",],//نواحي مخمور
            //ميسان
            ["مركز قضاء العمارة", "كميت",],//نواحي العمارة
            ["مركز قضاء علي الغربي", "علي الشرقي",],//نواحي علي الغربي
            ["مركز قضاء ميمونة", "السلام", "سيد احمد الرفاعي",],//نواحي ميمونة
            ["مركز قضاء قلعة صالح", "العزيز",],//نواحي قلعة صالح
            ["مركز قضاء المجر", "العدل",],//نواحي المجر
            ["مركز قضاء الكحلاء", "المشرح",],//نواحي الكحلاء
        ];

        this.inputFormField["nahia"] = null;
        for(var i = 0; i < First_Values.length; i++){
            if(event == First_Values[i]){
                this.First_Function(Second_Values[i], 7);
                break;
            }else{
                this.First_Function([], 7);
            }
        }
    },

    Third_Filter(event){
        //سلكتر الناحية
        var First_Values = [
            //بغداد
            "التاجي",//نواحي الكاظمية
            "مركز قضاء المحمودية", "اليوسفية", "اللطيفية", "الرشيد",//نواحي المحمودية
            "مركز قضاء ابي غريب", "النصر والسلام", "عكركوف",//نواحي ابي غريب
            "أبو سريويل", "العبايجي", "المشاهدة", "مركز قضاء الطارمية",//نواحي الطارمية
            "مركز قضاء المدائن", "الوحدة", "النهروان", "الجسر",//نواحي المدائن
            "مركز قضاء الحسينية", "الراشدية",//نواحي الحسينية
            "سبع البور",//نواحي الشعلة
            "مركز قضاء الزوراء",//نواحي الزوراء
            //بابل
            "ابي غرق", "عنانة وبرنون", "الكفل",//نواحي الحلة
            "مركز قضاء المحاويل", "الامام", "النيل",//نواحي المحاويل
            "مركز قضاء الهاشمية", "الطليعة", "القاسم", "الشوملي",//نواحي الهاشمية
            "مركز قضاء المسيب", "سدة الهندية", "جرف النصر", "الإسكندرية", "سوراء", "المعمورة",//نواحي المسيب
            "مركز قضاء كوثى",//نواحي كوثى
            "الابراهيمية",//نواحي القاسم
            "مركز قضاء الحمزة الغربي", "الحصين",//نواحي الحمزة الغربي
            //البصرة
            "مركز قضاء البصرة", "المعقل", "الهارثة",//نواحي البصرة
            "مركز قضاء ابي الخصيب",//نواحي ابي الخصيب
            "مركز قضاء الزبير", "خور الزبير", "ام قصر", "سفوان",//نواحي الزبير
            "مركز قضاء القرنة", "الثغر", "الدير",//نواحي القرنة
            "مركز قضاء الفاو", "السيبة",//نواحي الفاو           
            "مركز قضاء شط العرب", "النشوة",//نواحي شط العرب
            "مركز قضاء المدينة", "الهوير (عز الدين سليم)",//نواحي المدينة
            "مركز قضاء الامام الصادق",//نواحي الامام الصادق
            //ذي قار
            "مركز قضاء الناصرية", "اور", "الإصلاح", "البطحاء", "سيد دخيل",//نواحي الناصرية
            "مركز قضاء الرفاعي", "قلعة سكر", "الفجر", "النصر",//نواحي الرفاعي
            "مركز قضاء الجبايش", "الفهود", "المنار (الحمّار)",//نواحي الجبايش
            "مركز قضاء سوق الشيوخ", "الطار", "الفضيلة", "كرمة بني سعد",//نواحي سوق الشيوخ
            "مركز قضاء الشطرة", "بني زيد", "الدواية", "الغراف",//نواحي الشطرة
            //المثنى
            "مركز قضاء السماوة",  "السوير",//نواحي السماوة
            "مركز قضاء الرميثة", "النجمي", "الهلال", "المجد",//نواحي الرميثة
            "بصيصة",//نواحي السلمان
            "مركز قضاء الخضر", "الدراجي",//نواحي الخضر
            //الانبار والصحراء الغربية
            "مركز قضاء الرمادي", "الحبانية", "الرحالية", "الوفاء",//نواحي الرمادي
            "مركز قضاء هيت", "البغدادي", "الفرات",//نواحي هيت
            "مركز قضاء الفلوجة", "الكرمة", "العامرية", "الصقلاوية",//نواحي الفلوجة
            "مركز قضاء عانة",//نواحي عانة
            "مركز قضاء حديثة",//نواحي حديثة
            "مركز قضاء القائم",//نواحي القائم
            "مركز قضاء راوة",//نواحي راوة
            "مركز قضاء الرطبة", "النخيب", "الوليد",//نواحي الرطبة
            //كركوك
            "مركز قضاء كركوك", "يايجي", "التون كوبري", "الملتقى (ملا عبد الله)", "تازة خورماتو", "ليلان", "شوان",
            "قرة هنجير (الربيع)",//نواحي كركوك
            "مركز قضاء الحويجة", "العباسي", "الرياض", "الزاب",//نواحي الحويجة
            "مركز قضاء داقوق", "الرشاد",//نواحي داقوق
            "مركز قضاء دبس", "سركران",//نواحي دبس
            //واسط
            "مركز قضاء الكوت", "واسط", "شيخ سعد",//نواحي الكوت
            "مركز قضاء النعمانية", "الاحرار",//نواحي النعمانية
            "مركز قضاء الحي", "البشائر", "الموفقية",//نواحي الحي
            "مركز قضاء بدرة", "جصان", "الذهب",//نواحي بدرة
            "مركز قضاء الصويرة", "الزبيدية", "الشحيمية",//نواحي الصويرة
            "مركز قضاء العزيزية", "تاج الدين", "سيد الشهداء", "الدبوني",//نواحي العزيزية
            //كربلاء المقدسة
            "مركز قضاء كربلاء", "الحر", "الحسينية",//نواحي كربلاء
            "مركز قضاء عين تمر", "الجدول الغربي", "الخيرات",//نواحي عين تمر
            "مركز قضاء الهندية",//نواحي الهندية
            //النجف الاشرف
            "مركز قضاء النجف", "الحيدرية", "الرضوية",//نواحي النجف
            "مركز قضاء الكوفة", "الكوفة", "العباسية", "الحرية",//نواحي الكوفة
            "مركز قضاء المناذرة", "الحيرة", "المشخاب", "القادسية",//نواحي المناذرة
            //الديوانية
            "مركز قضاء الديوانية", "الدغارة", "السنية", "الشافعية",//نواحي الديوانية
            "مركز قضاء عفك", "آل بدير", "سومر", "نفر",//نواحي عفك
            "مركز قضاء الشامية", "غماس", "الصلاحية",//نواحي الشامية
            "مركز قضاء المهناوية",//نواحي المهناوية
            "السدير", "مركز قضاء الحمزة الشرقي",//نواحي الحمزة الشرقي
            //صلاح الدين
            "مركز قضاء تكريت", "العلم",//نواحي تكريت
            "مركز قضاء سامراء", "دجلة", "المعتصم",//نواحي سامراء
            "مركز قضاء بيجي", "الحجاج",//نواحي بيجي
            "مركز قضاء بلد", "يثرب", "الضلوعية",//نواحي بلد
            "مركز قضاء الدور",//نواحي الدور
            "مركز قضاء الدجيل",//نواحي الدجيل
            "مركز قضاء الشرقاط",//نواحي الشرقاط
            "مركز قضاء طوز خورماتو", "آمرلي", "سليمان بيك",//نواحي طوز خورماتو
            //ديالى
            "مركز قضاء بعقوبة", "بني سعد", "بهرز", "العبارة", "محمد سكران",//نواحي بعقوبة
            "مركز قضاء المقدادية", "ابي صيدا", "الوجيهية",//نواحي المقدادية
            "مركز قضاء الخالص", "هبهب", "سد العظيم", "السلام", "جديدة الشط", "المنصورية",//نواحي الخالص
            "مركز قضاء خانقين", "جلولاء", "السعدية",//نواحي خانقين
            "مركز قضاء بلدروز", "قزانية", "كنعان", "مندلي",//نواحي بلدروز
            "قره تبة", "جبارة",//نواحي كفري
            "بعشيقة", "الشورة", "حمام العليل", "القيارة", "المحلبية", "مركز قضاء الموصل", "حميدات",//نواحي الموصل
            "مركز قضاء الحمدانية", "النمرود", "برطلة",//نواحي الحمدانية
            "مركز قضاء تلكيف", "وانة", "القوش",//نواحي تلكيف
            "مركز قضاء تلعفر", "ربيعة", "زمار", "العياضية",//نواحي تلعفر
            "زيلكان",//نواحي الشيخان
            "مركز قضاء الحضر",//نواحي الحضر
            "مركز قضاء البعاج",//نواحي البعاج
            "مركز قضاء مخمور", "الكوير", "ديبكة", "قراج", "مخمور",//نواحي مخمور
            //ميسان
            "مركز قضاء العمارة", "كميت",//نواحي العمارة
            "مركز قضاء علي الغربي", "علي الشرقي",//نواحي علي الغربي
            "مركز قضاء ميمونة", "السلام", "سيد احمد الرفاعي",//نواحي ميمونة
            "مركز قضاء قلعة صالح", "العزيز",//نواحي قلعة صالح
            "مركز قضاء المجر", "العدل",//نواحي المجر
            "مركز قضاء الكحلاء", "المشرح",//نواحي الكحلاء
        ],
        //سلكتر مراكز الماء
        Second_Values = [
            //بغداد
            ["مركز ماء التاجي", "مركز ماء قرى التاجي",],//مراكز التاجي
            ["مركز ماء المحمودية",],//مراكز مركز قضاء المحموديه
            ["مركز ماء اليوسفية",],//مراكز اليوسفية
            ["مركز ماء اللطيفية",],//مراكز اللطيفية
            ["مركز ماء الرشيد",],//مراكز الرشيد
            ["مركز ماء ابي غريب",],//مراكز مركز قضاء ابي غريب
            ["مركز ماء النصر والسلام", "مركز ماء بوابة السلام",],//مراكز النصر والسلام
            ["مركز ماء عكركوف",],//مراكز عكركوف
            ["مركز ماء شيخ حمد",],//مراكز أبو سريويل
            ["مركز ماء العبايجي",],//مراكز العبايجي
            ["مركز ماء المشاهدة",],//مراكز المشاهدة
            ["مركز ماء الطارمية",],//مراكز مركز قضاء الطارمية
            ["مركز ماء المدائن",],//مراكز مركز قضاء المدائن
            ["مركز ماء الوحدة",],//مراكز الوحدة
            ["مركز ماء النهروان",],//مراكز النهروان
            ["مركز ماء الجسر",],//مراكز الجسر
            ["مركز ماء الحسينية",],//مراكز مركز قضاء الحسينية
            ["مركز ماء الراشدية",],//مراكز الراشدية
            ["مركز ماء سبع البور",],//مراكز سبع البور
            ["مركز ماء الزوراء",],//مراكز مركز قضاء الزوراء
            //بابل
            ["مركز ماء ابي غرق",],//مراكز ابي غرق
            ["مركز ماء عنانة وبرنون",],//مراكز عنانة وبرنون
            ["مركز ماء الكفل",],//مراكز الكفل
            ["مركز ماء المحاويل",],//مراكز مركز قضاء المحاويل
            ["مركز ماء الامام",],//مراكز الامام
            ["مركز ماء النيل",],//مراكز النيل
            ["مركز ماء الهاشمية",],//مراكز مركز قضاء الهاشمية
            ["مركز ماء سيد الطليعة",],//مراكز الطليعة
            ["مركز ماء القاسم",],//مراكز القاسم
            ["مركز ماء الشوملي",],//مراكز الشوملي
            ["مركز ماء المسيب",],//مراكز مركز قضاء المسيب
            ["مركز ماء السدة",],//مراكز سدة الهندية
            ["مركز ماء جرف النصر",],//مراكز جرف النصر
            ["مركز ماء الاسكندرية",],//مراكز الاسكندرية
            ["مركز ماء سوراء",],//مراكز سوراء
            ["مركز ماء المعميرة",],//مراكز المعمورة
            ["مركز ماء كوني",],//مراكز مركز قضاء كوثى
            ["مركز ماء الابراهيمية",],//مراكز الابراهميمية
            ["مركز ماء الحمزة الغربي",],//مراكز مركز قضاء الحمزة الغربي
            ["مركز ماء الحصين",],//مراكز الحصين
            //البصرة
            [
                "مركز جباية البصرة", "مركز جباية العشار", "مركز جباية الخليج العربي", "مركز جباية القبلة",
                "مركز جباية الجنينة", "مركز جباية الجمهورية",
            ],//مراكز مركز قضاء البصرة
            ["مركز جباية المعقل",],//مراكز المعقل
            ["مركز جباية الهارثه",],//مراكز الهارثة
            ["مركز جباية ابي الخصيب",],//مراكز مركز قضاء ابي الخصيب
            ["مركز جباية الزبير",],//مراكز الزبير
            ["مركز جباية خور الزبير",],//مراكز خور الزبير
            ["مركز جباية ام قصر",],//مراكز ام قصر
            ["مركز جباية سفوان",],//مراكز سفوان
            ["مركز جباية القرنه",],//مراكز مركز قضاء القرنة
            ["مركز جباية الثغر",],//مراكز الثغر
            ["مركز جباية الدير",],//مراكز الدير
            ["مركز جباية الفاو",],//مراكز مركز قضاء الفاو
            ["مركز جباية السيبه",],//مراكز السيبة
            ["مركز جباية شط العرب",],//مراكز مركز قضاء شط العرب
            ["مركز جباية النشوة",],//مراكز النشوة
            ["مركز جباية المدينه",],//مراكز مركز قضاء المدينة
            ["مركز جباية الهوير",],//مراكز الهوير (عز الدين سليم)
            ["مركز جباية قضاء الامام الصادق",],//مراكز القضاء
            //ذي قار
            ["الناصرية",],//مراكز مركز قضاء الناصرية
            ["اور",],//مراكز اور
            ["الاصلاح",],//مراكز الاصلاح
            ["البطحاء",],//مراكز البطحاء
            ["سيد دخيل",],//مراكز سيد دخيل
            ["الرفاعي",],//مراكز مركز قضاء الرفاعي
            ["قلعة سكر",],//مراكز قلعة سكر
            ["الفجر",],//مراكز الفجر
            ["النصر",],//مراكز النصر
            ["الجبايش",],//مراكز مركز قضاء الجبايش
            ["الفهود",],//مراكز الفهود
            ["المنار",],//مراكز المنار
            ["سوق الشيوخ",],//مراكز مركز قضاء سوق الشيوخ
            ["الطار العكيكه",],//مراكز الطار العكيكة
            ["الفضليه",],//مراكز الفضيلة
            ["كرمة بني سعد",],//مراكز كرمة بني سععد
            ["الشطرة",],//مراكز مركز قضاء الشطرة
            ["بني زيد",],//مراكز بني زيد
            ["الدواية",],//مراكز الدواية
            ["الغراف",],//مراكز الغراف
            //المثنى
            ["مركز تشغيل وجباية السماوة",],//مراكز مركز قضاء السماوه
            ["مركز تشغيل وجباية السوير",],//مراكز السوير
            ["مركز تشغيل وجباية الرميثه",],//مراكز مركز قضاء الرمينة
            ["مركز تشغيل وجباية النجمي",],//مراكز النجمي
            ["مركز تشغيل وجباية الهلال",],//مراكز الهلال
            ["مركز تشغيل وجباية المجد",],//مراكز المجد
            ["مركز تشغيل وجباية السلمان وبصيه",],//مراكز السلمان
            ["مركز تشغيل وجباية الخضر",],//مراكز مركز قضاء الخضر
            ["مركز تشغيل وجباية الدراجي",],//مراكز الدراجي
            //الانبار
            ["مركز ماء الرمادي", "مركز ماء ابو طيبان",],//مراكز مركز قضاء الرمادي
            ["مركز ماء الحبانية",],//مراكز الحبانية
            ["مركز ماء الرحالية",],//مراكز الرحالية
            ["مركز ماء الوفاء",],//مراكز الوفاء
            ["مركز ماء هيت",],//مراكز مركز قضاء هيت
            ["مركز ماء البغدادي",],//مراكز البغداد
            ["مركز ماء الفرات",],//مراكز الفرات
            ["مركز ماء الفلوجة",],//مراكز مركز قضاء الفلوجة
            ["مركز ماء الكرمة",],//مراكز الكرمة
            ["مركز ماء العامرية",],//مراكز العامرية
            ["مركز ماء الصقلاوية",],//مراكز الصقلاوية
            ["مركز ماء عنه",],//مراكز مركز قضاء عانة
            ["مركز ماء حديثة",],//مراكز مركز قضاء حديثنة
            ["مركز ماء القائم",],//مراكز مركز قضاء القائم
            ["مركز ماء راوة",],//مراكز مركز ماء راوة
            ["مركز ماء الرطبة",],//مراكز مركز قضاء ماء الرطبة
            ["مركز ماء النخيب",],//مراكز النخيب
            ["مركز ماء طريبيل", "مركز ماء الوليد", "مركز ماء عكاشات",],//مراكز الوليد
            //كركوك
            ["مركز ماء قضاء كركوك",],//مراكز مركز قضاء كركوك
            ["مركز ماء يايجي",],//مراكز يايجي
            ["مركز ماء التون كوبري",],//مراكز التون كوبري
            ["مركز ماء الملتقى (ملا عبد الله)",],//مراكز الملتقى (ملا عبد الله)
            ["مركز ماء تازة خورماتو",],//مراكز تازة خورماتو
            ["مركز ماء ليلان",],//مراكز ليلان
            ["مركز ماء شوان",],//مراكز شوان
            ["مركز ماء قرة هنجير(الربيع)",],//مراكز قرة هنجير
            ["مركز ماء قضاء الحويجة",],//مركز قضاء الحويجة
            ["مركز ماء العباسي",],//مراكز العباسي
            ["مركز ماء الرياض",],//مراكز الرياض
            ["مركز ماء الزاب",],//مراكز الزاب
            ["مركز ماء قضاء داقوق",],//مراكز مركز قضاء داقوق
            ["مركز ماء الرشاد",],//مراكز الرشاد
            ["مركز ماء قضاء الدبس",],//مراكز مركز قضاء دبس
            ["مركز ماء سكران",],//مراكز سكران
            //واسط
            ["مركز ماء الكوت", "مركز ماء حي الجهاد",],//مراكز مركز قضاء الكوت
            ["مركز ماء ناحية واسط",],//مراكز واسط
            ["مركز ماء شيخ سعد",],//مراكز شيخ سعد
            ["مركز ماء النعمانية",],//مراكز مركز قضاء النعمانية
            ["مركز ماء الاحرار",],//مراكز الاحرار
            ["مركز ماء الحي",],//مراكز مركز قضاء الحي
            ["مركز ماء البشائر",],//مراكز البشائر
            ["مركز ماء الموفقية",],//مراكز الموفقية
            ["مركز ماء بدرة",],//مراكز مركز قضاء بدرة
            ["مركز ماء جصان",],//مراكز جصان
            ["مركز ماء زرباطية",],//مراكز الذهب
            ["مركز ماء الصويرة",],//مراكز مركز قضاء الصويرة
            ["مركز ماء الزبيدية",],//مراكز الزبيدية
            ["مركز ماء الشحيمية",],//مراكز الشحيمية
            ["مركز ماء العزيزية",],//مراكز مركز قضاء العزيزية
            ["مركز ماء تاج الدين",],//مراكز تاج الدين
            ["مركز ماء سيد الشهداء",],//مراكز سيد الشهداء
            ["مركز ماء الدبوني",],//مراكز الدبوني
            //كربلاء المقدسة
            ["مركز رقم (1) / مقر المديرية", "مركز رقم (3) / باب بغداد",],//مراكز مركز قضاء كربلاء
            ["مركز الحر",],//مراكز الحر
            ["مركز الحسينية",],//مراكز الحسينية
            ["مركز عين التمر",],//مراكز مركز قضاء عين التمر
            ["مركز الجدول الغربي",],//مراكز الجدول الغربي
            ["مركز الخيرات",],//مراكز الخيرات
            ["مركز الهندية",],//مراكز مركز قضاء الهندية
            //النجف الاشرف
            ["مركز ماء جنوبي", "مركز ماء وسط", "مركز ماء شمالي",],//مراكز مركز قضاء النجف
            ["مركز ماء حيدرية",],//مراكز الحيدرية
            ["مركز ماء رضوية",],//مراكز الرضوية
            ["مركز ماء كوفة",],//مراكز مركز قضاء الكوفة
            ["مركز ماء ميسان", "مركز ماء براكية",],//مراكز الكوفة
            ["مركز ماء عباسية",],//مراكز العباسية
            ["مركز ماء حرية",],//مراكز الحرية
            ["مركز ماء مناذرة",],//مراكز المناذرة
            ["مركز ماء حيرة",],//مراكز الحيرة
            ["مركز ماء مشخاب",],//مراكز المشخاب
            ["مركز ماء قادسية",],//مراكز القادسية
            //الديوانية
            ["الديوانية",],//مراكز مركز قضاء الديوانية
            ["الدغارة",],//مراكز الدغارة
            ["السنية",],//مراكز السنية
            ["الشافعية",],//مراكز الشافعية
            ["عفك",],//مراكز مركز قضاء عفك
            ["آل بدير",],//مراكز ال بدير
            ["سومر",],//مراكز سومر
            ["نفر",],//مراكز نفر
            ["الشامية",],//مراكز مركز قضاء الشامية
            ["غماس",],//مراكز غماس
            ["الصلاحية",],//مراكز الصلاحية
            ["المهناوية",],//مراكز مركز قضاء المهناوية
            ["السدير",],//مراكز السدير
            ["الحمزة الشرقي",],//مراكز مركز قضاء الحمزة الشرقي
            //صلاح الدين
            ["مركز ماء تكريت",],//مراكز قضاء تكريت
            ["مركز ماء العلم",],//مراكز العلم
            ["مركز ماء سامراء",],//مراكز مركز قضاء سامراء
            ["مركز ماء دجلة",],//مراكز دجلة
            ["مركز ماء المعتصم والنهرين",],//مراكز المعتصم
            ["مركز ماء بيجي",],//مراكز مركز قضاء بيجي
            ["مركز ماء الحجاج",],//مراكز الحجاج
            ["مركز ماء بلد",],//مراكز مركز قضاء بلد
            ["مركز ماء يثرب", "مركز ماء الاسحاقي",],//مراكز يثرب
            ["مركز ماء الضلوعية",],//مراكز الضلوعية
            ["مركز ماء الدور",],//مراكز الدور
            ["مركز ماء الدجيل",],//مراكز الدجيل
            ["مركز ماء الشرقاط", "مركز ماء اشور",],//مراكز مركز قضاء الشرقاط
            ["مركز ماء الطوز",],//مراكز مركز قضاء طوز خورماتو
            ["مركز ماء امرلي",],//مراكز امرلي
            ["مركز ماء سليمان بيك",],//مراكز سليمان بيك
            //ديالى
            ["مركز ماء بعقوبة الشرقي", "مركز ماء بعقوبة الغربي",],//مراكز مركز قضاء بعقوبة
            ["مركز ماء بني سعد",],//مراكز بني سعدء
            ["مركز ماء بهرز",],//مراكز بهرز
            ["مركز ماء العبارة",],//مراكز العبارة
            ["مركز ماء محمد سكران",],//مراكز محمد سكران
            ["مركز ماء المقدادية",],//مراكز مركز قضاء المقدادية
            ["مركز ماء ابي صيدا",],//مراكز ابي صيدا
            ["مركز ماء الوجيهية",],//مراكز الوجيهية
            ["مركز ماء الخالص",],//مراكز مركز قضاء الخالص
            ["مركز ماء هبهب",],//مراكز هبهب
            ["مركز ماء السد العظيم",],//مراكز السد العظيم
            ["مركز ماء السلام",],//مراكز السلام
            ["مركز ماء جديدة الشط",],//مراكز جديدة الشط
            ["مركز ماء المنصورية",],//مركز المنصورية
            ["مركز ماء خانقين",],//مراكز مركز قضاء خانقين
            ["مركز ماء جلولاء",],//مراكز جلولاء
            ["مركز ماء السعدية",],//مراكز السعدية
            ["مركز ماء بلدروز",],//مراكز مركز قضاء بلدروز
            ["مركز ماء قزانية",],//مراكز قزانية
            ["مركز ماء كنعان",],//مراكز كنعان
            ["مركز ماء مندلي",],//مراكز مندلي
            ["مركز ماء قره تبة",],//مراكز قره تبه
            ["مركز ماء جبارة",],//مراكز جبارة
            //نينوى
            ["مركز ماء بعشيقة",],//مراكز بعشيقة
            ["مركز ماء الشورى",],//مراكز الشورة
            ["مركز ماء حمام العليل", "مركز ماء سنحاريب",],//مراكز حمام العليل
            ["مركز ماء قيارة",],//مراكز القيارة
            ["مركز ماء المحلبية",],//مراكز المحلبية
            ["مركز ماء الغزلاني", "مركز ماء الرشيدية", "مركز ماء الايسر القديم",],//مراكز مركز قضاء الموصل
            ["مركز ماء حميدات",],//مراكز حميدات
            ["مركز ماء الحمدانية",],//مراكز مركز قضاء الحمدانية
            ["مركز ماء نمرود",],//مراكز نمرود
            ["مركز ماء باشبيتا", "مركز ماء برطلة",],//مراكز برطلة
            ["مركز ماء تلكيف",],//مراكز مركز قضاء تلكيف
            ["مركز ماء وانة",],//مراكز وانة
            ["مركز ماء القوش",],//مراكز القوش
            ["مركز ماء تلعفر",],//مراكز قضاء تلعفر
            ["مركز ماء ربيعة",],//مراكز ربيعة
            ["مركز ماء زمار",],//مراكز زمار
            ["مركز ماء العياضبة", "مركز ماء قره الجزيرة",],//مراكز العياضية
            ["مركز ماء زيلكان",],//مراكز زيلكان
            ["مركز ماء الحضر",],//مراكز مركز قضاء الحضر
            ["مركز ماء بعاج",],//مراكز مركز قضاء البعاج
            ["مركز ماء مخمور",],//مراكز مركز قضاء مخمور
            ["مركز ماء الكوير",],//مراكز الكوير
            ["مركز ماء ديبكة",],//مراكز ديبكة
            ["مركز ماء قراج",],//مراكز قراج
            ["مركز ماء حاج علي",],//مراكز مخحمور
            //ميسان
            ["مركز تشغيل وجباية قضاء العمارة",],//مراكز مركز قضاء العمارة
            ["مركز تشغيل وجباية الكميت",],//مراكز كميت
            ["مركز تشغيل وجباية علي الغربي",],//مراكز مركز قضاء علي الغربي
            ["مركز تشغيل وجباية علي الشرقي",],//مراكز علي الشرقي
            ["مركز تشغيل وجباية الميمونه",],//مراكز مركز قضاء ميمونة
            ["مركز تشغيل وجباية السلام",],//مراكز السلام
            ["مركز تشغيل وجباية سيد احمد الرفاعي",],//مراكز سيد احمد الرفاعي
            ["مركز تشغيل وجباية قلعة صالح",],//مراكز مركز قضاء قلعة صالح
            ["مركز تشغيل وجباية العزير",],//مراكز العزيز
            ["مركز تشغيل وجباية المجر",],//مراكز مركز قضاء المجر
            ["مركز تشغيل وجباية العدل",],//مراكز العدل
            ["مركز تشغيل وجباية الكحلاء",],//مراكز مركز قضاء الكحلاء
            ["مركز تشغيل وجباية المشرف"],//مراكز المشرح
        ];

        this.inputFormField["centre"] = null;
        for(var i = 0; i < First_Values.length; i++){
            if(event == First_Values[i]){
                this.First_Function(Second_Values[i], 8);
                break;
            }else{
                this.First_Function([], 8);
            }
        }
    },
}