{
    //اختر نوع التسجيل
    First_Hide(event){
        var Progs = [
            //مجموعة استمارة ترشيح للبرامج التدريبية
            "Sectors", //اختر نوع القطاع
            "firstname", //الاسم الاول
            "secondname", //الاسم الثاني
            "thirdname", //الاسم الثالث
            "phone", //رقم الهاتف
            "study", //التحصيل الدراسي
            "email", //البريد الالكتروني
            "certificate", //في حال اجتيازك للدورة بنجاح هل ترغب في الحصول على شهادة جدارية ؟
            "pay", //المبلغ المدفوع غير قابل للاسترجاع ، الا في حال تعذر انعقاد الدورة

            //مجموعة التسجیل للحصول على شھادة جداریة للدورات والورش السابقة
            "namef", //الاسم
            "names", //اسم الاب
            "namet", //اسم الجد
            "SectorType", //نوع القطاع
            "Trainingprogram", //اسم البرنامج التدریبي ( الدورة او الورشة ) / داخل او خارج الخطة
            "workshop", //بدء البرنامج التدریبي ( الدورة او الورشة )
            "workshopdate", //انتھاء البرنامج التدریبي ( الدورة او الورشة)
        ];

        //تصفير الحقول من المحتوى
        for(var i = 0; i < Progs.length; i++){
            this.inputFormField[Progs[i]] = null;
        }

        //--------------------------------------------------------------------------------------------------
        //اظهار واخفاء الكروبات
        if(event == "تسجيل جديد"){
            //مجموعة استمارة ترشيح للبرامج التدريبية
            document.getElementById("22935_group").style.display = "block";

            //مجموعة التسجیل للحصول على شھادة جداریة للدورات والورش السابقة
            document.getElementById("33609_group").style.display = "none";

            //مجموعة استمارة ترشيح للبرامج التدريبية
            this.inputFormField.firstname = this.user.first_name;
            document.getElementsByName("firstname")[0].disabled = true; //الاسم الاول

            this.inputFormField.secondname = this.user.middle_name;
            document.getElementsByName("secondname")[0].disabled = true; //الاسم الثاني

            this.inputFormField.thirdname = this.user.last_name;
            document.getElementsByName("thirdname")[0].disabled = true; //الاسم الثالث

            this.inputFormField.phone = this.user.phone_num;
            document.getElementsByName("phone")[0].disabled = true; //رقم الهاتف
        }else if(event == "التسجیل للحصول على شھادة جداریة للدورات والورش السابقة"){
            //مجموعة استمارة ترشيح للبرامج التدريبية
            document.getElementById("22935_group").style.display = "none";

            //مجموعة التسجیل للحصول على شھادة جداریة للدورات والورش السابقة
            document.getElementById("33609_group").style.display = "block";

            //مجموعة التسجیل للحصول على شھادة جداریة للدورات والورش السابقة
            this.inputFormField.namef = this.user.first_name;
            document.getElementsByName("namef")[0].disabled = true; //الاسم الاول

            this.inputFormField.names = this.user.middle_name;
            document.getElementsByName("names")[0].disabled = true; //الاسم الثاني

            this.inputFormField.namet = this.user.last_name;
            document.getElementsByName("namet")[0].disabled = true; //الاسم الثالث

            //علماً ان اجور الحصول على الشھادة الجداریة تبلغ ( ۳٥،۰۰۰ ) خمسة وثلاثون الف دینار عراقي
            document.getElementById("53729").style.cssText =
                "color: #4f0303; font-size: 18px; font-weight: bold; padding-top: 15px; padding-bottom: 15px; text-align: center;";
        }else{
            //مجموعة استمارة ترشيح للبرامج التدريبية
            document.getElementById("22935_group").style.display = "none";

            //مجموعة التسجیل للحصول على شھادة جداریة للدورات والورش السابقة
            document.getElementById("33609_group").style.display = "none";
        }

        //--------------------------------------------------------------------------------------------------
        //يظهرلي حقل المحافظة
        this.inputFormField["Governorate"] = null;
        if(event){
            document.getElementById("67855").style.display = "block";
        }else{
            document.getElementById("67855").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------
    Second_Hide(event){
        //يظهرلي حقل محور الدورات ويفلتره على اساس المحافظة
        this.inputFormField["Axis"] = null;
        if(event){
            document.getElementById("67854").style.display = "block"; //محور الدورات
        }else{
            document.getElementById("67854").style.display = "none";
        }

        //--------------------------------------------------------------------------------------------------
        //يفلتر حقل محور الدورات
        this.inputFormField["Axis"] = null; //محور الدورات
        if(event == "الديوانية"){
            this.group_of_form[0].fields[2].properties[0].values = ["اداري",];
        }else{
            this.group_of_form[0].fields[2].properties[0].values = ["تقني", "اداري",];
        }
    },

    //-----------------------------------------------------------------------------------------------------
    Third_Hide(event){
        //يفلتر حقل مدة الدورة
        this.inputFormField["courseduration"] = null; //مدة الدورة
        var Gover_Values = [
            //اللوب مال الاداري يفتر على كل المحافظات هذني
            //اللوب مال التقني راح يكون لحد اصغر من 3 لان الديوانية مابيها تقني
            "بغداد", "البصرة", "الموصل", "الديوانية"
        ],
        First_Type_Values = [
            //بغداد تقني
            ["ثلاثة ايام", "اسبوع", "أسبوعان",],
            //البصرة تقني
            ["اسبوع", "أسبوعان"],
            //الموصل تقني
            ["اسبوع", "أسبوعان",],
        ],
        Second_Type_Values = [
            //بغداد اداري
            ["ثلاثة ايام", "اسبوع", "أسبوعان", "أربعة اسابيع"],
            //البصرة اداري
            ["اسبوع", "أسبوعان", "أربعة اسابيع",],
            //الموصل اداري
            ["ثلاثة ايام", "اسبوع", "أسبوعان",],
            //الديوانية اداري
            ["اسبوع", "أسبوعان", "أربعة اسابيع",],
        ];

        if(event == "تقني"){
            for(var i = 0; i <Gover_Values.length; i++){
                if(i < 3){
                    if(this.inputFormField.Governorate == Gover_Values[i]){
                        this.group_of_form[1].fields[1].properties[0].values = First_Type_Values[i];
                        break;
                    }else{
                        this.group_of_form[1].fields[1].properties[0].values = [];
                    }
                }
            }
        }else if(event == "اداري"){
            for(var i = 0; i <Gover_Values.length; i++){
                if(this.inputFormField.Governorate == Gover_Values[i]){
                    this.group_of_form[1].fields[1].properties[0].values = Second_Type_Values[i];
                    break;
                }else{
                    this.group_of_form[1].fields[1].properties[0].values = [];
                }
            }
        }else{
            this.group_of_form[1].fields[1].properties[0].values = [];
        }

        //--------------------------------------------------------------------------------------------------
        //يظهر حقل مدة الدورة
        if(event){
            document.getElementById("69583").style.display = "block";
        }else{
            document.getElementById("69583").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------
    //مجموعة استمارة ترشيح للبرامج التدريبية
    Fourth_Hide(event){
        var Fields_ID = [
            "48096", //الوزارة
            "47830", // اسم الدائرة
            "47831", //العنوان الوظيفي
            "47834", //سنوات الخدمة
            "51521", //الدرجة الوظيفية
        ],
        Progs = [
            "ministryNamee", //الوزارة
            "OrgName", //اسم الدائرة
            "jobName", //العنوان الوظيفي
            "yearsNumber", //سنوات الخدمة
            "Jobgrade", //الدرجة الوظيفية
        ];

        for(var i = 0; i < Progs.length; i++){
            this.inputFormField[Progs[i]] = null;
        }

        if(event == "القطاع العام"){
            for(var i = 0; i < Fields_ID.length; i++){
                document.getElementById(Fields_ID[i]).style.display = "block";
            }
        }else{
            for(var i = 0; i < Fields_ID.length; i++){
                document.getElementById(Fields_ID[i]).style.display = "none";
            }
        }
    },

    //-----------------------------------------------------------------------------------------------------
    //مجموعة تسجيل جديد
    Fifth_Hide(event){
        if(event == "نعم"){
            //علماً ان اجور الحصول على الشهادة الجدارية تبلغ ( ۳٥،۰۰۰ ) خمسة وثلاثون الف دينار عراقي عدا اجور الدورة
            document.getElementById("53184").style.display = "block";

            document.getElementById("53184").style.cssText =
                "color: #be0707; font-size: 17px; font-weight: bold; padding-top: 15px; padding-bottom: 15px; text-align: center;";
        }else{
            document.getElementById("53184").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------
    //فلترة الدورات
    Sixth_Hide(event){
        //اظهار سلكتر الدورات وتفريغه
        this.inputFormField["trainingcourses"] = null;
        if(event){
            document.getElementById("74339").style.display = "block";
        }else{
            document.getElementById("74339").style.display = "none";
        }

        var Showed_Values = [
            //بغداد اداري 3 ايام
            [
                "ورشة مهارات التحقيق الاداري واللجان التحقيقية", "أساليب فض النزاعات بطرق غير قضائية",
                "تعزيز النزاهة والحوكمة للحد من الفساد الإداري والمالي", "مكافحة التطرف العنيف",
            ],
            //بغداد اداري اسبوع
            [
                "تأهيل وتطوير القادة الإداريين/ متخصصة في الاقتصاد والإدارة المالية",
                "تأهيل وتطوير القادة الإداريين/ متخصصة في إدارة المعرفة",
                "القيادة الاستراتيجية الذكية والمهارات الرقمية لمعاوني المديرين العامين",
                "إدارة الاجتماعات وكتابة محاضر الاجتماعات الرسمية",
                "مهارات إعداد وكتابة المخاطبات الرسمية",
                "الكتابة الحكومية الذكية (Smart Correspondence) صياغة احترافية- تقارير تحليلية – مراسلات استراتيجية",
                "النظام المحاسبي الحكومي الموحد", "السلف والامانات وألية السيطرة المحاسبية عليها",
                "اعداد وثيقة موازنة البرامج والاداء", "النظام المحاسبي الحكومي اللامركزي",
                "ادارة المخاطر المالية في المؤسسات الحكومية", "الرقابة والتدقيق المحاسبي",
                "الرقابة والتدقيق الإداري", "الرقابة والتدقيق الخاص بالعقود", "الرقابة والتدقيق الخاص بالمخازن",
                "إعداد الحقائب التدريبية وتحليل الاحتياجات", "تصميم المناهج التدريبية وفق اطار (ILO-ADDIE-Kirkpatrick 2.0)",
                "تطوير مهارات الموظفين", "تحليل وتوصيف الوظائف الحكومية",
                "إدارة الموارد البشرية الحديثة في القطاع العام", "تقييم أداء العاملين وإدارة الجدارات",
                "تحليل الوظائف و اعادة الهندسة التنظيمية (Re-engineering)",
                "مذكرات التفاهم والاتفاقات والمهارات التفاوضية", "إدارة الازمات والجاهزية المؤسسية",
                "الأسس والمفاهيم الإدارية والمالية الحديثة", "الأسس والمفاهيم الإدارية الحديثة/ أساسية",
                "سلامة اللغة العربية في المخاطبات الرسمية", "تعريفية خاصة بالموظفين الجدد",
                "سلامة اللغة العربية في المخاطبات الرسمية", "المهارات المتكاملة في كتابة التقارير والمراسلات",
                "المواصفة القياسية الدولية الخاصة بنظام ادارة الجودة وفق ISO 9001:2015 مع تطبيقات عملية",
                "إعداد مدقق داخلي للمواصفة القياسية الدولية ISO 9001:2015 لنظام إدارة الجودة.",
                "إعداد مدقق داخلي للمواصفة القياسية الدولية ISO 45001:2018 لنظام إدارة الصحة والسلامة المهنية.",
                "إعداد مدقق داخلي للمواصفة القياسية الدولية ISO 14001:2015 لنظام إدارة البيئة.",
                "إعداد مدقق داخلي للمواصفة القياسية الدولية ISO 50001:2018 لنظام إدارة الطاقة.",
                "دورة تطبيقية عن المواصفة الارشادية لنظام إدارة المخاطر ISO 31000:2018.",
                "إعداد مدقق داخلي للمواصفة القياسية الدولية ISO 27001:2022 لنظام إدارة امن المعلومات.",
                "إعداد مدقق داخلي للمواصفة القياسية الدولية ISO 37001:2016 لنظام إدارة مكافحة الرشوة.",
                "إعداد مدقق داخلي لنظام الإدارة المتكامل (IMS) (ISO 9001+ISO 14001+ISO 45001).",
                "ادارة المخاطر وفق المواصفة الاسترشادية ISO 31000:2015 مع تطبيقات عملية",
                "الحوكمة الرشيدة ومكافحة الفساد الإداري والمالي",
                "الوثائق القياسية (وثيقة الأشغال (كبيرة -متوسطة - صغيرة))", "الوثائق القياسية (وثيقة الخدمات الاستشارية)",
                "الية التعامل مع المقاولين المخلين وتسوية النزاعات",
                "الوثائق القياسية (وثيقة التجهيز - وثيقة الخدمات غير الاستشارية)", "لجان الفتح والتحليل وطرق الاستكمال",
                "أوامر الغيار وضوابط تسليم المفتاح وتصميم وتنفيذ المشاريع", "تطوير مهارات اللغة الانكليزية",
                "التقارير والمراسلات باللغة الانكليزية", "تطوير مهارة المحادثة باللغة الانكليزية",
            ],
            //بغداد اداري اسبوعين
            [
                "برنامج تطوير القادة", "تأهيل وتطوير القادة الإداريين/ متخصصة في وظائف ومهارات الإدارة المعاصرة",
                "دراسات الجدوى وأساليب تقييم المشروعات", "تدريب المدربين TOT",
                "الأسس والمفاهيم الإدارية والمالية والقانونية", "الأسس والمفاهيم الإدارية والمالية والقانونية / أساسية",
                "تطوير مهارات الممثلين القانونيين",
                "قانون الخدمة المدنية وتعديلاته رقم 24 لسنة 1990 وقانون انضباط موظفي الدولة النافذ رقم 140 لسنة 1991 المعدل",
                "تعليمات تنفيذ العقود الحكومية (2) لسنة 2014 والضوابط الملحقة (1-20)",
            ],
            //بغداد اداري اربع اسابيع
            [
                "تطوير مهارات الإدارات الوسطى",
            ],
            //بغداد تقني 3 ايام
            [
                "احمِ نفسك ومؤسستك: التوعية بالأمن السيبراني لجميع الموظفين ( ورشة)",
            ],
            //بغداد تقني اسبوع
            [
                "صمم مكتبك بذكاء: رسم المخططات الداخلية الاحترافية باستخدام Visio",
                "أطلق طاقتك الإعلامية: المهارات العملية في الفنون الصحفية",
                "أنشئ قواعد بياناتك الخاصة: برمجة تطبيقات باستخدام Access",
                "التصميم باحتراف: معالجة الصور وإنشاء الإعلانات باستخدام Photoshop",
                "إخراج إبداعي للنشر: تصميم الكتب والأدلة والمجلات باستخدام InDesign",
                "ذكاء اصطناعي لأداء أعلى: استخدام أدوات AI في تطوير العمل",
                "وسّع نطاق عملك: أساسيات التجارة الإلكترونية (E-commerce)",
                "احمِ مؤسستك من المخاطر الرقمية: أساسيات الأمن السيبراني",
                "اكتشف كيف يفكر الهاكر لتصبح خبير حماية: الاختراق الأخلاقي عمليًا",
                "الأمن يبدأ من الكاميرا: تركيب وصيانة أنظمة المراقبة الحديثة",
                "صيانة الحاسبات باحتراف: إصلاح أجهزة الحاسوب المكتبي والمحمول بمهارة",
                "صيانة الطابعات باحتراف: حلول عملية لأكثر المشكلات شيوعًا",
                "تحكم في تدفق البيانات: مهارات التوجيه والتحويل في الشبكات الحديثة Routing and Switch",
                "اساسيات الشبكات: تعرف على مكونات وتشغيل الشبكات خطوة بخطوة",
                "إدارة الشبكات بذكاء: إعداد وتكوين أنظمة MikroTik الاحترافية",
                "حلّل بياناتك بذكاء: مدخل عملي إلى التحليل الإحصائي باستخدام Power BIوSPSS",
                "اساليب التحليل الاحصائي للبحوث العلمية",
                "التحول الرقمي في المؤسسات الحكومية: قيادة التغيير وصناعة المستقبل",
                "ابتكر وتكيّف: مهارات إدارة الابتكار والتغيير المؤسسي",
                "الكتابة باحتراف: المهارات الأساسية لاستخدام Word في بيئة العمل",
                "نظم بياناتك بكفاءة: مهارات Excel الأساسية للإدارة والتحليل",
                "قدّم أفكارك بثقة: تصميم عروض تقديمية مؤثرة باستخدام PowerPoint",
                "التحول إلى الأرشفة الذكية: إدارة الوثائق وتطبيقات الحكومة الإلكترونية",
                "من الجداول إلى القرارات الذكية: التطبيقات المتقدمة في Excel",
            ],
            //بغداد تقني اسبوعين
            [
                "ابدأ رحلتك في فهم الخرائط الذكية: مقدمة تطبيقية في نظم المعلومات الجغرافية المستوى الاول (GIS  Pro)",
                "طور مهاراتك في تحليل الخرائط والبيانات المكانية المستوى المتقدم من (GIS Pro)",
                "السيطرة على المشاريع من التخطيط إلى التنفيذ: إدارة المشاريع باحتراف باستخدام Primavera",
                "كن مدربًا متميزًا: مهارات إعداد وتقديم البرامج التدريبية التقنية باحتراف (TOT IT)",
                "إدارة البيانات: تصميم وتشغيل قواعد البيانات باستخدام SQL Server 2016",
                "إدارة الشبكات المؤسسية: تشغيل البنى التحتية باستخدام Windows Server 2016",
            ],
            //---------------------------------------------------------------------------------------------------------------
            //البصرة اداري اسبوع
            [
                "التخطيط الاستراتيجي فن ادارة المستقبل", "اعادة هندسة العمليات الادارية (الهندرة)",
                "صناعة و اتخاذ القرار", "ادارة التغيير المؤسسي", "فن ادارة المخاطر والازمات",
                "الابداع الوظيفي و الذكاء العاطفي", "ادارة المستقبل:كيف يعيد التحول الرقمي تشكيل التخطيط الاستراتيجي",
                "تمكين المرأة القيادية في التنمية المستدامة العراقية",
                "القيادة العميقة: تحويل الذكاء العاطفي الى قوة مؤسسية", "البروتوكول و الاتكيت الدبلوماسي للمرأة القيادية",
                "تنمية مهارات امناء المخازن", "الاحتراق الوظيفي: التشخيص المبكر و استراتيجيات الوقاية",
                "مهارة ادارة الوقت و الذات وضغوط العمل", "التميز العلمي في كتابة التقارير والمراسلات",
                "العلاقات العامة وفن الاتكيت والبروتوكول", "السلامة و الصحة المهنية",
                "مهارات التواصل و بناء فرق العمل متعددة الاجيال", "مهارات التفاوض والاقناع",
                "إدارة المخاطر البيئية و التخطيط للطوارئ في المؤسسات", "إدارة السمعة المؤسسية في عصر الإعلام الرقمي",
                "تطوير المهارات الناعمة و الصلبة للعاملين", "مبادئ المحاسبة", "النظام المحاسبي الموحد",
                "محاسبة التكاليف وسيلة لترشيد القرارات الادارية", "اساسيات التخطيط والتقييم المالي",
                "المحاسبة الادارية", "النظام المحاسبي الحكومي", "قواعد المراجعة المالية ومهارات التدقيق المحاسبي",
                "تحليل الاحتياج التدريبي و اعداد خطط التدريب و قياس العائد منها",
                "اعداد و تصميم و تنفيذ برامج التدريب و الحقائب التدريبية",
                "فن الإلقاء ولغة الجسد في العروض ومواجهة الجمهور", "ادارة الموارد البشرية",
                "مهارات إعداد ادلة الوصف الوظيفي", "اساسيات واساليب تقييم اداء العاملين",
                "ادارة رأس المال الفكري( البشري)", "منهجية التفكير التصميمي: مدخل للابتكار و حل المشكلات و التميز المؤسسي",
                "المهارات القيادية", "مذكرات التفاهم و مهارات التفاوض", "مكافحة الفساد الاداري و المالي",
                "النزاهة و الشفافية في العمل الاداري", "الحوكمة الرشيدة و مكافحة الفساد الاداري",
                "سلامة اللغة العربية في المخاطبات الرسمية", "المهارات الادارية للموظفين الجدد",
                "ادارة الجودة الشاملة في التحول الرقمي", "المواصفات القياسية الدولية ISO 9001/2015",
                "قانون التقاعد الموحد و الاجراءات المحاسبية",
                "قانون سلم رواتب موظفي االخدمة المدنية رقم 22 لسنة 2008 وتعديلاته", "سياسات الاصلاح الاداري والاقتصادي",
                "الحوكمة في عصر التحول الرقمي", "الحكم الرشيد واهداف التنمية المستدامة 2030",
                "ادارة المعرفة في المؤسسات الحكومية من التوثيق الى الذكاء المؤسسي",
            ],
            //البصرة اداري اسبوعين
            [
                "دراسات الجدوى و اساليب تقييم المشروعات في البيئة العراقية", "تدريب المدربين TOT",
                "الاسس و المفاهيم الادارية و الاقتصادية",
                "قانون الخدمة المدنية رقم 24 لسنة 1960 وتعديلاته و قانون انضباط موظفي الدولة رقم 14 لسنة 1991 المعدل",
                "اللغة الإنجليزية لإدارة المشاريع: الاجتماعات والمناقشات والعروض",
                "مهارات المحادثة الإنجليزية في بيئة العمل (للإدارات التنفيذية والموظفين)",
            ],
            //البصرة اداري 4 اسابيع
            [
                "تطوير مهارات الادارات الوسطى",
            ],
            //البصرة تقني اسبوع
            [
                "مبادئ اساسية في الشبكات و امن الحاسبات", "اساسيات صيانة الحاسوب المحمول",
                "خدمات الحوسبة السحابية و تطبيقاتها", "أتمتة المكاتب (Office Automation)",
                "تصميم و معالجة الصور و العلامات التجارية (Logos) بأستخدام برنامج Canva",
                "التحول الرقمي في ادارة المؤسسات", "الكفاءة الرقمية في عصر الذكاء الاصطناعي",
                "المدرب الرقمي : ادوات الذكاء الاصطناعي و التدريب الذكي",
                "من الفكرة إلى التصميم: تصميم الحقائب التدريبية بالذكاء الاصطناعي",
                "معالجة النصوص بأستخدام MS Word - اساسي", "ادارة ومراقبة الوثائق Document Controller",
                "الارشفة الالكترونية باستخدام الحاسوب", "احتساب العلاوات و الترفيعات باستخدام MS - Excel",
                "ادارة البريد الالكتروني بأستخدام MS Outlook", "البوربوينت (PowerPoint) للعروض الاحترافية والتنفيذية",
                "الجداول الالكترونية للمحاسبين - Excel for Accountants",
                "إعداد التقارير والمراسلات الرسمية باستخدام MS Word",
                "التحول الذكي في المؤسسات الحكومية باستخدام ادوات الذكاء الاصطناعي",
                "تصميم وبناء المواقع الحكومية بالذكاء الاصطناعي", "بناء انظمة الجودة الرقمية الذكية 4.0",
                "مستقبل الذكاء الاصطناعي: مخاطر اليوم، فرص الغد", "ادارة الموارد البشرية باستخدام الذكاء الاصطناعي",
                "الحكومة الرقمية الآمنة: إدارة الهجمات السيبرانية", "إدارة المشاريع الذكية",
                "مهارات مدير المشروع الرقمي", "تحليل البيانات بأستخدام Excel and Power BI",
            ],
            //البصرة تقني اسبوعين
            [
                "تصميم الجداول الالكترونية بأستخدام MS Excel - اساسي", "معالجة النصوص بأستخدام MS Word - متقدم",
                "تصميم الجداول الالكترونية بأستخدام MS Excel - متقدم", "اساسيات الامن السيبراني و حماية البيانات",
                "التصميم الهندسي بأستخدام الاوتوكاد - AutoCAD Design 2D-3D - مستوى اساسي",
                "ادارة المشاريع بأستخدام MS-Project - مستوى اساسي", "ادارة المشاريع بأستخدام Primavera P6 - مستوى اساسي",
                "تحليل البيانات باستخدام برنامج SPSS -مستوى اساسي",
            ],
            //----------------------------------------------------------------------------------------------------------------
            //الموصل اداري 3 ايام
            [
                "قانون انضباط موظفي الدولة النافذ رقم ( 14 ) لسنة 1991 المعدل ولائحة السلوك الوظيفي في قانون هيئة نزاهة رقم(30) لسنة 2011 المعدل",
            ],
            //الموصل اداري اسبوع
            [
                "التخطيط الاستراتيجي واستشراف المستقبل مدعم ببرنامج الكتروني",
                "مهارات اعداد المخاطبات والتقارير الرسمية مدعمة ببرنامج معالج النصوص word",
                "السلامة المهنية",
                "العلاقات العامة وفن الاتكيت والبروتوكول",
                "ادارة المخاطر المالية والمصرفية",
                "مهارات اعداد الموازنات التخطيطية مدعم ببرنامج معالجة الجداول الالكترونية M.S.Excel",
                "مهارات العرض والالقاء والتأثير في الاخرين مدعمة ببرامج العروض التقديمية",
                "تطوير مهارات الموظفين", "ادارة المواهب والكفاءات في عصر الذكاء الاصطناعي",
                "تعريفية خاصة بالموظفين الجددمن الدرجة ( 7 ) الى الدرجة ( 6 )",
                "سلامة اللغة العربية في اعداد المخاطبات الرسمية من الدرجة (6) الى الدرجة(5)",
                "ادارة الجودة الشاملة والتطوير المؤسسي", "مبادئ واساسيات اللغة الإنكليزية",
            ],
            //الموصل اداري اسبوعين
            [
                "تدريب المدربين TOT", "الاسس والمفاهيم الادارية والمالية والقانونية من الدرجة ( 5 ) الى الدرجة ( 4 )",
            ],
            //الموصل تقني اسبوع
            [
                "برمجة قواعد البيانات باستخدام Accessاساسية", "إدارة الشبكات MikroTik الاساسية", "برنامج Sketch up",
                "صيانة الحاسوب A + (حسب المنهاج العالمي)", "البرمجة باستخدام لغة python",
                "اساسيات الشبكات + N (حسب المنهاج العالمي)", "معالجة الجداول الالكترونية M.S Excel متقدمة (دورة حتمية)",
                "التسويق الالكتروني (Digital marketing) (دورة حتمية)",
                "التحول الرقمي في المؤسسات الحكومية Digital Transformation", "الأمن السيبراني Cyber Security",
                "الذكاء الاصطناعي في العمل الحكومي", "التصميم باستخدام Canva",
            ],
            //الموصل تقني اسبوعين
            [
                "كفاءة الحاسوب",
            ],
            //----------------------------------------------------------------------------------------------------------------
            //الديوانية اداري اسبوع
            [
                "التميز العلمي في كتابة التقارير والمراسلات", "النظام المحاسبي الحكومي",
                "الاتجاهات الحديثة في الرقابة والتدقيق الداخلي", "أساسيات واساليب تقييم أداء العاملين",
                "إدارة الأزمات", "سلامة اللغة العربية في المخاطبات الرسمية",
                "إدارة الجودة وفق المواصفات القياسية الدولية ISO 9001:2015",
                "قانون الخدمة المدنية وتعديلاته رقم 24 لسنة 1990 وقانون انضباط موظفي الدولة النافذ رقم 14 لسنة 1991 المعدل",
                "قانون سلم رواتب موظفي الخدمة المدنية رقم (22) لسنة 2008 وتعديلاته",
                "تعليمات تنفيذ العقود الحكومية (2) لسنة2014 والضوابط الملحقة (1-10)",
                "التوجهات الحديثة في الإدارة", "ادارة المعرفة", "التخطيط الاستراتيجي", "الادارة الرقمية والتحول الرقمي",
                "تطوير المهارات الرقمية للموظفين"
            ],
            //الديوانية اداري اسبوعين
            [
                "دراسات الجدوى وأساليب تقييم المشروعات", "الأسس والمفاهيم الإدارية والمالية والقانونية",
            ],
            //الديوانية اداري 4 اسابيع
            [
                "تطوير مهارات الإدارات الوسطى",
            ],
        ];

        if(this.inputFormField.Governorate == "بغداد"){
            if(this.inputFormField.Axis == "اداري"){
                if(event == "ثلاثة ايام"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[0];
                }else if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[1];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[2];
                }else if(event == "أربعة اسابيع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[3];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }else if(this.inputFormField.Axis == "تقني"){
                if(event == "ثلاثة ايام"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[4];
                }else if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[5];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[6];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }
        }else if(this.inputFormField.Governorate == "البصرة"){
            if(this.inputFormField.Axis == "اداري"){
                if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[7];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[8];
                }else if(event == "أربعة اسابيع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[9];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }else if(this.inputFormField.Axis == "تقني"){
                if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[10];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[11];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }
        }else if(this.inputFormField.Governorate == "الموصل"){
            if(this.inputFormField.Axis == "اداري"){
                if(event == "ثلاثة ايام"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[12];
                }else if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[13];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[14];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }else if(this.inputFormField.Axis == "تقني"){
                if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[15];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[16];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }
        }else if(this.inputFormField.Governorate == "الديوانية"){
            if(this.inputFormField.Axis == "اداري"){
                if(event == "اسبوع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[16];
                }else if(event == "أسبوعان"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[17];
                }else if(event == "أربعة اسابيع"){
                    this.group_of_form[1].fields[6].properties[0].values = Showed_Values[18];
                }else{
                    this.group_of_form[1].fields[6].properties[0].values = [];
                }
            }
        }else{
            this.group_of_form[1].fields[6].properties[0].values = [];
        }
    },

    //-----------------------------------------------------------------------------------------------------
    //نوع القطاع بمجموعة الحصول على الشهادة
    Seventh_Hide(event){
        this.inputFormField["Ministryname"] = null; //اسم الوزارة
        this.inputFormField["Department"] = null; //الدائرة
        if(event == "القطاع العام"){
            document.getElementById("53654").style.display = "block"; //اسم الوزارة
            document.getElementById("53655").style.display = "block"; //الدائرة
        }else{
            document.getElementById("53654").style.display = "none";
            document.getElementById("53655").style.display = "none";
        }
    }
}