{
  /*
  * هذا الملف خاص بحالات اخفاء المرفقات على اساس خيار يتم اختياره من ضمن الاستمارة
  ! حالات اخفاء الملفات:
  * 1- اخفاء مرفق واحد او اكثر
  * 2- اخفاء مجموعة واحدة او اكثر تحتوي على مرفقات

  ! documentfeapplyService هو "Code snippet type" لاضافة الكود البرمجي بعد اكماله يجب ان يكون نوع ملف الشفرة البرمجية
  ! init هو "Run Time" ووقت العمل
  ! {} لكتابة الكود البرمجي يحتاج ان يتم كتابته بين اقواس من نوع

  * من داخل اعدادات الحقل required والغاء خيار hidden الحقول التي نود اظهارها واخفائها يجب جعلها
  * سوف توقف الخدمة اذا كان الحقل مخفي وتجعل المواطن لا يستطيع العبور للملفات required و hidden لكون الحقول التي تكون 
        
  ! من الملف لكون سوف نجعله اجباري من خلال كود برمجي في ملف اخر required نلغي خاصية
  ! سوف توقف الخدمة اذا كان الحقل مخفي وتجعل المواطن لا يستطيع العبور للملفات required و hidden لكون الحقول التي تكون 

  * المرفقات المشتركة بين جميع الخيارات لا نحتاج ان نخفيها لكونها مرفق ثابت مع جميع الخيارات
  * بعد علامة = لكي يظهر المرفق في صفحة المرفقات block ونضع getElementsByClassName الخاص بالمرفق المطلوب اخفائه داخل "" في ايعاز IDنضع الـ 
  * form_data ونضع الاسم البرمجي للحقل الذي يحتوي على الخيار الذي يقوم باظهار المرفق بعد النقطة في ايعاز
  */

  //--------------------------------------------------------------------------------------------------------------------------//
  //!---------------------------------------------------First_Case------------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مرفق
  //* مصفوفة بالقيمة او القيم التي تجعل المرفق يظهر
  var Selected_Values = ["قيمة الشرط"];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //* getElementsByClassName الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    document.getElementsByClassName("23720")[0].style.display = "block";
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!---------------------------------------------------Second_Case-----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مرفقات
  //* المرفقات IDمصفوفة خاصة بقيم الـ
  var Docs_ID = [
    "12345", //* الخاص بالمرفق الاول ID
    "67890", //* الخاص بالمرفق الثاني ID
    "15987", //* الخاص بالمرفق الثالث ID
  ];
  //* مصفوفة بالقيمة او القيم التي تجعل المرفق يظهر
  var Selected_Values = ["قيمة الشرط"];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    Docs_ID.forEach(
      (Hiding) =>
        (document.getElementsByClassName(Hiding)[0].style.display = "block"),
    );
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!----------------------------------------------------Third_Case-----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مرفق واحد على اساس عدة شروط
  //* مصفوفة خاصة بالقيم التي عند اختيار اي قيمة منها من قبل المواطن في الاستمارة سيظهر المرفق
  var Selected_Values = [
    "قيمة الشرط الاول",
    "قيمة الشرط الثاني",
    "قيمة الشرط الثالث",
  ];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //يظهر المرفق عند تحقق الشرط
    document.getElementsByClassName("23720")[0].style.display = "block";
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!----------------------------------------------------Fourth_Case----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مرفقات على اساس عدة شروط
  //* مصفوفة خاصة بالقيم التي عند اختيار اي قيمة منها من قبل المواطن في الاستمارة سيظهر المرفق
  var Selected_Values = [
      "قيمة الشرط الاول",
      "قيمة الشرط الثاني",
      "قيمة الشرط الثالث",
    ],
    //* المرفقات IDمصفوفة خاصة بقيم الـ
    Docs_ID = [
      "12345", //* الخاص بالمرفق الاول ID
      "67890", //* الخاص بالمرفق الثاني ID
      "15987", //* الخاص بالمرفق الثالث ID
    ];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //يظهر المرفق عند تحقق الشرط
    Docs_ID.forEach(
      (Hiding) =>
        (document.getElementsByClassName(Hiding)[0].style.display = "block"),
    );
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!-----------------------------------------------------Fifth_Case----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مجموعة واحدة
  //!لاخفاء مجموعه يجب ان نتاكد من خيار المواطن وعند عدم اختيار المواطن للقيمة التي تجعل المجموعه تكون ظاهره فنقوم باخفاء المجموعه
  //* مصفوفة بالقيمة او القيم التي عند اختيار اي قيمة منها نقوم باظهار المجموعه
  var Selected_Values = ["قيمة الشرط"];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    //* نظهر المجموعة التي تكون تابعه لهذه الشروط مجتمعه
    document.getElementById("12345_group").style.display = "block";
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!-----------------------------------------------------Sixth_Case----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مجاميع
  //* الخاصة بالمجاميع IDمصفوفة الـ
  var Docs_Groups_ID = [
    "12345_group", //* الخاص بالمجموعة الاولى للمرفقات IDالـ
    "67890_group", //* الخاص بالمجموعة الثانية للمرفقات IDالـ
    "15987_group", //* الخاص بالمجموعة الثالث للمرفقات IDالـ
  ];

  //* مصفوفة بالقيمة او القيم التي عند اختيار اي قيمة منها نقوم باظهار المجاميع
  var Selected_Values = ["قيمة الشرط"];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //* اظهار مجاميع المرفقات التي التابعة لهذا الشرط
    //! الايعاز المُستخدم لاخفاء مجموعة يختلف عن الايعاز المُستخدم لاخفاء مرفق
    //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    Docs_Groups_ID.forEach(
      (Hiding) => (document.getElementById(Hiding).style.display = "block"),
    );
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!----------------------------------------------------Seventh_Case---------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مجموعة واحدة على اساس عدة شروط
  //* مصفوفة بالقيمة او القيم التي عند اختيار اي قيمة منها نقوم باظهار المجموعه
  var Selected_Values = [
    "قيمة الشرط الاول",
    "قيمة الشرط الثاني",
    "قيمة الشرط الثالث",
  ];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //* اظهار مجاميع المرفقات التي التابعة لهذا الشرط
    //! الايعاز المُستخدم لاخفاء مجموعة يختلف عن الايعاز المُستخدم لاخفاء مرفق
    //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    document.getElementById("12345_group").style.display = "block";
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!-----------------------------------------------------Eighth_Case---------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مجاميع على اساس عدة شروط
  //* مصفوفة بالقيمة او القيم التي عند اختيار اي قيمة منها نقوم باظهار المجموعه
  var Selected_Values = [
      "قيمة الشرط الاول",
      "قيمة الشرط الثاني",
      "قيمة الشرط الثالث",
    ],
    //* الخاصة بالمجاميع IDمصفوفة الـ
    Docs_Groups_ID = [
      "12345_group", //* الخاص بالمجموعة الاولى للمرفقات IDالـ
      "67890_group", //* الخاص بالمجموعة الثانية للمرفقات IDالـ
      "15987_group", //* الخاص بالمجموعة الثالث للمرفقات IDالـ
    ];

  if (Selected_Values.includes(this.form_data.ProgName)) {
    //* اظهار مجاميع المرفقات التي التابعة لهذا الشرط
    //! الايعاز المُستخدم لاخفاء مجموعة يختلف عن الايعاز المُستخدم لاخفاء مرفق
    //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    Docs_Groups_ID.forEach(
      (Hiding) => (document.getElementById(Hiding).style.display = "block"),
    );
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!-----------------------------------------------------Ninth_Case----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مرفق واحد على اساس عدة حقول
  //* هو الاسم البرمجي للحقل الاول FirstProg
  //* هو الاسم البرمجي للحقل الثاني SecondProg
  if (
    this.form_data.FirstProg == "قيمة الشرط الاول للحقل الاول" &&
    this.form_data.SecondProg == "قيمة الشرط الثانية للحقل الثاني"
  ) {
    //* نظهر المرفق الذي يكون تابع لهذه الشروط مجتمعه
    //* getElementsByClassName الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    document.getElementsByClassName("23720")[0].style.display = "block";
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!-----------------------------------------------------Tenth_Case----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مجموعة على اساس عدة حقول
  //* هو الاسم البرمجي للحقل الاول FirstProg
  //* هو الاسم البرمجي للحقل الثاني SecondProg
  if (
    this.form_data.FirstProg == "قيمة الشرط الاول للحقل الاول" &&
    this.form_data.SecondProg == "قيمة الشرط الثانية للحقل الثاني"
  ) {
    //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
    //* نظهر المجموعة التي تكون تابعه لهذه الشروط مجتمعه
    document.getElementById("12345_group").style.display = "block";
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!----------------------------------------------------Eleventh_Case--------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مرفقات على اساس عدة حقول
  //* المرفقات IDمصفوفة خاصة بقيم الـ
  var Docs_ID = [
    "12345", //* الخاص بالمرفق الاول ID
    "67890", //* الخاص بالمرفق الثاني ID
    "15987", //* الخاص بالمرفق الثالث ID
  ];

  //* هو الاسم البرمجي للحقل الاول FirstProg
  //* هو الاسم البرمجي للحقل الثاني SecondProg
  if (
    this.form_data.FirstProg == "قيمة الشرط الاول للحقل الاول" &&
    this.form_data.SecondProg == "قيمة الشرط الثانية للحقل الثاني"
  ) {
    //نظهر المرفقات التي تكون تابعه لهذا الشرط
    Docs_ID.forEach(
      (Hiding) =>
        (document.getElementsByClassName(Hiding)[0].style.display = "block"),
    );
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!----------------------------------------------------Twelveth_Case--------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مجاميع على اساس عدة حقول
  //* مصفوفة بالقيمة او القيم التي عند اختيار اي قيمة منها نقوم باظهار المجموعه
  var Selected_Values = [
      "قيمة الشرط الاول",
      "قيمة الشرط الثاني",
      "قيمة الشرط الثالث",
    ],
    //* الخاصة بالمجاميع IDمصفوفة الـ
    Docs_Groups_ID = [
      "12345_group", //* الخاص بالمجموعة الاولى للمرفقات IDالـ
      "67890_group", //* الخاص بالمجموعة الثانية للمرفقات IDالـ
      "15987_group", //* الخاص بالمجموعة الثالث للمرفقات IDالـ
    ];

  //* هو الاسم البرمجي للحقل الاول FirstProg
  //* هو الاسم البرمجي للحقل الثاني SecondProg
  if (
    this.form_data.FirstProg == "قيمة الشرط الاول للحقل الاول" &&
    this.form_data.SecondProg == "قيمة الشرط الثانية للحقل الثاني"
  ) {
    //نظهر مجموعة المرفقات التي تكون تابعة لهذا الشرط
    Docs_Groups_ID.forEach(
      (Hiding) => (document.getElementById(Hiding).style.display = "block"),
    );
  }
}
