{
    First_Filter(event, Fields_ID, Fields_Progs, Group_Num, Field_Num){
        for(var i = 0; i < Fields_Progs.length; i++){
            this.inputFormField[Fields_Progs[i]] = null;
        }

        var Values = [
            //الي بيهن اقضية
            "الانبار",
            "بابل",
            "بغداد",
            "البصرة",
            "ديالى",
            "ذي قار",
            "صلاح الدين",
            "القادسية",
            "كركوك",
            "كربلاء المقدسة",
            "المثنى",
            "ميسان",
            "النجف الاشرف",
            "نينوى",
            "واسط",
        ],
        Second_Values = [
            //الي مابيهن اقضيه
            "اربيل", "السليمانية", "دهوك", "حلبجة",
        ],
        getdistnict =
            [
            [
                "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية",
                "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة", "النخيب",
                "هيت", "الوفاء", "الوليد"
            ],//اقضية الانبار
            [
                "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع",
                "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"
            ],//اقضية بابل
            [
                "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون",
                "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية",//الكرخ
                "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية",
                "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة",
                "ذات السلاسل", "فلسطين"//الرصافة
            ],//اقضية بغداد
            [
                "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر",
                "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق"
            ],//اقضية البصرة
            [
                "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية",
                "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي",
                "قرة تبة", "سيف سعد"
            ],//اقضية ديالى
            [
                "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش",
                "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل",
                "سوق الشيوخ", "عكيكة"
            ],//اقضية ذي قار
            [
                "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي",
                "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "طوز خورماتو", "يثرب", "العوجة"
            ],//اقضية صلاح الدين
            [
                "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية",
                "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"
            ],//اقضية القادسية
            [
                "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق",
                "كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"
            ],//اقضية كركوك
            [
                "عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"
            ],//اقضية كربلاء
            [
                "الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة",
                "السلمان", "السماوة", "السوير"
            ],//اقضية المثنى
            [
                "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير",
                "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"
            ],//اقضية ميسان
            [
                "العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية",
                "النجف", "الشبكة"
            ],//اقضية النجف
            [
                "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة",
                "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة",
                "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف",
                "وانة", "زيلكان", "زمار", "الفاروق"
            ],//اقضية نينوى
            [
                "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية",
                "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)",
                "ناحية واسط"
            ],//اقضية واسط
        ];

        if(Values.includes(event)){
            document.getElementById(Fields_ID[0]).style.display = "block"; //سلكتر  الاقضية
            document.getElementById(Fields_ID[1]).style.display = "none"; //اسم القضاء
            for(var i = 0; i < Values.length; i++){
                if(event == Values[i]){
                    this.group_of_form[Group_Num].fields[Field_Num].properties[0].values = getdistnict[i];
                    break;
                }else{
                    this.group_of_form[Group_Num].fields[Field_Num].properties[0].values = [];
                }
            }
        }else if(Second_Values.includes(event)){
            document.getElementById(Fields_ID[0]).style.display = "none"; //سلكتر  الاقضية
            document.getElementById(Fields_ID[1]).style.display = "block"; //اسم القضاء
        }else{
            document.getElementById(Fields_ID[0]).style.display = "none"; //سلكتر  الاقضية
            document.getElementById(Fields_ID[1]).style.display = "none"; //اسم القضاء
        }
    },

    nuketransfer(event) {
        this.inputFormField["vcc"] = null;
        if (event === "استيراد") {
        document.getElementById("29269").style.display = "block";
        } else {
        document.getElementById("29269").style.display = "none";
        }
    },

    First_Hide(event){
        this.inputFormField["nom"] = null;
        this.inputFormField["PassportNum"] = null;
        
        if(event == "البطاقة الوطنية"){
            document.getElementById("27455").style.display = "block";
            document.getElementById("73113").style.display = "none";
        }else if(event == "جواز السفر"){
            document.getElementById("27455").style.display = "none";
            document.getElementById("73113").style.display = "block";
        }else{
            document.getElementById("27455").style.display = "none";
            document.getElementById("73113").style.display = "none";
        }
    },

    getsubCities(event) {
        var Fields_ID = [
            "73581", //سلكتر  الاقضية
            "74568", //اسم القضاء
        ],
        Fields_Progs = [
            "district", //سلكتر  الاقضية
            "SecDiscName", //اسم القضاء
        ];
        
        this.First_Filter(event, Fields_ID, Fields_Progs, 1, 4);
    },

    Second_getsubCities(event) {
        var Fields_ID = [
            "73585", //سلكتر  الاقضية
            "74569", //اسم القضاء
        ],
        Fields_Progs = [
            "SecondDistrict", //سلكتر  الاقضية
            "ThiDiscName", //اسم القضاء
        ];
        
        this.First_Filter(event, Fields_ID, Fields_Progs, 3, 4);
    },

    Third_getsubCities(event) {
        var Fields_ID = [
            "73608", //سلكتر  الاقضية
            "74543", //اسم القضاء
        ],
        Fields_Progs = [
            "ThirdDistrict", //سلكتر  الاقضية
            "DiscName", //اسم القضاء
        ];

        this.First_Filter(event, Fields_ID, Fields_Progs, 0, 4);
    },
}