{
  //اخفاء مجماميع
  var GroupsID = [
    "33368_group", //اول شركة
    "33386_group", //ثاني شركة
    "33807_group", //ثالث شركة
    "33808_group", //رابع شركة
    "33809_group", //خامس شركة
    "33811_group", //سادس شركة
  ];

  // إخفاء جميع المجموعات
  GroupsID.forEach(
    (Hiding) => (document.getElementById(Hiding).style.display = "none"),
  );

  //-------------------------------------------------------------------------------------
  //حصر الحقول باللغة العربية
  function Arabic_Only(Fields_ID) {
    for (var i = 0; i < Fields_ID.length; i++) {
      const input = document.getElementById(Fields_ID[i]);
      input.addEventListener("keydown", (e) => {
        const ctrl = e.ctrlKey || e.metaKey;
        if (ctrl || e.key.length > 1) return; // السماح بالاختصارات والأسهم

        // الأحرف العربية + الهمزة + المسافة
        if (!/^[\u0600-\u06FF\s]$/.test(e.key)) {
          e.preventDefault(); // منع أي شيء غير عربي
        }
      });
    }
  }

  var Fields_ID = [
    //بيانات الشركة الاولى المقدمة بطلب الاندماج او الاستحواذ
    "51531", //اسم الشركة
    "51533", //طبيعة نشاط الشركة
    "51540", //الاسم الاول للمدير المفوض / الوكيل
    "51539", //الاسم  الثاني للمدير المفوض/ الوكيل
    "51541", //الاسم الثالث للمدير المفوض / الوكيل
    //بيانات الشركة الثانية المقدمة بطلب الاندماج والاستحواذ
    "51659", //اسم الشركة
    "51661", //طبيعة نشاط الشركة
    "51667", //الاسم الاول للمدير المفوض/ الوكيل
    "51668", //الاسم الثاني للمدير المفوض / الوكيل
    "51669", //الاسم الثالث للمدير المفوض/ الوكيل
    //بيانات الشركة الثالثة المقدمة بطلب الاندماج والاستحواذ
    "65605", //اسم الشركة
    "65608", //طبيعة نشاط الشركة
    "65619", //الاسم الاول للمدير المفوض/ الوكيل
    "65623", //الاسم الثاني للمدير المفوض/ الوكيل
    "65624", //الاسم الثالث للمدير المفوض/ الوكيل
    //بيانات الشركة الرابعة المقدمة بطلب الاندماج والاستحواذ
    "65629", //اسم الشركة
    "65633", //طبيعة نشاط الشركة
    "65642", //الاسم الاول للمدير المفوض/ الوكيل
    "65643", //الاسم الثاني للمدير المفوض/ الوكيل
    "65644", //الاسم الثالث للمدير المفوض/ الوكيل
    //بيانات الشركة الخامسة المقدمة بطلب الاندماج والاستحواذ
    "65651", //اسم الشركة
    "65653", //طبيعة نشاط الشركة
    "65658", //الاسم الاول للمدير المفوض
    "65659", //الاسم الثاني للمدير المفوض
    "65660", //الاسم الثالث للمدير المفوض
    //بيانات الشركة السادسة المقدمة بطلب الاندماج والاستحواذ
    "65662", //اسم الشركة
    "65664", //طبيعة نشاط الشركة
    "65671", //الاسم الاول للمدير المفوض
    "65674", //الاسم الثاني للمدير المفوض
    "65676", //الاسم الثالث للمدير المفوض
  ];

  Arabic_Only(Fields_ID);

  //-------------------------------------------------------------------------------------
  //حصر الحقول باللغة العربية والرموز
  function Arabic_Symbols_Only(Fields_ID) {
    for (var i = 0; i < Fields_ID.length; i++) {
      const input = document.getElementById(Fields_ID[i]);

      input.addEventListener("keydown", (e) => {
        const ctrl = e.ctrlKey || e.metaKey;
        if (ctrl || e.key.length > 1) return;

        // العربية + المسافة + الرموز
        const regex = /^[\u0600-\u06FF\s!"#$%&'()*+,\-./:;<=>?@[\\\]^_`{|}~]$/;

        if (!regex.test(e.key)) {
          e.preventDefault();
        }
      });
    }
  }

  var Fields_ID = [
    //بيانات الشركة الاولى المقدمة بطلب الاندماج او الاستحواذ
    "51535", //العنوان
    //بيانات الشركة الثانية المقدمة بطلب الاندماج والاستحواذ
    "51664", //العنوان
    //بيانات الشركة الثالثة المقدمة بطلب الاندماج والاستحواذ
    "65612", //العنوان
    //بيانات الشركة الرابعة المقدمة بطلب الاندماج والاستحواذ
    "65637", //العنوان
    //بيانات الشركة الخامسة المقدمة بطلب الاندماج والاستحواذ
    "65655", //العنوان
    //بيانات الشركة السادسة المقدمة بطلب الاندماج والاستحواذ
    "65668", //العنوان
  ];

  Arabic_Symbols_Only(Fields_ID);

  //-------------------------------------------------------------------------------------
  //حصر الحقول باللغة العربية والارقام
  function Arabic_Numbers_Only(Fields_ID) {
    for (var i = 0; i < Fields_ID.length; i++) {
      const input = document.getElementById(Fields_ID[i]);
      input.addEventListener("keydown", (e) => {
        const ctrl = e.ctrlKey || e.metaKey;
        if (ctrl || e.key.length > 1) return;

        // العربية + الأرقام + المسافة (بدون رموز)
        const regex = /^[\u0600-\u06FF0-9\u0660-\u0669\s]$/;
        if (!regex.test(e.key)) {
          e.preventDefault();
        }
      });

      // حماية من اللصق
      input.addEventListener("input", () => {
        input.value = input.value.replace(
          /[^\u0600-\u06FF0-9\u0660-\u0669\s]/g,
          "",
        );
      });
    }
  }

  var Fields_ID = [
    //بيانات الشركة الاولى المقدمة بطلب الاندماج او الاستحواذ
    "51532", //رقم السجل التجاري للشركة
    //بيانات الشركة الثانية المقدمة بطلب الاندماج والاستحواذ
    "51660", //رقم السجل التجاري للشركة
    //بيانات الشركة الثالثة المقدمة بطلب الاندماج والاستحواذ
    "65606", //رقم السجل التجاري للشركة
    //بيانات الشركة الرابعة المقدمة بطلب الاندماج والاستحواذ
    "65632", //رقم السجل التجاري للشركة
    //بيانات الشركة الخامسة المقدمة بطلب الاندماج والاستحواذ
    "65652", //رقم السجل التجاري للشركة
    //بيانات الشركة السادسة المقدمة بطلب الاندماج والاستحواذ
    "65663", //رقم السجل التجاري للشركة
  ];

  Arabic_Numbers_Only(Fields_ID);
}
