{
  nuketype(event) {
    var Progs = [
        "ghglwh", //جدول المصادر المشعة المغلقة
        "ret", //جدول المصادر المشعة المفتوحة (خاص بممارسة الطبي فقط)
        "hghim", //جدول الاجهزة المرافقة (خاص بالممارسة الصناعية)
        "hgvw", //اجهزة الرصد المكاني
    ];
    var Values = ["صناعي (جس آبار)", "صناعي (تصوير صناعي)", "صناعي (مقاييس صناعية)"];

    for(var i = 0; i < Progs.length; i++){
        this.inputFormField[Progs[i]] = null;
    }
    if (Values.includes(event)) {
      document.getElementById("27860").style.display = "block"; //جدول المصادر المشعة المغلقة
      document.getElementById("29485").style.display = "none"; //جدول المصادر المشعة المفتوحة (خاص بممارسة الطبي فقط)
      document.getElementById("27861").style.display = "block"; //جدول الاجهزة المرافقة (خاص بالممارسة الصناعية)
      document.getElementById("27862").style.display = "block"; //اجهزة الرصد المكاني
    }else if (event === "طبي") {
      document.getElementById("27860").style.display = "block"; //جدول المصادر المشعة المغلقة
      document.getElementById("29485").style.display = "block"; //جدول المصادر المشعة المفتوحة (خاص بممارسة الطبي فقط)
      document.getElementById("27861").style.display = "none"; //جدول الاجهزة المرافقة (خاص بالممارسة الصناعية)
      document.getElementById("27862").style.display = "block"; //اجهزة الرصد المكاني
    } else {
      document.getElementById("27860").style.display = "none"; //جدول المصادر المشعة المغلقة
      document.getElementById("29485").style.display = "none"; //جدول المصادر المشعة المفتوحة (خاص بممارسة الطبي فقط)
      document.getElementById("27861").style.display = "none"; //جدول الاجهزة المرافقة (خاص بالممارسة الصناعية)
      document.getElementById("27862").style.display = "none"; //اجهزة الرصد المكاني
    }
  },

  getsubCities(event) {
        //تفريغ حقل الاقضية
        this.inputFormField["district"] = null;

        var Values = [
            "الانبار",
            "بابل",
            "بغداد",
            "البصرة",
            "ديالى",
            "ذي قار",
            "صلاح الدين",
            "القادسية",
            "كركوك",
            "كربلاء المقدسة",
            "المثنى",
            "ميسان",
            "النجف الاشرف",
            "نينوى",
            "واسط",
        ],
        Second_Values = [
            "اربيل", "السليمانية", "دهوك", "حلبجة",
        ],
        getdistnict =
            [
                [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية",
                    "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة", "النخيب",
                    "هيت", "الوفاء", "الوليد"
                ],//اقضية الانبار
                [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع",
                    "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"
                ],//اقضية بابل
                [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون",
                    "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية",//الكرخ
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية",
                    "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة",
                    "ذات السلاسل", "فلسطين"//الرصافة
                ],//اقضية بغداد
                [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر",
                    "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق"
                ],//اقضية البصرة
                [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية",
                    "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي",
                    "قرة تبة", "سيف سعد"
                ],//اقضية ديالى
                [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش",
                    "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل",
                    "سوق الشيوخ", "عكيكة"
                ],//اقضية ذي قار
                [
                    "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي",
                    "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "طوز خورماتو", "يثرب", "العوجة"
                ],//اقضية صلاح الدين
                [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية",
                    "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"
                ],//اقضية القادسية
                [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق",
                    "كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"
                ],//اقضية كركوك
                [
                    "عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"
                ],//اقضية كربلاء
                [
                    "الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة",
                    "السلمان", "السماوة", "السوير"
                ],//اقضية المثنى
                [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير",
                    "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"
                ],//اقضية ميسان
                [
                    "العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية",
                    "النجف", "الشبكة"
                ],//اقضية النجف
                [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة",
                    "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة",
                    "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف",
                    "وانة", "زيلكان", "زمار", "الفاروق"
                ],//اقضية نينوى
                [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية",
                    "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)",
                    "ناحية واسط"
                ],//اقضية واسط
        ];

        if(Values.includes(event)){
            document.getElementById("73589").style.display = "block";//سلكتر القضاء مال المؤسسة
            document.getElementById("73621").style.display = "block";//سلكتر القضاء مال المخزن
            for(var i = 0; i < Values.length; i++){
                if(event == Values[i]){
                    this.group_of_form[0].fields[4].properties[0].values = getdistnict[i];
                    this.group_of_form[0].fields[21].properties[0].values = getdistnict[i];
                    break;
                }else{
                    this.group_of_form[0].fields[4].properties[0].values = [];
                    this.group_of_form[0].fields[21].properties[0].values = [];
                }
            }

            document.getElementById("74862").style.display = "none";//حقل اسم القضاء مال المؤسسة
            document.getElementById("74863").style.display = "none";//حقل اسم القضاء مال المخزن
        }else if(Second_Values.includes(event)){
            document.getElementById("74862").style.display = "block";//حقل اسم القضاء مال المؤسسة
            document.getElementById("74863").style.display = "block";//حقل اسم القضاء مال المخزن

            document.getElementById("73589").style.display = "none";//سلكتر القضاء مال المؤسسة
            document.getElementById("73621").style.display = "none";//سلكتر القضاء مال المخزن
        }else{
            document.getElementById("73589").style.display = "none";//سلكتر القضاء مال المؤسسة
            document.getElementById("73621").style.display = "none";//سلكتر القضاء مال المخزن
            document.getElementById("74862").style.display = "none";//حقل اسم القضاء مال المؤسسة
            document.getElementById("74863").style.display = "none";//حقل اسم القضاء مال المخزن
        }
    },

    First_Hide(event){
        var Values = ["تمديد", "تعديل", "انهاء ممارسة"];
        this.inputFormField["datr"] = null;

        if(Values.includes(event)){
            document.getElementById("27848").style.display = "block";
        }else{
            document.getElementById("27848").style.display = "none";
        }
    },
}