{
  let Groups_ID = [
    "35309_group", //البيانات الشخصية
    "35311_group", // الأستعداد للتحول الرقمي
    "35312_group", //الأستعداد النفسي والمهني للتحول الرقمي
    "35313_group", //المهارات الرقمية الأساسية
    "35314_group", //كفاءت البنية التقنية المتاحة
    "35315_group", //الانظمة والبرامج الالكترونية
    "35316_group", //الدورات التدريبية التي تحتاجها لتكون جاهز للتحول الرقمي
    "35317_group", //مقترحاتك لتحسين التحول الرقمي
    "35320_group", //البيانات الأساسية للتشكيل
    "35321_group", //أستعداد التشكيل للتحول الرقمي
    "35322_group", //مقترحاتك لتحسين التحول الرقمي.
  ];

  Groups_ID.forEach(
    (Hiding) => (document.getElementById(Hiding).style.display = "none"),
  );

  //--------------------------------------------------------------------------------------------
  //جلب المعلومات من بوابة اور
  //البيانات الشخصية
  this.inputFormField.FirstName = this.user.first_name; //جلب الاسم الاول
  document.getElementsByName("FirstName")[0].disabled = true; //قفل حقل الاسم الاول

  this.inputFormField.SecondName = this.user.middle_name; //جلب الاسم الثاني
  document.getElementsByName("SecondName")[0].disabled = true; //قفل حقل الاسم الثاني

  this.inputFormField.ThirdName = this.user.last_name; //جلب الاسم الثالث
  document.getElementsByName("ThirdName")[0].disabled = true; //قفل حقل الاسم الثالث

  this.inputFormField.PhoneNumber = this.user.phone_num; //جلب رقم الهاتف
  document.getElementsByName("PhoneNumber")[0].disabled = true; //قفل حقل رقم الهاتف

  //--------------------------------------------------------------------------------------------
  //التاكد من المخول
  // let PhoneNumbers = [
  //   "9647710945050", //نبيل اميلي هواس
  //   "9647707101805", //مصطفى جاسم هادي
  //   "9647702534760", //عباس صالح حسن
  //   "9647702534760", //رسل عامر براك
  //   "9647719758854", //رسل عامر براك
  //   "9647730999700", //احمد عبدالله ساجت
  //   //"9647811911618", //يوسف احسان علي
  //   "9647706242275", //كرار حيدر
  //   "9647708860872", //علي غني
  //   "9647718267149", //ماريا
  //   "9647712728880", //احمد جناح
  //   "9647803233322", // بشرى كاظم جبر فرع كربلاء المقدسة
  //   "9647735381409", // مرام محمد حلوص اسود فرع النجف الأشرف
  //   "9647745976333", // أسماء نصير محمد فرع محافظة الديوانية
  //   "9647727116695", // رشا عبدالجليل غازي فرع محافظة بابل
  //   "9647701230669", // مصطفى رفعت إبراهيم فرع محافظة صلاح الدين
  //   "9647701794303", // منهل نجيب محمد صالح فرع محافظة نينوى
  //   "9647708880839", // محمد جاسم سطام مكتب سامراء
  //   "9647704007970", // مصطفى جمعة احمد فرع محافظة كركوك
  //   "9647517921402", // حسين معتز حسن مكتب سنجار
  //   "9647503168042", // سالم عاصم عبدالمجيد احمد مكتب تلعفر
  //   "9647737078112", // فضاء عبدالكريم احمد مكتب الحمدانية
  //   "9647722748334", // رنا حسين كاظم فرع محافظة البصرة
  //   "9647830895286", // كرار شريف حسن فرع محافظة ذي قار
  //   "9647705565504", // هاشم علي حسين فرع محافظة ميسان
  //   "96478101336787", //! سفاح نعمة صباح فرع محافظة المثنى
  //   "9647825804146", // احمد علي جواد فرع محافظة بغداد / الكرخ
  //   "9647920241181", // علي عبد الحميد مزعل فرع محافظة الأنبار
  //   "9647734311807", // حيدر جميل فرج فرع محافظة واسط
  //   "964770532895", //! زينب رضا ساجي فرع محافظة بغداد الرصافة
  //   "9647830222208", // وسام محمد ضاري مكتب الفلوجة
  //   "9647703933219", // عدي لطيف قاسم مكتب قضاء خانقين
  //   "9647768325299", // محمد طه عزت مكتب محافظة ديالى
  //   "964774085559", //! أشرف نشوان عبدالقـتاح فرع محافظة دهوك
  //   "96407719611833", //! إسراء شاكر توفيق فرع محافظة أربيل
  //   "9647705291101", // ميس قتيبة نجيب فرع محافظة السليمانية
  // ];

  // if (PhoneNumbers.includes(this.user.phone_num)) {
  //   document.getElementById("89581").style.display = "block"; //تحديد نوع الأستبيان
  //   document.getElementById("96435").style.display = "none"; //يرجى التاكد من معلومات الدخول
  // } else {
  //   this.inputFormField["nameselecter"] = null; //تحديد نوع الأستبيان
  //   document.getElementById("96435").style.display = "block"; //يرجى التاكد من معلومات الدخول
  //   document.getElementById("89581").style.display = "none"; //تحديد نوع الأستبيان

  //   document.getElementById("96435").style.cssText =
  //     "color: #6e0707; font-size: 20px; font-weight: bold; padding-top: 15px; padding-bottom: 15px; text-align: center;";
  // }

  //--------------------------------------------------------------------------------------------
  //تغيير خصائص الليبل
  document.getElementById("89545").style.cssText =
    "color: #6e0707; font-size: 20px; font-weight: bold; padding-top: 15px; padding-bottom: 15px; text-align: center;";

  document.getElementById("89617").style.cssText =
    "color: #6e0707; font-size: 20px; font-weight: bold; padding-top: 15px; padding-bottom: 15px; text-align: center;";

  //--------------------------------------------------------------------------------------------
  //حصر الحقول باللغة العربية فقط
  function Arabic_Only(Fields_ID) {
    for (var i = 0; i < Fields_ID.length; i++) {
      const input = document.getElementById(Fields_ID[i]);
      input.addEventListener("keydown", (e) => {
        const ctrl = e.ctrlKey || e.metaKey;
        if (ctrl || e.key.length > 1) return; // السماح بالاختصارات والأسهم

        // الأحرف العربية + الهمزة + المسافة
        if (!/^[\u0600-\u06FF\s]$/.test(e.key)) {
          e.preventDefault(); // منع أي شيء غير عربي
        }
      });
    }
  }

  var Fields_ID = [
    //البيانات الشخصية
    "89515", //الاسم الاول
    "89516", //الاسم الثاني
    "89517", //الاسم الثالث
    "89518", //العنوان الوظيفي
    "89519", //التشكيل
    "89521", //القسم
    //البيانات الاساسية للتشكيل
    "89573", //التشكيل
  ];

  Arabic_Only(Fields_ID);
}
