{
    First_Hide(event){
        let Fields_Progs = [
            //"استمارة ترشيح مدرب/ة ضمن مبادرة الريادة والتميز"
            "rate", //ماهي النسبة المئوية النجاح لطلبتك خلال العام الماضي؟
            "sharing", //هل سبق لك المشاركة في دورات تدريبية؟
            "level", //ما مستوى معرفتك باستخدام الحاسوب؟
            "sel", //هل سبق لك تقديم ورشة او تدريب داخل المدرسة او خارجها؟
            "soq", //هل لديك خبرة في الانشطة اللاصفية او المبادرات الطلابية؟ مسابقات, معارض ,مشاريع طلابية ,او لجان مدرسية ؟
            "three", //هل لديك موافقة مبدئية من ادارة المدرسة للمشاركة في المبادرة ؟
            "for", //هل تستطيع حضور دورة اعداد المدربين الخاصة بالمبادرة ؟
            "faife", //هل تلتزم بتنفيذ ورش او انشطة داخل المدرسة بعد انتهاء التدريب؟
            "qustion", //كم نشاطا تستطيع تنفيذه خلال الفصل الدراسي؟
            "governorate", //المحافظة
            "district", //القضاء
            "adrr", //الناحية
            "adde", //المنطقة
            "ssex", //جنس المدرسة
            "ngn", //الرابع الاعدادي
            "nbn", //الخامس الاعدادي
            "nhn", //السادس الاعدادي
            "onerate", //معدل نسبة النجاح لاخر ثلاث اعوام للمراحل الثلاثة
            //"استمارة المدارس"
            "namemager", //اسم مدير/ة المدرسة
            "phooone", //رقم الهاتف (مدير/ة) المدرسة
            "mailall", //البريد الالكتروني ان وجد (مدير/ة) المدرسة
            "Assistant", //اسم معاون /ة المدرسة
            "becoues", //ماسبب رغبة المدرسة بالمشاركة في المبادرة
            "hall", //هل توجد قاعة او مكان مناسب لتنفيذ الورش
            "blackboard", //هل توجد سبورة ذكية أو شاشة عرض
            "Allocation", //هل تستطيع المدرسة تخصيص وقت للأنشطة
            "Students", //عدد الطلبة المتوقع إشتراكهم
            "participated", //هل شاركت المدرسة سابقاً في مسابقات أو مبادرات
        ];

        Fields_Progs.forEach((Clearing) => this.inputFormField[Clearing] = null); //تفريغ الحقول

        //"استمارة ترشيح مدرب/ة ضمن مبادرة الريادة والتميز"
        let First_Choice_Fields = [
            "90835", //الخبرة المهنية والتدريبية
            "90836", //ماهي النسبة المئوية النجاح لطلبتك خلال العام الماضي؟
            "90837", //هل سبق لك المشاركة في دورات تدريبية؟
            "90838", //ما مستوى معرفتك باستخدام الحاسوب؟
            "90842", //هل سبق لك تقديم ورشة او تدريب داخل المدرسة او خارجها؟
            "90844", //هل لديك خبرة في الانشطة اللاصفية او المبادرات الطلابية؟ مسابقات, معارض ,مشاريع طلابية ,او لجان مدرسية ؟
            "90848", //الجاهزية والالتزام
            "90849", //هل لديك موافقة مبدئية من ادارة المدرسة للمشاركة في المبادرة ؟
            "90850", //هل تستطيع حضور دورة اعداد المدربين الخاصة بالمبادرة ؟
            "90851", //هل تلتزم بتنفيذ ورش او انشطة داخل المدرسة بعد انتهاء التدريب؟
            "90852", //كم نشاطا تستطيع تنفيذه خلال الفصل الدراسي؟
            "90859", //عنوان المدرسة
            "91985", //المحافظة
            "91986", //القضاء
            "90862", //الناحية
            "90864", //المنطقة
            "90867", //جنس المدرسة
        ],
        //"استمارة المدارس"
        Second_Choice_Fields = [
            "90888", //معلومات ادارة المدرسة (استمارة المدارس )
            "90889", //اسم مدير/ة المدرسة
            "90890", //رقم الهاتف (مدير/ة) المدرسة
            "90891", //البريد الالكتروني ان وجد (مدير/ة) المدرسة
            "90892", //اسم معاون /ة المدرسة
            "90893", //ماسبب رغبة المدرسة بالمشاركة في المبادرة
            "90894", //جاهزية المدرسة لتنفيذ المبادرة
            "90895", //هل توجد قاعة او مكان مناسب لتنفيذ الورش
            "90896", //هل توجد سبورة ذكية أو شاشة عرض
            "90897", //هل تستطيع المدرسة تخصيص وقت للأنشطة
            "90898", //عدد الطلبة المتوقع إشتراكهم
            "90899", //هل شاركت المدرسة سابقاً في مسابقات أو مبادرات
            "90874", //عدد الطلبة الكلي في المدرسة
            "90876", //الرابع الاعدادي
            "90878", //الخامس الاعدادي
            "90879", //السادس الاعدادي
            "90881", //معدل نسبة النجاح لاخر ثلاث اعوام للمراحل الثلاثة
        ];

        let Values = [
            {
                Selected_Value: "استمارة ترشيح مدرب/ة ضمن مبادرة الريادة والتميز",
                Showed_Fields: First_Choice_Fields,
                Labels_ID: [
                    "90835", //الخبرة المهنية والتدريبية
                    "90848", //الجاهزية والالتزام
                    "90859", //عنوان المدرسة
                ],
                Hide_Fields: Second_Choice_Fields
            },
            {
                Selected_Value: "استمارة المدارس",
                Showed_Fields: Second_Choice_Fields,
                Labels_ID: [
                    "90888", //معلومات ادارة المدرسة (استمارة المدارس )
                    "90894", //جاهزية المدرسة لتنفيذ المبادرة
                    "90874", //عدد الطلبة الكلي في المدرسة
                ],
                Hide_Fields: First_Choice_Fields
            },
        ];

        let Result = Values.find((Finding) => event === Finding.Selected_Value);

        if(Result){
            Result.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
            Result.Hide_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            Result.Labels_ID.forEach((Changing) => {
                document.getElementById(Changing).style.cssText =
                    "color: #630000; font-size: 20px; font-weight: bold; padding-top: 12px; padding-bottom: 12px; text-align: center;";
            });
        }else{
            First_Choice_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            Second_Choice_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    //هل سبق لك المشاركة في دورات تدريبية؟
    Second_Hide(event){
        this.inputFormField["CERCL"] = null;
        if(event == "نعم"){
            document.getElementById("90840").style.display = "block";
        }else{
            document.getElementById("90840").style.display = "none";
        }
    },

    //هل سبق لك تقديم ورشة او تدريب داخل المدرسة او خارجها؟
    Third_Hide(event){
        this.inputFormField["selone"] = null;
        if(event == "نعم"){
            document.getElementById("90843").style.display = "block";
        }else{
            document.getElementById("90843").style.display = "none";
        }
    },

    //هل لديك خبرة في الانشطة اللاصفية او المبادرات الطلابية؟ مسابقات, معارض ,مشاريع طلابية ,او لجان مدرسية ؟
    Fourth_Hide(event){
        this.inputFormField["ree"] = null;
        if(event == "نعم"){
            document.getElementById("90845").style.display = "block";
        }else{
            document.getElementById("90845").style.display = "none";
        }
    },

    //فلترة المحافظات
    First_Filter(event){
        this.inputFormField["district"] = null; //* تفريغ حقل الاقضية
        let Values = [
            {
                Selected_Value: "الانبار",
                Showed_Value: [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة",
                    "القائم", "كبيسة", "الكرمة", "النخيب", "هيت", "الوفاء", "الوليد",
                ]
            },
            {
                Selected_Value: "بابل",
                Showed_Value: [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة",
                    "جرف النصر (جرف الصخر)", "سدة الهندية",
                ]
            },
            {
                Selected_Value: "بغداد",
                Showed_Value: [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون", "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام",
                    "الرشيد", "الطارمية",//الكرخ
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية",
                    "التاجي", "الزهور", "بغداد الجديدة", "ذات السلاسل", "فلسطين",//الرصافة
                ]
            },
            {
                Selected_Value: "البصرة",
                Showed_Value: [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب",
                    "طلحة", "أم قصر", "الامام الصادق",
                ]
            },
            {
                Selected_Value: "ديالى",
                Showed_Value: [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب",
                    "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", "قرة تبة", "سيف سعد",
                ]
            },
            {
                Selected_Value: "ذي قار",
                Showed_Value: [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور",
                    "كرمة بني سعد", "قلعة سكر", "سيد دخيل", "سوق الشيوخ", "عكيكة",
                ]
            },
            {
                Selected_Value: "صلاح الدين",
                Showed_Value: [
                    "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي", "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "يثرب",
                    "طوز خورماتو", "العوجة",
                ]
            },
            {
                Selected_Value: "القادسية",
                Showed_Value: [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر",
                ]
            },
            {
                Selected_Value: "كركوك",
                Showed_Value: [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق","كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة",
                    "يايجي",
                ]
            },
            {
                Selected_Value: "كربلاء المقدسة",
                Showed_Value: ["عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء",]
            },
            {
                Selected_Value: "المثنى",
                Showed_Value: ["الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان", "السماوة", "السوير",]
            },
            {
                Selected_Value: "ميسان",
                Showed_Value: [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير", "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم",
                    "كميت", "قلعة صالح",
                ]
            },
            {
                Selected_Value: "النجف الاشرف",
                Showed_Value: ["العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية", "النجف", "الشبكة",]
            },
            {
                Selected_Value: "نينوى",
                Showed_Value: [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة", "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة",
                    "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة", "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف", "وانة",
                    "زيلكان", "زمار", "الفاروق",
                ]
            },
            {
                Selected_Value: "واسط",
                Showed_Value: [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية", "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة",
                    "جصان", "شيخ سعد", "الحفرية (تاج الدين)", "ناحية واسط",
                ]
            },
        ];

       let Result = Values.find((Finding) => event == Finding.Selected_Value);

        if(Result){
            this.group_of_form[0].fields[35].properties[0].values = Result.Showed_Value;
        }else{
            this.group_of_form[0].fields[35].properties[0].values = [];
        }
    },

    //هل شاركت المدرسة سابقاً في مسابقات أو مبادرات
    Sixth_Hide(event){
        let Fields_Prog = [
            "Scientificcompetitions", //مسابقات علمية
            "activities", //أنشطة فنية
            "Exhibitions", //معارض
            "Voluntary", //مبادرات تطوعية
            "projects", //مشاريع تقنية
            "Other", //اخـــــــــــــــرى
        ],
        Fields_ID = [
            "90902", //نوع المشاركات السابقة
            "92250", //مسابقات علمية
            "90904", //أنشطة فنية
            "90905", //معارض
            "90906", //مبادرات تطوعية
            "90907", //مشاريع تقنية
            "90908", //اخـــــــــــــــرى
        ];

        Fields_Prog.forEach((Clearing) => this.inputFormField[Clearing] = null);

        if(event == "نعم"){
            Fields_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
            document.getElementById("90902").style.cssText =
                    "color: #630000; font-size: 20px; font-weight: bold; padding-top: 12px; padding-bottom: 12px; text-align: center;";
        }else{
            Fields_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    }
}