{
  if (this.tab_click == "form") {
    //"استمارة ترشيح مدرب/ة ضمن مبادرة الريادة والتميز"
    let First_Choice_Fields = [
        "90835", //الخبرة المهنية والتدريبية
        "90836", //ماهي النسبة المئوية النجاح لطلبتك خلال العام الماضي؟
        "90837", //هل سبق لك المشاركة في دورات تدريبية؟
        "90838", //ما مستوى معرفتك باستخدام الحاسوب؟
        "90842", //هل سبق لك تقديم ورشة او تدريب داخل المدرسة او خارجها؟
        "90844", //هل لديك خبرة في الانشطة اللاصفية او المبادرات الطلابية؟ مسابقات, معارض ,مشاريع طلابية ,او لجان مدرسية ؟
        "90848", //الجاهزية والالتزام
        "90849", //هل لديك موافقة مبدئية من ادارة المدرسة للمشاركة في المبادرة ؟
        "90850", //هل تستطيع حضور دورة اعداد المدربين الخاصة بالمبادرة ؟
        "90851", //هل تلتزم بتنفيذ ورش او انشطة داخل المدرسة بعد انتهاء التدريب؟
        "90852", //كم نشاطا تستطيع تنفيذه خلال الفصل الدراسي؟
        "90859", //عنوان المدرسة
        "91985", //المحافظة
        "91986", //القضاء
        "90862", //الناحية
        "90864", //المنطقة
        "90867", //جنس المدرسة
        "90874", //عدد الطلبة الكلي في المدرسة
        "90876", //الرابع الاعدادي
        "90878", //الخامس الاعدادي
        "90879", //السادس الاعدادي
        "90881", //معدل نسبة النجاح لاخر ثلاث اعوام للمراحل الثلاثة
      ],
      //"استمارة المدارس"
      Second_Choice_Fields = [
        "90888", //معلومات ادارة المدرسة (استمارة المدارس )
        "90889", //اسم مدير/ة المدرسة
        "90890", //رقم الهاتف (مدير/ة) المدرسة
        "90891", //البريد الالكتروني ان وجد (مدير/ة) المدرسة
        "90892", //اسم معاون /ة المدرسة
        "90893", //ماسبب رغبة المدرسة بالمشاركة في المبادرة
        "90894", //جاهزية المدرسة لتنفيذ المبادرة
        "90895", //هل توجد قاعة او مكان مناسب لتنفيذ الورش
        "90896", //هل توجد سبورة ذكية أو شاشة عرض
        "90897", //هل تستطيع المدرسة تخصيص وقت للأنشطة
        "90898", //عدد الطلبة المتوقع إشتراكهم
        "90899", //هل شاركت المدرسة سابقاً في مسابقات أو مبادرات
      ],
      Toruments_Type = [
        "90902", //نوع المشاركات السابقة
        "92250", //مسابقات علمية
        "90904", //أنشطة فنية
        "90905", //معارض
        "90906", //مبادرات تطوعية
        "90907", //مشاريع تقنية
        "90908", //اخـــــــــــــــرى
      ];

    if (
      this.form_data.slecter ===
      "استمارة ترشيح مدرب/ة ضمن مبادرة الريادة والتميز"
    ) {
      Second_Choice_Fields.forEach(
        (Hiding) =>
          (document.getElementById(Hiding).style.visibility = "collapse"),
      );

      Toruments_Type.forEach(
        (Hiding) =>
          (document.getElementById(Hiding).style.visibility = "collapse"),
      );
    }

    if (this.form_data.slecter === "استمارة المدارس") {
      First_Choice_Fields.forEach(
        (Hiding) =>
          (document.getElementById(Hiding).style.visibility = "collapse"),
      );

      if (this.form_data.participated != "نعم") {
        Toruments_Type.forEach(
          (Hiding) =>
            (document.getElementById(Hiding).style.visibility = "collapse"),
        );
      }
    }

    //اذا كانت الاجابة نعم اذكر اهم الدورات التي شاركت بها
    if (this.form_data.CERCL == null) {
      document.getElementById("90840").style.visibility = "collapse";
    }

    //هل سبق لك تقديم ورشة او تدريب داخل المدرسة او خارجها؟
    if (this.form_data.selone == null) {
      document.getElementById("90843").style.visibility = "collapse";
    }

    //هل لديك خبرة في الانشطة اللاصفية او المبادرات الطلابية؟ مسابقات, معارض ,مشاريع طلابية ,او لجان مدرسية ؟
    if (this.form_data.ree == null) {
      document.getElementById("90845").style.visibility = "collapse";
    }
  }
}
