{
    First_Function(Field_ID, Field_Prog, Field_State){
        for(var i = 0; i < Field_ID.length; i++){
            document.getElementById(Field_ID[i]).style.display = Field_State;
            this.inputFormField[Field_Prog[i]] = null;
        }
    },

    Third_Function(Field_ID, Field_Prog, Field_State){
        document.getElementById(Field_ID).style.display = Field_State;
        this.inputFormField[Field_Prog] = null;
    },

    First_Hide(event){
        var IDs = ["96282", "96283", "96284", "96285", "96286", "96287", "96288"],
        Progs = ["category", "ShNam", "Conect", "ResNum", "DecDate", "Msh", "Sign",];

        if(event == "نعم"){
            this.First_Function(IDs, Progs, "block");
        }else{
            this.First_Function(IDs, Progs, "none");
        }
    },

    getsubCities(event) {
        this.inputFormField["district"] = null; //تفريغ حقل الاقضية
        let Values = [
            {
                Selected_Value: "الانبار",
                Showed_Value: [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة",
                    "القائم", "كبيسة", "الكرمة", "النخيب", "هيت", "الوفاء", "الوليد",
                ]
            },
            {
                Selected_Value: "بابل",
                Showed_Value: [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة",
                    "جرف النصر (جرف الصخر)", "سدة الهندية",
                ]
            },
            {
                Selected_Value: "بغداد",
                Showed_Value: [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون", "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام",
                    "الرشيد", "الطارمية",//الكرخ
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", "الرصافة", "الصديق الاكبر", "التاجي", "الزهور", "فلسطين",
                    "الصدر الاولى", "الصدر الثانية", "بغداد الجديدة", "ذات السلاسل", //الرصافة
                ]
            },
            {
                Selected_Value: "البصرة",
                Showed_Value: [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب",
                    "طلحة", "أم قصر", "الامام الصادق",
                ]
            },
            {
                Selected_Value: "ديالى",
                Showed_Value: [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب",
                    "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", "قرة تبة", "سيف سعد",
                ]
            },
            {
                Selected_Value: "ذي قار",
                Showed_Value: [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور",
                    "كرمة بني سعد", "قلعة سكر", "سيد دخيل", "سوق الشيوخ", "عكيكة",
                ]
            },
            {
                Selected_Value: "صلاح الدين",
                Showed_Value: [
                    "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي", "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "العوجة",
                    "طوز خورماتو", "يثرب",
                ]
            },
            {
                Selected_Value: "القادسية",
                Showed_Value: [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر",
                ]
            },
            {
                Selected_Value: "كركوك",
                Showed_Value: [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق","كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة",
                    "يايجي",
                ]
            },
            {
                Selected_Value: "كربلاء المقدسة",
                Showed_Value: ["عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء",]
            },
            {
                Selected_Value: "المثنى",
                Showed_Value: ["الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان", "السماوة", "السوير",]
            },
            {
                Selected_Value: "ميسان",
                Showed_Value: [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير", "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم",
                    "كميت", "قلعة صالح",
                ]
            },
            {
                Selected_Value: "النجف الاشرف",
                Showed_Value: ["العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية", "النجف", "الشبكة",]
            },
            {
                Selected_Value: "نينوى",
                Showed_Value: [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة", "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة",
                    "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة", "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف", "وانة",
                    "زيلكان", "زمار", "الفاروق",
                ]
            },
            {
                Selected_Value: "واسط",
                Showed_Value: [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية", "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة",
                    "جصان", "شيخ سعد", "الحفرية (تاج الدين)", "ناحية واسط",
                ]
            },
        ];

        let Result = Values.find((Finding) => event == Finding.Selected_Value);
        if(Result){
            this.group_of_form[3].fields[0].properties[0].values = Result.Showed_Value;
        }else{
           this.group_of_form[3].fields[0].properties[0].values = [];
        }
    }, 

    Second_Filter(event){
        let Values = [
            {
                Selected_Value: "معهد التدريب النفطي/ بغداد",
                Showed_Value: [
                    "تربية الرصافة الأولى", "تربية الرصافة الثانية", "تربية الرصافة الثالثة", "تربية الكرخ الأولى", "تربية الكرخ الثانية", "تربية الكرخ الثالثة",
                    "تربية بابل", "تربية كربلاء المقدسة", "تربية النجف الاشرف", "تربية الديوانية", "تربية المثنى", "تربية واسط", "تربية ديالى",
                ],
            },
            { Selected_Value: "معهد التدريب النفطي/ بصرة", Showed_Value: ["تربية البصرة",] },
            { Selected_Value: "معهد التدريب النفطي/ بيجي", Showed_Value: ["تربية صلاح الدين", "تربية نينوى", "تربية الانبار",], },
            { Selected_Value: "معهد التدريب النفطي/ كركوك", Showed_Value: ["تربية كركوك", "تربية سليمانية", "تربية أربيل", "تربية دهوك", "تربية حلبجة",], },
            { Selected_Value: "معهد التدريب النفطي/ ميسان", Showed_Value: ["تربية ميسان", "تربية ذي قار",], },
        ];
        
        this.inputFormField["Edu"] = null;
        let Result = Values.find((Finding) => event === Finding.Selected_Value);
        if(Result){
            this.group_of_form[4].fields[1].properties[0].values = Result.Showed_Value;
        }else{
            this.group_of_form[4].fields[1].properties[0].values = ["اختر معهد التدريب النفطي"];
        }
    }, 

    Second_Hide(event){
        if(event == "صناعي"){
            this.Third_Function("96272", "Special", "block"); //الاختصاص
            this.Third_Function("96277", "degree", "none"); //درجة اللغة المضافة
            this.Third_Function("96279", "chance", "none"); //نظام المحاولات
        }else if(event == "علمي"){
            this.Third_Function("96272", "Special", "none"); //الاختصاص
            this.Third_Function("96277", "degree", "block"); //درجة اللغة المضافة
            this.Third_Function("96279", "chance", "block"); //نظام المحاولات
        }else{
            this.Third_Function("96272", "Special", "none"); //الاختصاص
            this.Third_Function("96277", "degree", "none"); //درجة اللغة المضافة
            this.Third_Function("96279", "chance", "none"); //نظام المحاولات
        }
    }, 

    Third_Hide(event){
        this.inputFormField["ReligionName"] = null;
        if(event === "اخرى"){
            document.getElementById("96260").style.display = "block"; //اسم الديانة الاخرى
        }else{
            document.getElementById("96260").style.display = "none"; //اسم الديانة الاخرى
        }
    }
}