{
    //لاضافة قيم اقضية البصرة فقط
    First_Function(FieldNum){
        this.group_of_form[0].fields[FieldNum].properties[0].values = [
            "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", 
            "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "أم قصر", "الامام الصادق",
        ];
    },

    Second_Function(Field_ID, Field_Prog, Field_State){
        document.getElementById(Field_ID).style.display = Field_State;
        this.inputFormField[Field_Prog] = null;
    },

    Third_Function(event, FieldNumber){
        var getdistinct =
        [
            [
                "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", "العامرية", 
                "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة", "النخيب", "هيت", "الوفاء", "الوليد"
            ],//اقضية الانبار
            [
                "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", "المسيب", 
                "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"
            ],//اقضية بابل
            [
                "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون",
                "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية", "ابناء الرافدين", "الاعظمية",
                "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", "الرصافة", "الصديق الاكبر", 
                "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة", "ذات السلاسل", "فلسطين"
            ],//اقضية بغداد
            [
                "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية",
                "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين",
                "مندلي", "قرة تبة", "سيف سعد"
            ],//اقضية ديالى
            [
                "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش",
                "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل", 
                "سوق الشيوخ", "عكيكة"
            ],//اقضية ذي قار
            [
                "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي",
                "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "طوز خورماتو", "يثرب", "العوجة"
            ],//اقضية صلاح الدين
            [
                "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية",
                "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"
            ],//اقضية القادسية
            [
                "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق", "كركوك",
                "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"
            ],//اقضية كركوك
            [
                "عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"
            ],//اقضية كربلاء
            [
                "الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان",
                "السماوة", "السوير"
            ],//اقضية المثنى
            [
                "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير",
                "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"
            ],//اقضية ميسان
            [
                "العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية", "النجف","الشبكة"
            ],//اقضية النجف
            [
                "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة",
                "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة",
                "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف",
                "وانة", "زيلكان", "زمار", "الفاروق"
            ],//اقضية نينوى
            [
                "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية",
                "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)",
                "ناحية واسط"
            ],//اقضية واسط
        ],
        Values = [
            "الانبار", "بابل", "بغداد", "ديالى", "ذي قار", "صلاح الدين",
            "القادسية", "كركوك", "كربلاء المقدسة", "المثنى", "ميسان",
            "النجف الاشرف", "نينوى", "واسط",
        ];

        for(var i = 0; i < Values.length; i++){
            if(event == Values[i]){
                this.group_of_form[0].fields[FieldNumber].properties[0].values = getdistinct[i];
                break;
            }else{
                this.group_of_form[0].fields[FieldNumber].properties[0].values = [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", 
                    "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق",
                ];
            }
        }
    },

    FirstHide(event){
        var First_Fields_IDs = [
            "67373",//القضاء الحالي
            "67375",//القضاء الذي ينقل الاثاث اليه

            "67372",//المحافظة الحالية
            "67374",//المحافظة التي ينقل الاثاث اليها
        ],
        First_Fields_Progs = [
            "district",//القضاء الحالي
            "districtto",//القضاء الذي ينقل الاثاث اليه

            "governorate",//المحافظة الحالية
            "governmentto",//المحافظة التي ينقل الاثاث اليها
        ];
        
        if(event == "نقل داخل المحافظة"){
            for(var i = 0; i < First_Fields_IDs.length; i++){
                if(i < 2){
                    this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "block");
                }else{
                    this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "none");
                }
            }
            this.First_Function(18);
            this.First_Function(20);
        }else if(event == "نقل من محافظة البصرة الى محافظة اخرى"){
            for(var i = 0; i < First_Fields_IDs.length; i++){
                if(i == 2){
                    this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "none");
                }else{
                    this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "block");
                }
            }
            this.First_Function(18);
        }else if(event == "نقل من محافظة اخرى الى محافظة البصرة"){
            for(var i = 0; First_Fields_IDs.length; i++){
                if(i == 3){
                    this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "none");
                }else{
                    this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "block");
                }
            }
            this.First_Function(20);
        }else{
            for(var i = 0; i < First_Fields_IDs.length; i++){
                this.Second_Function(First_Fields_IDs[i], First_Fields_Progs[i], "none");
            }
        }
    },

    SecondHide(event){
        this.Third_Function(event, 20);
    },

    ThirdHide(event){
        this.Third_Function(event, 18);
    },
}