{
    First_Function(Field_ID, Field_Prog, Field_State){
        document.getElementById(Field_ID).style.display = Field_State;
        this.inputFormField[Field_Prog] = null;
    },

    First_Filter_Function(event, Field_Prog, Field_Location){
        this.inputFormField[Field_Prog] = null;
        var getdistinct =
            [
                [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية",
                    "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة",
                    "النخيب", "هيت", "الوفاء", "الوليد"
                ],//اقضية الانبار
                [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع",
                    "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"
                ],//اقضية بابل
                [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", 
                    "المأمون", "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية", "ابناء الرافدين",
                    "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة",  "الراشدية", "الرصافة", 
                    "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة", 
                    "ذات السلاسل", "فلسطين"
                ],//اقضية بغداد
                [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", 
                    "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق"
                ],//اقضية البصرة
                [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", 
                    "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", 
                    "قرة تبة", "سيف سعد"
                ],//اقضية ديالى
                [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", 
                    "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل", 
                    "سوق الشيوخ", "عكيكة"
                ],//اقضية ذي قار
                [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", 
                    "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"
                ],//اقضية القادسية
                [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق", "كركوك", 
                    "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"
                ],//اقضية كركوك
                [
                    "عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"
                ],//اقضية كربلاء
                [
                    "الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان",
                    "السماوة", "السوير"
                ],//اقضية المثنى
                [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير",
                    "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"
                ],//اقضية ميسان
                [
                    "العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية",
                    "النجف", "الشبكة"
                ],//اقضية النجف
                [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة",
                    "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة",
                    "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف",
                    "وانة", "زيلكان", "زمار", "الفاروق"
                ],//اقضية نينوى
                [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية",
                    "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)",
                    "ناحية واسط"
                ],//اقضية واسط
            ],
            Selected_Values = [
                "الانبار",
                "بابل",
                "بغداد",
                "البصرة",
                "ديالى",
                "ذي قار",
                "القادسية",
                "كركوك",
                "كربلاء المقدسة",
                "المثنى",
                "ميسان",
                "النجف الاشرف",
                "نينوى",
                "واسط",
            ];

            for(var i = 0; i < Selected_Values.length; i++){
                if(event == Selected_Values[i]){
                    this.group_of_form[0].fields[Field_Location].properties[0].values = getdistinct[i];
                    break;
                }else{
                    this.group_of_form[0].fields[Field_Location].properties[0].values = [];
                }
            }
    },

    First_Hide(event){
        var First_Option_IDs = [
            "47870",//المحافظة الحالية
            "47871",//القضاء الحالي
            "68059",//المحافظة التي ينقل اليها
            "67815",//القضاء الذي ينقل اليه
        ],
        First_Option_Progs = [
            "governorate",//المحافظة الحالية
            "district",//القضاء الحالي
            "gover",//المحافظة التي ينقل اليها
            "governmentto",//القضاء الذي ينقل اليه
        ];

        for(var i = 0; i < First_Option_IDs.length; i++){
            if(event == "نقل من محافظة صلاح الدين الى محافظات اخرى"){
                if(i > 1){
                    this.First_Function(First_Option_IDs[i], First_Option_Progs[i], "block");
                }else{
                    this.First_Function(First_Option_IDs[i], First_Option_Progs[i], "none");
                }
            }else if(event == "نقل من محافظات اخرى الى محافظة صلاح الدين"){
                if(i < 2){
                    this.First_Function(First_Option_IDs[i], First_Option_Progs[i], "block");
                }else{
                    this.First_Function(First_Option_IDs[i], First_Option_Progs[i], "none");
                }
            }else{
                this.First_Function(First_Option_IDs[i], First_Option_Progs[i], "none");
            }
        }
    },

    First_Filter(event){
        this.First_Filter_Function(event , "district", 14);
    },

    Second_Filter(event){
        this.First_Filter_Function(event , "governmentto", 16);
    }
}