{
  this.group_of_form[0].fields[13].properties[0].values = [
    "بغداد",
    "بابل",
    "البصرة",
    "ذي قار",
    "المثنى",
    "الانبار",
    "كركوك",
    "واسط",
    "كربلاء المقدسة",
    "النجف الاشرف",
    "القادسية",
    "ديالى",
    "نينوى",
    "ميسان",
  ];

  this.group_of_form[0].fields[15].properties[0].values = [
    "بغداد",
    "بابل",
    "البصرة",
    "ذي قار",
    "المثنى",
    "الانبار",
    "كركوك",
    "واسط",
    "كربلاء المقدسة",
    "النجف الاشرف",
    "القادسية",
    "ديالى",
    "نينوى",
    "ميسان",
  ];
}
