{
    singleNotification(notifyText, position) {
        this.$toast.error(notifyText, {
          position: position,
          timeout: 6000,
          closeOnClick: false,
          pauseOnFocusLoss: true,
          pauseOnHover: true,
          draggable: true,
          draggablePercent: 0.6,
          showCloseButtonOnHover: false,
          hideProgressBar: false,
          closeButton: "button",
          icon: true,
          rtl: true
        });
      },

      First_Hide(event) {
        let Groups_ID = [
          "35309_group", //البيانات الشخصية
          "35311_group", // الأستعداد للتحول الرقمي
          "35312_group", //الأستعداد النفسي والمهني للتحول الرقمي
          "35313_group", //المهارات الرقمية الأساسية
          "35314_group", //كفاءت البنية التقنية المتاحة
          "35315_group", //الانظمة والبرامج الالكترونية
          "35316_group", //الدورات التدريبية التي تحتاجها لتكون جاهز للتحول الرقمي
          "35317_group", //مقترحاتك لتحسين التحول الرقمي
          "35320_group", //البيانات الأساسية للتشكيل
          "35321_group", //أستعداد التشكيل للتحول الرقمي
          "35322_group", //مقترحاتك لتحسين التحول الرقمي.
        ];

        let Fields_Prog = [
          //البيانات الشخصية
          "namejob", //العنوان الوظيفي
          "namebb", //التشكيل
          "namerr", //القسم
          //الأستعداد للتحول الرقمي
          "namename", //هل لديك الأستعداد للتحول الرقمي؟
          //البيانات الأساسية للتشكيل
          "bname", //التشكيل
          "number", //عدد الموظفين الحاليين
          //أستعداد التشكيل للتحول الرقمي
          "fgfdgdfrhh", //هل عدد الموظفين كاف للعمل الرقمي ؟
          "jhdsvikhweif", //هل تتوفر أنظمة رقمية متكاملة وحديثة ؟
          "qwdfgrvds", //هل الأجهزة المتوفرة كافية وحديثة ؟
          "qwasezdq", //هل الموظفين بحاجة الى دورات تدريب رقمي؟
          "ajkdhjdjdxbx", //هل التشكيل بحاجة الى استحداث ............ معني بالتحول الرقمي ؟
          //مقترحاتك لتحسين التحول الرقمي.
          "namerdsw", //مقترحاتك لتحسين التحول الرقمي
        ];

        let PhoneNumbers = [
          "9647710945050", //نبيل اميلي هواس
          "9647707101805", //مصطفى جاسم هادي
          "9647702534760", //عباس صالح حسن
          "9647702534760", //رسل عامر براك
          "9647719758854", //رسل عامر براك
          "9647730999700", //احمد عبدالله ساجت
          //"9647811911618", //يوسف احسان علي
          "9647706242275", //كرار حيدر
          "9647708860872", //علي غني
          "9647718267149", //ماريا 
          "9647712728880", //احمد جناح
          "9647803233322", // بشرى كاظم جبر فرع كربلاء المقدسة
          "9647735381409", // مرام محمد حلوص اسود فرع النجف الأشرف
          "9647745976333", // أسماء نصير محمد فرع محافظة الديوانية
          "9647727116695", // رشا عبدالجليل غازي فرع محافظة بابل
          "9647701230669", // مصطفى رفعت إبراهيم فرع محافظة صلاح الدين
          "9647701794303", // منهل نجيب محمد صالح فرع محافظة نينوى
          "9647708880839", // محمد جاسم سطام مكتب سامراء
          "9647704007970", // مصطفى جمعة احمد فرع محافظة كركوك
          "9647517921402", // حسين معتز حسن مكتب سنجار
          "9647503168042", // سالم عاصم عبدالمجيد احمد مكتب تلعفر
          "9647737078112", // فضاء عبدالكريم احمد مكتب الحمدانية
          "9647722748334", // رنا حسين كاظم فرع محافظة البصرة
          "9647830895286", // كرار شريف حسن فرع محافظة ذي قار
          "9647705565504", // هاشم علي حسين فرع محافظة ميسان
          "96478101336787", //! سفاح نعمة صباح فرع محافظة المثنى
          "9647825804146", // احمد علي جواد فرع محافظة بغداد / الكرخ
          "9647920241181", // علي عبد الحميد مزعل فرع محافظة الأنبار
          "9647734311807", // حيدر جميل فرج فرع محافظة واسط
          "964770532895", //! زينب رضا ساجي فرع محافظة بغداد الرصافة
          "9647830222208", // وسام محمد ضاري مكتب الفلوجة
          "9647703933219", // عدي لطيف قاسم مكتب قضاء خانقين
          "9647768325299", // محمد طه عزت مكتب محافظة ديالى
          "964774085559", //! أشرف نشوان عبدالقـتاح فرع محافظة دهوك
          "96407719611833", //! إسراء شاكر توفيق فرع محافظة أربيل
          "9647705291101", // ميس قتيبة نجيب فرع محافظة السليمانية
        ];

        Fields_Prog.forEach((Clearing) => this.inputFormField[Clearing] = null);

        let Values = [{
            Selected_Value: "موظف",
            Block_Groups: ["35309_group", "35311_group", ],
            Hide_Groups: ["35320_group", "35321_group", "35322_group", ],
          },
          {
            Selected_Value: "مدير",
            Block_Groups: ["35320_group", "35321_group", "35322_group", ],
            Hide_Groups: ["35309_group", "35311_group", ],
          },
        ];

        let Result = Values.find((Finding) => event === Finding.Selected_Value);

        if (Result && PhoneNumbers.includes(this.user.phone_num)) {
          Result.Block_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
          Result.Hide_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else if(Result && !PhoneNumbers.includes(this.user.phone_num)){
          this.singleNotification("رقم الهاتف غير مطابق مع المخول ", "top-right");
          this.inputFormField["nameselecter"] = null; //تحديد نوع الأستبيان
        } else {
          Groups_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }

        // if (Result && !PhoneNumbers.includes(this.user.phone_num)) {
        //   Groups_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");

        //   this.singleNotification("رقم الهاتف غير مطابق مع المخول ", "top-right");
        // }
      },

      Second_Hide(event) {
        this.inputFormField["namethan"] = null;
        if (event.includes("اخرى")) {
          document.getElementById("89571").style.display = "block";
        } else {
          document.getElementById("89571").style.display = "none";
        }
      },

      //هل لديك استعداد للتحول الرقمي؟
      Third_Hide(event) {
        let Fields_Prog = [
          //الأستعداد النفسي والمهني للتحول الرقمي
          "nem", //مدى رغبتك في المشاركة بأنتظام في أنشظة التطوير المهني الرقمي؟
          "new", //أستعدادك لأستخدام التطبيق والأنظمة الجديدة الداعمة للتحول الرقمي؟
          "nzq", //مدى تقبلك للأستغناء الكامل عن المعاملات الورقية التقليدية؟
          //المهارات الرقمية الأساسية
          "zeawqws", //مدى ألمامك بالمهارات الأساسية للحاسوب (تشغيل ، أنشاء ملفات ، طباعة)؟
          "zxcvb", //كفاءتك في برنامج Microsoft Word لأعداد الكتب والتقارير الأدارية؟
          "zxcdsa", //كفائتك في بنامج Microsoft Excel لأدخال البيانات وتحليلها؟
          "zawdftg", //كفاءتك في برنامج Microsoft PowerPoint لأعداد العروض التقديمية؟
          "zcsfgh", //كفاءتك في استخدام التخزين السحابي ( One Drive ' Google Drive )؟
          //كفاءت البنية التقنية المتاحة
          "bnhsf", //كفاية أجهزة الحاسوب المتاحة لأداء المهام الوظفية؟
          "qwsdcvb", //كفاءة الطابعات والماسحات الضوئية المتاحة والعملية؟
          "qwezxdsa", //توفير الأجهزة اللوحية اثناء الأعمال الميدانية؟
          "zxasqwerdfcv", //كفاءة الدعم الفني المتاح عند حدوث الأعطال التقنية؟
          "kjasdgcves", //أداء الشبكة في دعم أنجازهم المهام الوظيفية بكفاءة؟
          //الانظمة والبرامج الالكترونية
          "sdsdcvdsvsd", //مدى فعالية الأنظمة الألكترونية في دعم أنجاز العمل؟
          "zxsadvsgre", //مدى سهولة أستخدام واجهات البرنامج الأدارية المتاحة؟
          "zxcvgfsdawe", //مدى رضاك الشخصي عن الأنظمة الرقمية المتاحة حالياً؟
          "awsqsdewfrv", //مدى كفاءتك الشخصية في التعامل مع الأرشفة الألكترونية؟
          "lkjhgds", //مدى كفاءتك الشخصية في استخدام منصة "اور" (انشاء الحساب،تسجيل الدخول،ملء الأستمارة)؟
          "okjhsdffggsa", //مدى كفاءتك الشخصية في أدارة المراسلات عبر البريد الألكتروني الرسمي؟
          //الدورات التدريبية التي تحتاجها لتكون جاهز للتحول الرقمي
          "nameawy", //الدورات التدريبية التي تحتاجها لتكون جاهز للتحول الرقمي
          //مقترحاتك لتحسين التحول الرقمي
          "uhbname", //مقترحك لتحسين التحول الرقمي
        ];

        Fields_Prog.forEach((Clearing) => this.inputFormField[Clearing] = null);

        let Groups_ID = ["35312_group", "35313_group", "35314_group", "35315_group", "35316_group", "35317_group", ];

        if (event === "نعم") {
          Groups_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
        } else {
          Groups_ID.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
      }
  }