{
  this.group_of_form[0].fields[1].properties[0].values = ["بغداد"];
  this.group_of_form[0].fields[2].properties[0].values = [
    "مديرية الكاظمية الثانية",
    "مديرية الكرخ الأولى",
    "مديرية الكرخ الثانية",
    "مديرية الكاظمية الأولى",
    "مديرية الرصافة الاولى",
    "مديرية الرصافة الثانية",
    "مديرية مدينة الصدر الثانية",
    "مديرية البياع",
    "مديرية الاعظمية",
    "مديرية مدينة الصدر الاولى",
    "مديرية الشعب",
    "بسماية",
    "الطارمية",
    "مديرية أبي غريب",
    "مديرية الزهور",
    "مديرية المدائن",
    "مديرية الدورة",
    "الوحدة",
    "ملاحظية التاجي",
    "مديرية المحمودية",
  ];
}
