{
  //الايام المتوفرة لحجز موعد
  /*
  this.group_of_form[0].fields[6].properties[0].values = [
    //"السبت",
    "الاحد",
    "الاثنين",
    //"الثلاثاء",
    "الاربعاء",
    //"الخميس",
    //"الجمعة",
  ];
  */

  //الاقسام المتوفرة للزيارة
  this.group_of_form[0].fields[5].properties[0].values = [
    "سجن بغداد المركزي",
    "سجن العدالة ١",
    "سجن عدالة ٢",
    //"سجن البلديات",
    //"الرصافة١",
    //"الرصافة ٢",
    //"الرصافة٣",
    //"الرصافة ٤",
    //"الرصافة ٥",
    //"سجن النساء رصافة ٦",
    //"الرصافة ٧",
    //"سجن النساء المركزي",
    //"سجن سوسي",
    //"سجن جمجمال",
    //"سجن بابل المركزي",
    //"سجن الحلة رجال",
    //"سجن الحلة نساء",
    //"سجن الناصرية المركزي",
    //"سجن الناصرية احكام خفيفة",
    //"سجن ديالى",
    //"سجن البصرة",
    //"سجن العمارة",
    //"سجن السماوة",
    //"سجن الحماية القصوى",
  ];

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  //مال عزيزي المواطن
  document.getElementById("74051").style.cssText =
    "color: red; font-size: 18px; font-weight: bold; padding-top: 15px; padding-bottom: 15px";
}
