{
  this.group_of_form[0].fields[5].properties[0].values = [
    "مكتب وكيل الوزارة الاقدم",
    "مكتب وكيل الوزارة للشؤون الادارية والمالية",
    "الدائرة الادارية والمالية",
    "دائرة التسجيل العقاري",
    "دائرة رعاية القاصرين",
    "دائرة الكتاب عدول",
    "دائرة التنفيذ",
    "دائرة التخطيط العدلي",
    "دائرة العلاقات العدلية",
    "دائرة القانونية",
    "دائرة الوقائع العراقية",
    "مكتب الوزير قسم العقود",
    "مكتب الوزير قسم التصاريح الامنية",
    "مكتب الوزير سكرتارية مجلس العدل",
    "مكتب الوزير ( شؤون المواطنين/ الاصلاح العراقية/ الاحداث)",
  ];
}
