{
    getsubCities(event) {
        this.inputFormField["district"] = null;
        var getdistnict =
            [
                ["بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة", "النخيب", "هيت", "الوفاء", "الوليد"],//اقضية الانبار
                ["أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"],//اقضية بابل
                ["ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون", "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية",
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة", "ذات السلاسل", "شارع فلسطين"],//اقضية بغداد
                ["أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق"],//اقضية البصرة
                ["أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", "قرة تبة", "سيف سعد"],//اقضية ديالى
                ["الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل", "سوق الشيوخ", "عكيكة"],//اقضية ذي قار
                ["الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي", "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "طوز خورماتو", "يثرب", "العوجة"],//اقضية صلاح الدين
                ["الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"],//اقضية القادسية
                ["دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق", "كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"],//اقضية كركوك
                ["عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"],//اقضية كربلاء
                ["الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان", "السماوة", "السوير"],//اقضية المثنى
                ["العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير", "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"],//اقضية ميسان
                ["العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية", "النجف", "الشبكة"],//اقضية النجف
                ["العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة", "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة", "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف", "وانة", "زيلكان", "زمار", "الفاروق"],//اقضية نينوى
                ["الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية", "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)", "ناحية واسط"],//اقضية واسط
            ];

        var x = event;
        if (x == "الانبار") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[0];
        } else if (x == "بابل") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[1];
        } else if (x == "بغداد") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[2];
        } else if (x == "البصرة") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[3];
        } else if (x == "ديالى") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[4];
        } else if (x == "ذي قار") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[5];
        } else if (x == "صلاح الدين") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[6];
        } else if (x == "القادسية") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[7];
        } else if (x == "كركوك") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[8];
        } else if (x == "كربلاء المقدسة") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[9];
        } else if (x == "المثنى") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[10];
        } else if (x == "ميسان") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[11];
        } else if (x == "النجف الاشرف") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[12];
        } else if (x == "نينوى") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[13];
        } else if (x == "واسط") {
            this.group_of_form[0].fields[1].properties[0].values = getdistnict[14];
        } else {
            this.group_of_form[0].fields[1].properties[0].values = [];
        }
    },

    FirstHide(event){
        if(event == "نعم"){
            document.getElementById("51480").style.display = "block";
            this.inputFormField["ProjectAdds"] = null;
        }else{
            document.getElementById("51480").style.display = "none";
            this.inputFormField["ProjectAdds"] = null;
        }
    },

    SecondHide(event){
        if(event == "اكثر من 6 شهور"){
            document.getElementById("51482").style.display = "block";
            this.inputFormField["TimeDuration"] = null;
        }else{
            document.getElementById("51482").style.display = "none";
            this.inputFormField["TimeDuration"] = null;
        }
    },

    ThirdHide(event){
        if(event == "نعم"){
            document.getElementById("51484").style.display = "block";
            this.inputFormField["WriteOpinions"] = null;
        }else{
            document.getElementById("51484").style.display = "none";
            this.inputFormField["WriteOpinions"] = null;
        }
    }
}