{
    First_Hide(event){
        let First_Fields_Group = [
            "92622", //المحافظة الحالية.
            "92631", //عنوان السكن الحالي.
            "92626", //المحافظة المطلوب نقل الأثاث لها.
        ],
        Second_Fields_Group = [
            "89585", //محل الولادة
            "89586", //تاريخ الولادة
            "89587", //الحالة الاجتماعية
            "89593", //رقم بطاقة السكن
            "89595", //جهة اصدار بطاقة السكن
            "52902", //رقم البطاقة الوطنية الموحدة
            "89590", //جهة اصدار البطاقة الوطنية
            "89591", //رقم البطاقة التمونية
            "89592", //اسم مركز التموين
            "89609", //رقم المركز التمويني
            "89588", //اسم الزوجة الثلاثي واللقب
            "89597", //العنوان السابق مع اقرب نقطة دالة
            "52905", //المحافظة الحالية
            "89598", //العنوان الحالي مع اقرب نقطة دالة
            "89599", //عنوان العمل الحالي
            "89600", //اسم المختار الحالي
            "89602", //رقم العقار
            "89601", //نوع السكن
            "89604", //هل كنت منتمي لحزب البعث المقبور
            "89606", //هل كنت منتسباً بالاجهزة الامنية في النظام البائد
        ],
        Fields_Prog = [
            //"نقل الأثاث نقل من المحافظات الى محافظة النجف الاشرف"
            "governor", //المحافظة الحالية.
            "addrees", //عنوان السكن الحالي.
            "governorate", //المحافظة المطلوب نقل الأثاث لها.
            //"نقل بطاقة السكن من المحافظات الى محافظة النجف الاشرف"
            "loca", //محل الولادة
            "dat", //تاريخ الولادة
            "mar", //الحالة الاجتماعية
            "numberr", //رقم بطاقة السكن
            "formmm", //جهة اصدار بطاقة السكن
            "Cardnumber", //رقم البطاقة الوطنية الموحدة
            "location", //جهة اصدار البطاقة الوطنية
            "numb", //رقم البطاقة التمونية
            "namee", //اسم مركز التموين
            "numbertam", //رقم المركز التمويني
            "name", //اسم الزوجة الثلاثي واللقب
            "ader", //العنوان السابق مع اقرب نقطة دالة
            "egovernorate", //المحافظة الحالية
            "aders", //العنوان الحالي مع اقرب نقطة دالة
            "job", //عنوان العمل الحالي
            "namemok", //اسم المختار الحالي
            "numaqar", //رقم العقار
            "typr", //نوع السكن
            "areyou", //هل كنت منتمي لحزب البعث المقبور
            "arey", //هل كنت منتسباً بالاجهزة الامنية في النظام البائد
        ];

        Fields_Prog.forEach((Clearing) => this.inputFormField[Clearing] = null);

        let Values = [
            {
                Selected_Value: "نقل بطاقة السكن من المحافظات الى محافظة النجف الاشرف",
                Showed_Fields: Second_Fields_Group,
                Hide_Fields: First_Fields_Group,
            },
            {
                Selected_Value: "نقل الاثاث من والى محافظة النجف الاشرف",
                Showed_Fields: First_Fields_Group,
                Hide_Fields: Second_Fields_Group,
            },
        ];

        let Result = Values.find((Finding) => event === Finding.Selected_Value);
        if(Result){
            Result.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
            Result.Hide_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else{
            First_Fields_Group.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            Second_Fields_Group.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    Second_Hide(event){
        //المحافظة المطلوب نقل الأثاث لها.
        if(event == "النجف الاشرف"){
            this.group_of_form[0].fields[3].properties[0].values = [
                "بغداد", "بابل", "البصرة", "ذي قار", "المثنى", "الانبار", "كركوك", "واسط", "كربلاء المقدسة", "القادسية", "صلاح الدين", "ديالى", "نينوى", "ميسان"
            ];
        }else{
            this.group_of_form[0].fields[3].properties[0].values = [
                "بغداد", "بابل", "البصرة", "ذي قار", "المثنى", "الانبار", "كركوك", "واسط", "كربلاء المقدسة", "النجف الاشرف", "القادسية", "صلاح الدين", "ديالى", "نينوى", "ميسان"
            ];
        }
    },

    Third_Hide(event){
        //اختر المحافظة
        if(event == "النجف الاشرف"){
            this.group_of_form[0].fields[1].properties[0].values = [
                "بغداد", "بابل", "البصرة", "ذي قار", "المثنى", "الانبار", "كركوك", "واسط", "كربلاء المقدسة", "القادسية", "صلاح الدين", "ديالى", "نينوى", "ميسان"
            ];
        }else{
            this.group_of_form[0].fields[1].properties[0].values = [
                "بغداد", "بابل", "البصرة", "ذي قار", "المثنى", "الانبار", "كركوك", "واسط", "كربلاء المقدسة", "النجف الاشرف", "القادسية", "صلاح الدين", "ديالى", "نينوى", "ميسان"
            ];
        }
    }
}