{
  if (this.tab_click == "form") {
    let Values = [
      {
        Selected_Value: "نقل بطاقة السكن من المحافظات الى محافظة النجف الاشرف",
        Hide_Fields: [
          "92622", //المحافظة الحالية.
          "92631", //عنوان السكن الحالي.
          "92626", //المحافظة المطلوب نقل الأثاث لها.
        ],
      },
      {
        Selected_Value: "نقل الاثاث من والى محافظة النجف الاشرف",
        Hide_Fields: [
          "89585", //محل الولادة
          "89586", //تاريخ الولادة
          "89587", //الحالة الاجتماعية
          "89593", //رقم بطاقة السكن
          "89595", //جهة اصدار بطاقة السكن
          "52902", //رقم البطاقة الوطنية الموحدة
          "89590", //جهة اصدار البطاقة الوطنية
          "89591", //رقم البطاقة التمونية
          "89592", //اسم مركز التموين
          "89609", //رقم المركز التمويني
          "89588", //اسم الزوجة الثلاثي واللقب
          "89597", //العنوان السابق مع اقرب نقطة دالة
          "52905", //المحافظة الحالية
          "89598", //العنوان الحالي مع اقرب نقطة دالة
          "89599", //عنوان العمل الحالي
          "89600", //اسم المختار الحالي
          "89602", //رقم العقار
          "89601", //نوع السكن
          "89604", //هل كنت منتمي لحزب البعث المقبور
          "89606", //هل كنت منتسباً بالاجهزة الامنية في النظام البائد
        ],
      },
    ];

    let Result = Values.find(
      (Finding) => this.form_data.selecter === Finding.Selected_Value,
    );

    if (Result) {
      Result.Hide_Fields.forEach(
        (Hiding) =>
          (document.getElementById(Hiding).style.visibility = "collapse"),
      );
    }
  }
}
