{
    First_Filter(event){
        this.inputFormField["district"] = null;

        let Values = [
            {
                Selected_Value: "الانبار", 
                Showed_Value: [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة",
                    "القائم", "كبيسة", "الكرمة", "النخيب", "هيت", "الوفاء", "الوليد",
                ]
            },
            {
                Selected_Value: "بابل", 
                Showed_Value: [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة",
                    "جرف النصر (جرف الصخر)", "سدة الهندية",
                ]
            },
            {
                Selected_Value: "بغداد", 
                Showed_Value: [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون", "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام",
                    "الرشيد", "الطارمية",//الكرخ
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية",
                    "التاجي", "الزهور", "بغداد الجديدة", "ذات السلاسل", "فلسطين",//الرصافة
                ]
            },
            {
                Selected_Value: "البصرة", 
                Showed_Value: [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب",
                    "طلحة", "أم قصر", "الامام الصادق",
                ]
            },
            {
                Selected_Value: "ديالى", 
                Showed_Value: [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب",
                    "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", "قرة تبة", "سيف سعد",
                ]
            },
            {
                Selected_Value: "ذي قار", 
                Showed_Value: [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار",
                    "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل", "سوق الشيوخ", "عكيكة",
                ]
            },
            {
                Selected_Value: "صلاح الدين", 
                Showed_Value: [
                    "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي", "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت",
                    "طوز خورماتو", "يثرب", "العوجة",
                ]
            },
            {
                Selected_Value: "القادسية", 
                Showed_Value: [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر",  
                ]
            },
            {
                Selected_Value: "كربلاء المقدسة", 
                Showed_Value: [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق", "كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان",
                    "تازة", "يايجي",
                ]
            },
            {
                Selected_Value: "كركوك", 
                Showed_Value: ["عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء",]
            },
            {
                Selected_Value: "المثنى", 
                Showed_Value: ["الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان", "السماوة", "السوير",]
            },
            {
                Selected_Value: "ميسان", 
                Showed_Value: [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير", "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم",
                    "كميت", "قلعة صالح",
                ]
            },
            {
                Selected_Value: "النجف الاشرف",
                Showed_Value: ["العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية", "النجف", "الشبكة",]
            },
            {
                Selected_Value: "نينوى", 
                Showed_Value: [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة", "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "برطلة",
                    "الحمدانية (بغديدا)", "بعشيقة", "فايدة", "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف", "وانة", "زيلكان",
                    "زمار", "الفاروق",
                ]
            },
            {
                Selected_Value:  "واسط", 
                Showed_Value: [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية", "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة",
                    "جصان", "شيخ سعد", "الحفرية (تاج الدين)", "ناحية واسط",
                ]
            },
        ];

        Values.filter((Right) => {
            if(Right.Selected_Value == event){
                this.group_of_form[0].fields[10].properties[0].values = Right.Showed_Value;
            }
        });
    },

    First_Hide(event){
        let Fields_Prog = [
            "FirstTable", //معلومات عن الاطفال
            //الحالة الاجتماعية
            "birthdayabsoiute", //تاريخ الطلاق
            "birthdaydeath", //تاريخ وفاة الزوج ( الزوجة)
            "birthdaymarried", //تاريخ الزواج
            "namespouwife", //اسم الزوج ( الزوجة)
            "cardspouwife", //رقم البطاقة الموحدة  للزوج ( الزوجة)
            "salary", //هل الزوجة ربة بيت وليس لها دخل ؟
            "associate", //هل الزوجة ( الزوج ) منتسبا :
            "combinesalary", //هل تطلب انت وزوجتك ( زوجك ) دمج المدخولات ؟
            //استمارة بيان قيام الزوجية وعدد الاولاد
            "firname", //الاسم الاول
            "secname", //الاسم الثاني
            "thiname", //الاسم الثالث
            "founame", //الاسم الرابع
            "maritstut", //الحالة الزوجية
            "nation", //جنسية الزوج ( الزوجة )
            "datemari", //التاريخ اذا كنت متزوج او أرمل او مطلق
            "boysname", //اسماء الابناء
        ];

        //المتزوج
        let First_Option = [
            "87252", //تاريخ الزواج
            "87253", //اسم الزوج ( الزوجة)
            "87255", //رقم البطاقة الموحدة  للزوج ( الزوجة)
            "87258", //هل الزوجة ربة بيت وليس لها دخل ؟
            "87260", //هل الزوجة ( الزوج ) منتسبا :
            "87322", //هل تطلب انت وزوجتك ( زوجك ) دمج المدخولات ؟
        ],
        //ارمل
        Second_Option = [
            "87256", //تاريخ وفاة الزوج ( الزوجة)
        ],
        //مطلق
        Third_Option = [
            "87254", //تاريخ الطلاق
        ];

        //تفريغ الحقول
        Fields_Prog.forEach((ClearData) => {
            this.inputFormField[ClearData] = null;
        });

        let Values = [
            {
                Selected_Value: "متزوج",
                Showed_Fields: First_Option,
                Hide_Fields: [
                    ...Second_Option,
                    ...Third_Option
                ],
            },
            {
                Selected_Value: "أرمل",
                Showed_Fields: Second_Option,
                Hide_Fields: [
                    ...First_Option,
                    ...Third_Option,
                ],
            },
            {
                Selected_Value: "مطلق",
                Showed_Fields: Third_Option,
                Hide_Fields: [
                    ...First_Option,
                    ...Second_Option
                ],
            },
        ];

        let Result = Values.find((Finding) => event === Finding.Selected_Value);
        if(Result){
            document.getElementById("89137").style.display = "block"; //معلومات عن الاطفال
            document.getElementById("35057_group").style.display = "block"; //استمارة بيان قيام الزوجية وعدد الاولاد
            Result.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
            Result.Hide_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else{
            document.getElementById("35057_group").style.display = "none"; //استمارة بيان قيام الزوجية وعدد الاولاد
            document.getElementById("89137").style.display = "none"; //معلومات عن الاطفال
            [...First_Option, ...Second_Option, ...Third_Option].forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    Second_Hide(event){
        this.inputFormField["Typeeee"] = null; //يرجى تحديد سبب عدم الاستمرار داخل المديرية

        if(event == "كلا"){
            document.getElementById("93243").style.display = "block"; //يرجى تحديد سبب عدم الاستمرار داخل المديرية
        }else{
            document.getElementById("93243").style.display = "none"; //يرجى تحديد سبب عدم الاستمرار داخل المديرية
        }
    }
}