{
  //اخفاء مجموعة المستمسكات الزوجية ومرفقين من مجموعة مستمسكات الضريبة في حال المواطن اختار اعزب
  if (this.form_data.maritstatus == "أعزب") {
    document.getElementById("35062_group").style.display = "none"; //المستمسكات الزوجية

    //مستمسكات الضريبة
    document.getElementsByClassName("47254")[0].style.display = "none"; //كتاب تأييد من الجامعة او المدرسة فيما يخص الاولاد فوق سن 18 سنة
    //كتاب تأييد من هيأة العامة للضرائب يؤيد فيه عدم عدم وجود دخل للزوج خاضع للضريبة لغاية 31 / 1 / من كل سنة
    document.getElementsByClassName("47255")[0].style.display = "none";
  }

  //-----------------------------------------------------------------------------------------------------------
  //في حال المواطن ذكر ولكن غير اعزب يتم اخفاء كل المرفقات الخاصة بالانثى وغير العزباء
  if (this.form_data.gender == "ذكر" && this.form_data.maritstatus != "أعزب") {
    let Docs_ID = [
      //مستمسكات الزوجية
      "47246", //كتاب تأييد للزوجة التي زوجها كاسب
      "47247", //كتاب تاييد للموظفة الارملة
      "47248", //كتاب تاييد للموظفة  التي زوجها متقاعد
      "47249", //كتاب تاييد للزوجة المطلقة
      "47465", //كتاب تاييد قرار حضانة بالنسبة للمطلقة
      "47466", //كتاب تاييد بالنسبة للزوجة الارملة ولديها تقاعد للاولادها
    ];

    Docs_ID.forEach((HideDocs) => {
      document.getElementsByClassName(HideDocs)[0].style.display = "none";
    });
  }

  //-----------------------------------------------------------------------------------------------------------
  //في حال المواطن ارمل او مطلق سواء ذكر او انثى
  if (
    this.form_data.maritstatus == "أرمل" ||
    this.form_data.maritstatus == "مطلق"
  ) {
    document.getElementsByClassName("47244")[0].style.display = "none"; //كتاب تأييد من دائرة الزوج ( الزوجة )
    //كتاب تأييد من هيأة العامة للضرائب يؤيد فيه عدم وجود دخل للزوج خاضع للضريبة لغاية 31 / 1 / من كل سنة
    document.getElementsByClassName("47255")[0].style.display = "none";
  }

  //-----------------------------------------------------------------------------------------------------------
  //في حال المواطن غير اعزب سواء ذكر او انثى
  if (this.form_data.maritstatus != "أعزب") {
    document.getElementsByClassName("47253")[0].style.display = "none"; //البطاقة الموحدة ( الوطنية )
  }

  //-----------------------------------------------------------------------------------------------------------
  let People_Stauts = [
    {
      Gender: "انثى",
      MaritStatus: "متزوج",
      Docs_ID: [
        "47247", //كتاب تاييد للموظفة الارملة
        "47249", //كتاب تاييد للزوجة المطلقة
        "47465", //كتاب تاييد قرار حضانة بالنسبة للمطلقة
        "47466", //كتاب تاييد بالنسبة للزوجة الارملة ولديها تقاعد للاولادها
      ],
    },
    {
      Gender: "انثى",
      MaritStatus: "أرمل",
      Docs_ID: [
        "47246", //كتاب تأييد للزوجة التي زوجها كاسب
        "47248", //كتاب تاييد للموظفة  التي زوجها متقاعد
        "47249", //كتاب تاييد للزوجة المطلقة
        "47465", //كتاب تاييد قرار حضانة بالنسبة للمطلقة
      ],
    },
    {
      Gender: "انثى",
      MaritStatus: "مطلق",
      Docs_ID: [
        "47246", //كتاب تأييد للزوجة التي زوجها كاسب
        "47247", //كتاب تاييد للموظفة الارملة
        "47248", //كتاب تاييد للموظفة  التي زوجها متقاعد
        "47466", //كتاب تاييد بالنسبة للزوجة الارملة ولديها تقاعد للاولادها
      ],
    },
  ];

  People_Stauts.filter((Checking) => {
    if (
      this.form_data.gender == Checking.Gender &&
      this.form_data.maritstatus == Checking.MaritStatus
    ) {
      Checking.Docs_ID.forEach((Hiding) => {
        document.getElementsByClassName(Hiding)[0].style.display = "none";
      });
    }
  });
}
