{
  //معلومات اساسية عن المؤسسة
selectFormScope(event) {
  var No_Sub_Foundation = [
    "المجمع العلمي العراقي", "المصرف العراقي للتجارة", "الهيئة الوطنية للاستثمار",
    "الهيأة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايولوجية", "امانة بغداد", "بيت الحكمة",
    "ديوان الوقف الشيعي", "ديوان اوقاف الديانات المسيحية والايزيدية والصابئية", "سلطة الطيران المدني",
    "شبكة الاعلام العراقي", "مجلس الخدمة الاتحادي", "مجلس الدولة", "مجلس محافظة الديوانية",
    "مجلس محافظة بغداد", "مجلس محافظة ديالى", "مجلس محافظة ذي قار", "مجلس محافظة كربلاء المقدسة",
    "مجلس محافظة كركوك", "مجلس محافظة ميسان", "مجلس محافظة نينوى", "محافظة البصرة", "محافظة بغداد",
    "محافظة ديالى", "محافظة صلاح الدين", "محافظة كربلاء المقدسة", "محافظة كركوك", "محافظة ميسان",
    "محافظة واسط", "مكتب رئيس الجمهورية", "هيئة التصنيع الحربي", "هيئة النزاهة الاتحادية", "وزارة الاتصالات",
    "وزارة التربية", "وزارة الثقافة والسياحة والاثار", "وزارة الزراعة", "وزارة الشباب والرياضة",
    "وزارة الصناعة والمعادن", "وزارة العمل والشؤون الاجتماعية", "وزارة الكهرباء", "وزارة المالية",
    "وزارة الموارد المائية", "وزارة النفط", "وزارة النقل", "وزارة الدفاع", "هيئة الطاقة الذرية",
    "مجلس شؤون المنافسة ومنع الاحتكار", "وزارة الأعمار والإسكان والبلديات العامة",
    "الهيأة العامة لمراقبة تخصيص الواردات الاتحادية", "مجلس محافظة الانبار", "وزارة الداخلية", "محافظة المثنى",
    "محافظة الانبار", "وزارة الهجرة والمهجرين", "الهيئة الوطنية للاعلام والاتصالات",
  ],
  Have_Sub_Foundation = ["وزارة التخطيط", "وزارة العدل", "وزارة الصحة", "مكتب رئيس الوزراء"];

  var x = event;
  if (x === "مقر المؤسسة الرئيسي") {
    document.getElementById("75877").style.display = "block"; // مقر المؤسسة الرئيسي
    this.inputFormField["organizationHeadquarters"] = null;
    document.getElementById("75879").style.display = "none"; // دائرة فرعية
    this.inputFormField["subOrganizationUnit"] = null;
    document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
    this.inputFormField["subOrganizationUnitOther"] = null;
    this.group_of_form[0].fields[3].properties[0].values = No_Sub_Foundation;
  } else if (x === "دائرة فرعية") {
    document.getElementById("75877").style.display = "block"; // اسم مقر المؤسسة
    this.inputFormField["organizationHeadquarters"] = null;
    document.getElementById("75879").style.display = "block"; // اسم الدائرة الفرعية
    this.inputFormField["subOrganizationUnit"] = null;
    document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
    this.inputFormField["subOrganizationUnitOther"] = null;
    this.group_of_form[0].fields[3].properties[0].values = Have_Sub_Foundation;
    
  } else {
    document.getElementById("75877").style.display = "none"; // مقر المؤسسة الرئيسي
    this.inputFormField["organizationHeadquarters"] = null;
    document.getElementById("75879").style.display = "none"; // دائرة فرعية
    this.inputFormField["subOrganizationUnit"] = null;
    document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
    this.inputFormField["subOrganizationUnitOther"] = null;
  }
},

selectFromSubOrg(event){
  var x = event;
  if (x === "غير ذلك") {
      document.getElementById("75879").style.display = "block"; // اكتب اسم الدائرة فرعية
    } else {
      document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
      this.inputFormField["subOrganizationUnitOther"] = null;
    }
},
    
    //هل نظام الدفع الإلكتروني مرتبط بأنظمة أخرى داخل أو خارج المؤسسة؟
hasEpaymentSystemIntegration(event){
  var x = event;
    if (x === "نعم") {
      document.getElementById("75701").style.display = "block"; //اذكر أنظمة الدفع الإلكتروني وارتباطها:
    } else if (x === "كلا") {
      document.getElementById("75701").style.display = "none"; //اذكر أنظمة الدفع الإلكتروني وارتباطها:
    }
},

Filter_Foundation(event){
    this.inputFormField["subOrganizationUnit"] = null;
    var Main_Foundation = [
      //"وزارة النفط",
      "وزارة التخطيط", "وزارة العدل", "وزارة الصحة", "مكتب رئيس الوزراء"
    ],
    Secondary_Foundation = [
      /*
      [
        "وزارة النفط - مركز تقنيات المعلومات والاتصالات",
        "وزارة النفط - قسم حماية وسلامة المعلومات", "غير ذلك"
      ],//وزارة النفط
      */
      [
        "وزارة التخطيط - مقر الوزارة", "وزارة التخطيط - هيأة الاحصاء ونظم المعلومات الجغرافية",
        "وزارة التخطيط - المركز الوطني للتطوير الاداري وتقنية المعلومات", "وزارة التخطيط - هيئة الاعتماد العراقية",
        "وزارة التخطيط - الجهاز المركزي للتقييس والسيطرة النوعية", "غير ذلك"
      ],//وزارة التخطيط
      [
        "وزارة العدل - دائرة الدوائر العدلية", "وزارة العدل - دائرة التسجيل العقاري",
        "وزارة العدل - دائرة رعاية القاصرين", "وزارة العدل - دائرة الكتاب العدول", "وزارة العدل - دائرة التنفيذ",
        "وزارة العدل - دائرة الاصلاح العراقية", "وزارة العدل - دائرة اصلاح الاحداث", "غير ذلك"
      ],//"وزارة العدل"
      [
        "وزارة الصحة - دائرة صحة كركوك", "وزارة الصحة - دائرة صحة المثنى", "وزارة الصحة - دائرة صحة ذي قار",
        "وزارة الصحة - دائرة صحة ديالى", "وزارة الصحة - دائرة صحة الانبار", "وزارة الصحة - دائرة صحة كربلاء",
        "وزارة الصحة - دائرة صحة الرصافة", "وزارة الصحة - دائرة صحة ميسان", "وزارة الصحة - دائرة مدينة الطب",
        "وزارة الصحة - مركز تكنولوجيا المعلومات (مقر الوزارة)", "وزارة الصحة - دائرة صحة الديوانية",
        "وزارة الصحة - دائرة صحة البصرة", "وزارة الصحة - دائرة صحة نينوى", "وزارة الصحة - دائرة صحة الكرخ",
        "وزارة الصحة - دائرة العيادات الطبية الشعبية", "وزارة الصحة - دائرة صحة صلاح الدين",
        "وزارة الصحة - دائرة صحة واسط", "وزارة الصحة - دائرة صحة بابل", "غير ذلك",
      ],//وزارة الصحة
      [
        "المركز الوطني للتحول الرقمي"
      ]
    ];

    for(var i = 0; i < Main_Foundation.length; i++){
      if(event == Main_Foundation[i]){
        this.group_of_form[0].fields[4].properties[0].values = Secondary_Foundation[i];
        break;
      }else{
        this.group_of_form[0].fields[4].properties[0].values = [];
      }
    }
  },
  
  Block_Groups(Groups_ID){
    for(var i = 0; i < Groups_ID.length; i++){
      if(i == 0){
        document.getElementById(Groups_ID[i]).style.display = "none";
      }else{
        document.getElementById(Groups_ID[i]).style.display = "block";
      }
    }
  },

  singleNotification(notifyText, position) {
    this.$toast.error(notifyText, {
      position: position,
      timeout: 6000,
      closeOnClick: false,
      pauseOnFocusLoss: true,
      pauseOnHover: true,
      draggable: true,
      draggablePercent: 0.6,
      showCloseButtonOnHover: false,
      hideProgressBar: false,
      closeButton: "button",
      icon: true,
      rtl: true
    });
  },

  ssingleNotification(notifyText, position) {
      this.$toast.success(notifyText, {
      position: position,
      timeout: 6000,
      closeOnClick: false,
      pauseOnFocusLoss: true,
      pauseOnHover: true,
      draggable: true,
      draggablePercent: 0.6,
      showCloseButtonOnHover: false,
      hideProgressBar: false,
      closeButton: "button",
      icon: true,
      rtl: true
    });
  },

  Info_Checking(event){
    if (event) {
        let loader = this.$loading.show({
        container: this.$refs.formContainer,
        loader: "dots",
        transition: "fade",
        color: "#c30734"
    });

    var matchFound = false;

    var Groups_ID = [
        "34944_group", //معلومات المؤسسة
        "34933_group", //مؤشرات الأداء لقياس التزام المؤسسات الحكومية العراقية بتنفيذ الدفع الإلكتروني 
    ];

    //الجهات ذات المخول الواحد
    var First_Foundations_Names = [
        "المجمع العلمي العراقي",
        "المصرف العراقي للتجارة",
        "الهيئة الوطنية للاستثمار",
        "الهيأة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايولوجية",
        "امانة بغداد",
        "بيت الحكمة",
        "ديوان اوقاف الديانات المسيحية والايزيدية والصابئية",
        "سلطة الطيران المدني",
        "شبكة الاعلام العراقي",
        "مجلس الدولة",
        "مجلس النواب العراقي",
        "مجلس محافظة الديوانية",
        "مجلس محافظة بغداد",
        "مجلس محافظة ديالى",
        "مجلس محافظة ذي قار",
        "مجلس محافظة كربلاء المقدسة",
        "مجلس محافظة كركوك",
        "مجلس محافظة ميسان",
        "مجلس محافظة نينوى",
        "محافظة البصرة",
        "محافظة بغداد",
        "محافظة ديالى",
        "محافظة صلاح الدين",
        "محافظة كربلاء المقدسة",
        "محافظة كركوك",
        "محافظة واسط",
        "مكتب رئيس الجمهورية",
        "مؤسسة السجناء السياسيين",
        "هيئة التصنيع الحربي",
        "هيئة النزاهة الاتحادية",
        "وزارة الاتصالات",
        "وزارة الثقافة والسياحة والاثار",
        "وزارة الزراعة",
        "وزارة الشباب والرياضة",
        "وزارة الصناعة والمعادن",
        "وزارة العمل والشؤون الاجتماعية",
        "وزارة الكهرباء", "وزارة المالية",
        "وزارة الموارد المائية",
        "وزارة النقل",
        "وزارة الدفاع",
        "هيئة الطاقة الذرية",
        "مجلس شؤون المنافسة ومنع الاحتكار",
        "وزارة الأعمار والإسكان والبلديات العامة",
        "الهيأة العامة لمراقبة تخصيص الواردات الاتحادية",
        "مجلس محافظة الانبار",
        "وزارة الداخلية",
        "محافظة المثنى",
        "محافظة الانبار",
        "وزارة الهجرة والمهجرين",
    ],
    First_Phone_Number = [
        //المجمع العلمي العراقي
        "9647709805064", //ميساء جاسم محمد
        // المصرف العراقي للتجارة
        "9647815163518", // دعاء علاء حسن
        // الهيئة الوطنية للاستثمار
        "9647717634957", // داليا عامر جبار
        // الهيأة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايولوجية
        "9647726674331", // عبدالرحمن احمد خضير
        // امانة بغداد
        "9647721031222", // شهد عبد الكريم قاسم
        // بيت الحكمة
        "9647700630474", // حسام خليل خضير
        // ديوان اوقاف الديانات المسيحية والايزيدية والصابئية
        "9647712290391", // فادي خالد ابراهيم
        // سلطة الطيران المدني
        "9647700806036", // سلام عدنان عبد الرحيم
        // شبكة الاعلام العراقي
        "9647700090099", // احمد عبد الستار حمزة
        // مجلس الدولة
        "9647708116662", // اسيا نعيم مطير
        // مجلس النواب العراقي
        "9647744447001", // زيد عبدالزهرة حميد
        // مجلس محافظة الديوانية
        "9647823281148", // ميثاق عايد فرحان
        // مجلس محافظة بغداد
        "9647704440440", // عمار ابراهيم حيدر
        // مجلس محافظة ديالى
        "9647705859294", // خالد محمد
        // مجلس محافظة ذي قار
        "9647803169208", // عقيل حسين حاجم
        // مجلس محافظة كربلاء المقدسة
        "9647706316745", // علاء حسين علي
        // مجلس محافظة كركوك
        "9647739019638", // رؤى جواد كاظم
        // مجلس محافظة ميسان
        "9647705522411", // حسين جلاب محيسن
        // مجلس محافظة نينوى
        "9647705273540", // سعد زكر محمد
        // محافظة البصرة
        "9647742800040", // شهد عبد العظيم لطيف
        // محافظة بغداد
        "9647702765747", // احمد عبد المهدي حسين
        // محافظة ديالى
        "9647710016073", // حيدر قاسم عباس
        // محافظة صلاح الدين
        "9647724419263", // علي حاتم محمد
        // محافظة كربلاء المقدسة
        "9647725724569", // ضرغام ناصب كريم
        // محافظة كركوك
        "9647714803311", // حاجم حامد علي
        // محافظة واسط
        "9647714493415", // علي حسن ضمد
        // مكتب رئيس الجمهورية
        "9647832590637", // مصطفى عبد القادر مهدي
        // مؤسسة السجناء السياسيين
        "9647704556111", // علي مهدي عباس
        // هيئة التصنيع الحربي
        "9647703991816", // محمد جمال
        // هيئة النزاهة الاتحادية
        "9647901599184", // انمار اكرم جاسم
        // وزارة الاتصالات
        "9647805903344", // رنا بربوتي
        // وزارة الثقافة والسياحة والاثار
        "9647713338999", // صفوان هشام جاسم
        // وزارة الزراعة
        "9647704909404", // رؤى مجيد
        // وزارة الشباب والرياضة
        "9647706230063", // ايمن عماد رؤوف
        // وزارة الصناعة والمعادن
        "9647700983009", // بلال عصام عبدالرزاق
        // وزارة العمل والشؤون الاجتماعية
        "9647716128345", // ايمان بدر
        // وزارة الكهرباء
        "9647714201626", // طارق عبد العال
        // وزارة المالية
        "9647702580887", // جاسم محمد خليل
        // وزارة الموارد المائية
        "9647716693802", // أسامة صديق أحمد
        // وزارة النقل
        "9647701107046", // صادق عاصي عباس
        // وزارة الدفاع
        "9647734928266", // غير مذكور الاسم
        // هيئة الطاقة الذرية
        "9647724272787", // علي رعد عبدالله
        // مجلس شؤون المنافسة ومنع الاحتكار
        "9647714380140", // علي ماجد حميد
        // وزارة الأعمار والإسكان والبلديات العامة
        "9647705891646", // لينا محمد عبد الوهاب
        // الهيأة العامة لمراقبة تخصيص الواردات الاتحادية
        "9647704337297", // علا قتيبة عبد الوهاب
        // مجلس محافظة الانبار
        "9647814563060", // عمر رياض مولود
        // وزارة الداخلية
        "9647706951451", // حيدر عارم
        // محافظة المثنى
        "9647811969049", // حيدر عبدالامير ناهي
        // محافظة الانبار
        "9647844447788", // عمر محمد روضان
        // وزارة الهجرة والمهجرين
        "9647716811541", // محمد علي عبد شناوة
    ];

    //الجهات ذات عدة مخولين
    var Second_Founcations_Names = [
        "الهيئة الوطنية للاعلام والاتصالات",
        "ديوان الوقف الشيعي",
        "محافظة ميسان",
        "وزارة التربية",
        "وزارة النفط",
    ],
    Second_Phone_Number = [
        //"الهيئة الوطنية للاعلام والاتصالات"
        [
            "9647901861231", //رضوان كاظم عزيز
            "9647748190679", //عادل حسين علي
        ],
        //"ديوان الوقف الشيعي"
        [
            "9647706395488", //عباس محمد عزيز 
            "9647762517535", //محسن حيال منشد (الدائرة الادارية والمالية)
        ],
        //"محافظة ميسان"
        [
            "9647705522475", //حسام دليل شناوة
            "9647705529977", // اسعد هيف مجيد
        ],
        //"وزارة التربية"
        [
            "9647704273759", //نزار محمد سعيد
            "9647904457711", //بان علي مطشر
        ],
        //"وزارة النفط"
        [
            "9647714613477", //عباس رشدي عبد الحميد
            "9647801995566", //مصطفى صفاء ناصر تقي
        ],
    ];

    //الجهات ذات الفروع
    var Third_Foundations_Names = [
        "وزارة التخطيط", "وزارة العدل", "وزارة الصحة", "مكتب رئيس الوزراء",
    ],
    Sub_Foundations_Names = [
        //وزارة التخطيط
        "وزارة التخطيط - مقر الوزارة", //0
        "وزارة التخطيط - هيأة الاحصاء ونظم المعلومات الجغرافية", //1
        "وزارة التخطيط - المركز الوطني للتطوير الاداري وتقنية المعلومات", //2
        "وزارة التخطيط - هيئة الاعتماد العراقية", //3
        "وزارة التخطيط - الجهاز المركزي للتقييس والسيطرة النوعية", //4
        //وزارة العدل
        "وزارة العدل - دائرة الدوائر العدلية", //5
        "وزارة العدل - دائرة التسجيل العقاري", //6
        "وزارة العدل - دائرة رعاية القاصرين", //7
        "وزارة العدل - دائرة الكتاب العدول", //8
        "وزارة العدل - دائرة التنفيذ", //9
        "وزارة العدل - دائرة الاصلاح العراقية", //10
        "وزارة العدل - دائرة اصلاح الاحداث", //11
        //وزارة الصحة
        "وزارة الصحة - دائرة صحة كركوك", //12
        "وزارة الصحة - دائرة صحة المثنى", //13
        "وزارة الصحة - دائرة صحة ذي قار", //14
        "وزارة الصحة - دائرة صحة ديالى", //15
        "وزارة الصحة - دائرة صحة الانبار", //16
        "وزارة الصحة - دائرة صحة كربلاء", //17
        "وزارة الصحة - دائرة صحة الرصافة", //18
        "وزارة الصحة - دائرة صحة ميسان", //19
        "وزارة الصحة - دائرة مدينة الطب", //20
        "وزارة الصحة - مركز تكنولوجيا المعلومات (مقر الوزارة)", //21
        "وزارة الصحة - دائرة صحة الديوانية", //22
        "وزارة الصحة - دائرة صحة البصرة", //23
        "وزارة الصحة - دائرة صحة نينوى", //24
        "وزارة الصحة - دائرة صحة الكرخ", //25
        "وزارة الصحة - دائرة العيادات الطبية الشعبية", //26
        "وزارة الصحة - دائرة صحة صلاح الدين", //27
        "وزارة الصحة - دائرة صحة واسط", //28
        "وزارة الصحة - دائرة صحة بابل", //29
        //مكتب رئيس الوزراء
        "المركز الوطني للتحول الرقمي", //30
    ],
    Third_Phone_Number = [
        //وزارة التخطيط
        ["9647716506408"], // كمال محمد حسين
        ["9647713824781"], // حمزة عدنان داود
        ["9647705385189"], // انمار هاتف عبد المجيد
        ["9647717732958"], // رند صالح مجيد
        ["9647901214611"],  // زينب صفاء عبد الجبار
        //وزارة العدل
        ["9647703823514"], // مصطفى نجدت مصطفى
        ["9647703285050"], // حيدر محمد علوان
        ["9647714439217"], // ياسر محمد شاكر
        ["9647703604749"], // محمد وسام حسين
        ["9647706527992"], // محمد حسين علوان
        ["9647813333233"], // احمد حسام الدين عباس
        ["9647710608631"],  // علاء حسين صاحب
        //وزارة الصحة
        [
            "9647701350567", // توفيق قيس حسيب
            "9647709272720", //علاء عبد الحمزه
        ],
        ["9647813444473"], // احمد سعيد عبد العزيز ابراهيم
        ["9647800007054"], // معتز محمد ثامر حليحل
        ["9647714706115"], // عمر سامر حكمت نامق
        ["9647805169084"], // حازم حمد حمادي جاسم
        ["9647706036160"], // مصطفى مهدي صالح حسين
        ["9647725988139"], // ميساء علي حسين حسن
        ["9647705511737"], // مصطفى عباس حمود حسن
        ["9647702535098"], // مخلد محمد فلح حسن
        ["9647818614990"], // احمد رشيد زرزور يونس
        ["9647725254525"], // علي باسم خليل
        ["9647705757880"], // رغد اسعد جواد كاظم
        ["9647740854626"], // سيف مقداد ابراهيم
        ["9647702923381"], // عصام هادي ثجيل صاحي
        ["9647902170098"], // محمد علي كريم جواد
        ["9647712320666"], // نوار عبدالعزيز مجيد سبع
        ["9647714882591"], // حيدر عبدالله جاسم شجر
        ["9647821300313"],  // حسنين هادي عبيس عبود
        //مكتب رئيس الوزراء
        [
            "9647710359694", // انيس طاهر رشيد
            "9647721393207", // مصطفى حسنين علي
            "9647716646815", // محمد كريم محمد شكر
            "9647811911618" // يوسف احسان علي
        ],
    ],
    Array_Start = [
        //وزارة التخطيط
        0,
        //وزارة العدل
        5,
        //وزارة الصحة
        12,
        //مكتب رئيس الوزراء
        30,
        ],
        Array_End = [
        //وزارة التخطيط
        5,
        //وزارة العدل
        12,
        //وزارة الصحة
        30,
        //مكتب رئيس الوزراء
        31
    ];

    if(this.inputFormField.formScopeType == "مقر المؤسسة الرئيسي"){
        //اذا مخول واحد
        if(First_Foundations_Names.includes(this.inputFormField.organizationHeadquarters)){
            for(var i = 0; i < First_Foundations_Names.length; i++){
                if(
                    First_Foundations_Names[i] == this.inputFormField.organizationHeadquarters &&
                    First_Phone_Number[i] == this.inputFormField.employeePhoneNumber
                ){
                    matchFound = true;
                    this.Block_Groups(Groups_ID);
                    loader.hide();
                    this.ssingleNotification("تم الدخول بنجاح", "top-right");
                    break; // Exit the loop once a match is found
                }
            }
        }else{//اذا اكثر من مخول
            for(var i = 0; i < First_Foundations_Names.length; i++){
                if(
                    Second_Founcations_Names[i] == this.inputFormField.organizationHeadquarters &&
                    Second_Phone_Number[i].includes(this.inputFormField.employeePhoneNumber)
                ){
                    matchFound = true;
                    this.Block_Groups(Groups_ID);
                    loader.hide();
                    this.ssingleNotification("تم الدخول بنجاح", "top-right");
                    break; // Exit the loop once a match is found
                }
            }
        }
    }else if(this.inputFormField.formScopeType == "دائرة فرعية"){
        if(this.inputFormField.subOrganizationUnit != "غير ذلك"){
            for(var i = 0; i < Third_Foundations_Names.length; i++){
                for(var j = Array_Start[i]; j < Array_End[i]; j++){
                    if(
                        Sub_Foundations_Names[j] == this.inputFormField.subOrganizationUnit &&
                        Third_Phone_Number[j].includes(this.inputFormField.employeePhoneNumber)
                    ){
                        matchFound = true;
                        this.Block_Groups(Groups_ID);
                        loader.hide();
                        this.ssingleNotification("تم الدخول بنجاح", "top-right");
                        break; // Exit the loop once a match is found
                    }
                }
            }
        }else{
            for(var i = 0; i < Third_Foundations_Names.length; i++){
                for(var j = Array_Start[i]; j < Array_End[i]; j++){
                    if(
                        Third_Foundations_Names[i] == this.inputFormField.organizationHeadquarters &&
                        Third_Phone_Number[j].includes(this.inputFormField.employeePhoneNumber)
                    ){
                        matchFound = true;
                        this.Block_Groups(Groups_ID);
                        loader.hide();
                        this.ssingleNotification("تم الدخول بنجاح", "top-right");
                        break; // Exit the loop once a match is found
                    }
                }
            }
        }
    }else{
        matchFound = false;
    }

      if (!matchFound) {
        loader.hide();
        this.singleNotification("رقم الهاتف غير مطابق مع المخول ", "top-right");
      }
    }
  },
}