{
  //معلومات اساسية عن المؤسسة
selectFormScope(event) {
  var No_Sub_Foundation = [
    //"الامانة العامة لمجلس الوزراء",
    "المجمع العلمي العراقي", "المصرف العراقي للتجارة", "الهيئة الوطنية للاستثمار",
    "الهيأة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايولوجية", "امانة بغداد", "بيت الحكمة",
    "ديوان الوقف الشيعي", "ديوان اوقاف الديانات المسيحية والايزيدية والصابئية", "سلطة الطيران المدني",
    "شبكة الاعلام العراقي", "مجلس الخدمة الاتحادي", "مجلس الدولة", "مجلس محافظة الديوانية",
    "مجلس محافظة بغداد", "مجلس محافظة ديالى", "مجلس محافظة ذي قار", "مجلس محافظة كربلاء المقدسة",
    "مجلس محافظة كركوك", "مجلس محافظة ميسان", "مجلس محافظة نينوى", "محافظة البصرة", "محافظة بغداد",
    "محافظة ديالى", "محافظة صلاح الدين", "محافظة كربلاء المقدسة", "محافظة كركوك", "محافظة ميسان",
    "محافظة واسط", "مكتب رئيس الجمهورية", "هيئة التصنيع الحربي", "هيئة النزاهة الاتحادية", "وزارة الاتصالات",
    "وزارة التربية", "وزارة الثقافة والسياحة والاثار", "وزارة الزراعة", "وزارة الشباب والرياضة",
    "وزارة الصناعة والمعادن", "وزارة العمل والشؤون الاجتماعية", "وزارة الكهرباء", "وزارة المالية",
    "وزارة الموارد المائية", "وزارة النفط", "وزارة النقل", "وزارة الدفاع", "هيئة الطاقة الذرية",
    "مجلس شؤون المنافسة ومنع الاحتكار", "وزارة الأعمار والإسكان والبلديات العامة",
    "الهيأة العامة لمراقبة تخصيص الواردات الاتحادية", "مجلس محافظة الانبار", "وزارة الداخلية", "محافظة المثنى",
    "محافظة الانبار", "وزارة الهجرة والمهجرين",
  ],
  Have_Sub_Foundation = ["وزارة التخطيط", "وزارة العدل", "وزارة الصحة", "مكتب رئيس الوزراء"];

  var x = event;
  if (x === "مقر المؤسسة الرئيسي") {
    document.getElementById("75877").style.display = "block"; // مقر المؤسسة الرئيسي
    document.getElementById("75879").style.display = "none"; // دائرة فرعية
    this.inputFormField["subOrganizationUnit"] = null;
    document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
    this.inputFormField["subOrganizationUnitOther"] = null;
    this.group_of_form[0].fields[3].properties[0].values = No_Sub_Foundation;
  } else if (x === "دائرة فرعية") {
    document.getElementById("75877").style.display = "block"; // اسم مقر المؤسسة
    document.getElementById("75879").style.display = "block"; // اسم الدائرة الفرعية
    document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
    this.inputFormField["subOrganizationUnitOther"] = null;
    this.group_of_form[0].fields[3].properties[0].values = Have_Sub_Foundation;
    
  } else {
    document.getElementById("75877").style.display = "none"; // مقر المؤسسة الرئيسي
    this.inputFormField["organizationHeadquarters"] = null;
    document.getElementById("75879").style.display = "none"; // دائرة فرعية
    this.inputFormField["subOrganizationUnit"] = null;
    document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
    this.inputFormField["subOrganizationUnitOther"] = null;
  }
},

selectFromSubOrg(event)
{
  var x = event;
  if (x === "غير ذلك") {
      document.getElementById("75879").style.display = "block"; // اكتب اسم الدائرة فرعية
    } else {
      document.getElementById("75880").style.display = "none"; // اكتب اسم الدائرة فرعية
      this.inputFormField["subOrganizationUnitOther"] = null;
    }
},
    
    //هل نظام الدفع الإلكتروني مرتبط بأنظمة أخرى داخل أو خارج المؤسسة؟
    hasEpaymentSystemIntegration(event)
{
  var x = event;
    if (x === "نعم") {
      document.getElementById("75701").style.display = "block"; //اذكر أنظمة الدفع الإلكتروني وارتباطها:
    } else if (x === "كلا") {
      document.getElementById("75701").style.display = "none"; //اذكر أنظمة الدفع الإلكتروني وارتباطها:
    }
},
  Filter_Foundation(event){
    this.inputFormField["subOrganizationUnit"] = null;
    var Main_Foundation = [
      //"وزارة النفط",
      "وزارة التخطيط", "وزارة العدل", "وزارة الصحة", "مكتب رئيس الوزراء"
    ],
    Secondary_Foundation = [
      /*
      [
        "وزارة النفط - مركز تقنيات المعلومات والاتصالات",
        "وزارة النفط - قسم حماية وسلامة المعلومات", "غير ذلك"
      ],//وزارة النفط
      */
      [
        "وزارة التخطيط - مقر الوزارة", "وزارة التخطيط - هيأة الاحصاء ونظم المعلومات الجغرافية",
        "وزارة التخطيط - المركز الوطني للتطوير الاداري وتقنية المعلومات", "وزارة التخطيط - هيئة الاعتماد العراقية",
        "وزارة التخطيط - الجهاز المركزي للتقييس والسيطرة النوعية", "غير ذلك"
      ],//وزارة التخطيط
      [
        "وزارة العدل - دائرة الدوائر العدلية", "وزارة العدل - دائرة التسجيل العقاري",
        "وزارة العدل - دائرة رعاية القاصرين", "وزارة العدل - دائرة الكتاب العدول", "وزارة العدل - دائرة التنفيذ",
        "وزارة العدل - دائرة الاصلاح العراقية", "وزارة العدل - دائرة اصلاح الاحداث", "غير ذلك"
      ],//"وزارة العدل"
      [
        "وزارة الصحة - دائرة صحة كركوك", "وزارة الصحة - دائرة صحة المثنى", "وزارة الصحة - دائرة صحة ذي قار",
        "وزارة الصحة - دائرة صحة ديالى", "وزارة الصحة - دائرة صحة الانبار", "وزارة الصحة - دائرة صحة كربلاء",
        "وزارة الصحة - دائرة صحة الرصافة", "وزارة الصحة - دائرة صحة ميسان", "وزارة الصحة - دائرة مدينة الطب",
        "وزارة الصحة - مركز تكنولوجيا المعلومات (مقر الوزارة)", "وزارة الصحة - دائرة صحة الديوانية",
        "وزارة الصحة - دائرة صحة البصرة", "غير ذلك",
      ],//وزارة الصحة
      [
        "المركز الوطني للتحول الرقمي"
      ]
    ];

    for(var i = 0; i < Main_Foundation.length; i++){
      if(event == Main_Foundation[i]){
        this.group_of_form[0].fields[4].properties[0].values = Secondary_Foundation[i];
        break;
      }else{
        this.group_of_form[0].fields[4].properties[0].values = [];
      }
    }
  },
  
  Block_Groups(Groups_ID){
    for(var i = 0; i < Groups_ID.length; i++){
      if(i == 0){
        document.getElementById(Groups_ID[i]).style.display = "none";
      }else{
        document.getElementById(Groups_ID[i]).style.display = "block";
      }
    }
  },

  Info_Checking(event){
    if (event) {
      let loader = this.$loading.show({
        container: this.$refs.formContainer,
        loader: "dots",
        transition: "fade",
        color: "#c30734"
      });

      var Groups_ID = [
        "34944_group", //معلومات المؤسسة
        "34933_group", //البنى التحتية
      ];

      //مال الي عدهم فقط مؤسسة بدون دوائر فرعيه
      var Main_Foundation = [
        //"الامانة العامة لمجلس الوزراء",
        "المجمع العلمي العراقي",
        "المصرف العراقي للتجارة",
        "الهيئة الوطنية للاستثمار",
        "الهيأة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايولوجية",
        "امانة بغداد",
        "بيت الحكمة",
        "ديوان الوقف الشيعي",
        "ديوان اوقاف الديانات المسيحية والايزيدية والصابئية",
        "سلطة الطيران المدني",
        "شبكة الاعلام العراقي",
        //"مجلس الخدمة الاتحادي",
        "مجلس الدولة",
        "مجلس محافظة الديوانية",
        "مجلس محافظة بغداد",
        "مجلس محافظة ديالى",
        "مجلس محافظة ذي قار",
        "مجلس محافظة كربلاء المقدسة",
        "مجلس محافظة كركوك",
        "مجلس محافظة ميسان",
        "مجلس محافظة نينوى",
        "محافظة البصرة",
        "محافظة بغداد",
        "محافظة ديالى",
        "محافظة صلاح الدين",
        "محافظة كربلاء المقدسة",
        "محافظة كركوك",
        "محافظة ميسان",
        "محافظة واسط",
        "مكتب رئيس الجمهورية",
        "هيئة التصنيع الحربي",
        "هيئة النزاهة الاتحادية",
        "وزارة الاتصالات",
        "وزارة التربية",
        "وزارة الثقافة والسياحة والاثار",
        "وزارة الزراعة",
        "وزارة الشباب والرياضة",
        "وزارة الصناعة والمعادن",
        "وزارة العمل والشؤون الاجتماعية",
        "وزارة الكهرباء",
        "وزارة المالية",
        "وزارة الموارد المائية",
        "وزارة النفط",
        "وزارة النقل",
        "وزارة الدفاع",
        "هيئة الطاقة الذرية",
        "مجلس شؤون المنافسة ومنع الاحتكار",
        "وزارة الأعمار والإسكان والبلديات العامة",
        "الهيأة العامة لمراقبة تخصيص الواردات الاتحادية",
        "مجلس محافظة الانبار",
        "وزارة الداخلية",
        "محافظة المثنى",
        "محافظة الانبار",
        "وزارة الهجرة والمهجرين",
      ],
      Main_Phone_Numbers   = [
        //"المجمع العلمي العراقي"
        ["9647709805064", "9647811911618"], //ميساء جاسم محمد
        //"المصرف العراقي للتجارة"
        ["9647815163518"], //دعاء علاء حسن
        //الهيئة الوطنية للاستثمار
        ["9647717634957"], //داليا عامر جبار
        //الهيأة الوطنية للرقابة النووية والاشعاعية والكيميائية والبايولوجية
        ["9647726674331"], //عبدالرحمن احمد خضير
        //امانة بغداد
        ["9647721031222"], //شهد عبد الكريم قاسم
        //بيت الحكمة
        ["9647700630474"], //حسام خليل خضير
        //ديوان الوقف الشيعي
        ["9647706395488"], //عباس محمد عزيز
        //ديوان اوقاف الديانات المسيحية والايزيدية والصابئية
        ["9647712290391"], //فادي خالد ابراهيم
        //سلطة الطيران المدني
        ["9647700806036"], //سلام عدنان عبد الرحيم
        //شبكة الاعلام العراقي
        ["9647700090099"], //احمد عبد الستار حمزة
        //مجلس الدولة
        ["9647708116662"], //اسيا نعيم مطير

        ["9647823281148"], //ميثاق عايد فرحان
        ["9647704440440"], //عمار ابراهيم حيدر
        ["9647705859294"], //خالد محمد
        ["9647803169208"], //عقيل حسين حاجم
        ["9647706316745"], //علاء حسين علي
        ["9647739019638"], //رؤى جواد كاظم
        ["9647705522411"], //حسين جلاب محيسن
        ["9647705273540"], //سعد زكر محمد
        ["9647742800040"], //شهد عبد العظيم لطيف
        ["9647702765747"], //احمد عبد المهدي حسين
        ["9647710016073"], //حيدر قاسم عباس
        ["9647724419263"], //علي حاتم محمد
        ["9647725724569"], //ضرغام ناصب كريم
        ["9647714803311"], //حاجم حامد علي
        ["9647705522475"], //حسام دليل شناوة
        ["9647714493415"], //علي حسن ضمد
        ["9647832590637"], //مصطفى عبد القادر مهدي
        ["9647703991816"], //محمد جمال
        ["9647901599184"], //انمار اكرم جاسم
        ["9647805903344"], //رنا بربوتي
        ["9647704273759"], //نزار محمد سعيد
        ["9647713338999"], //صفوان هشام جاسم
        ["9647704909404"], //رؤى مجيد
        ["9647706230063"], //ايمن عماد رؤوف
        ["9647700983009"], //بلال عصام عبدالرزاق
        ["9647716128345"], //ايمان بدر
        ["9647714201626"], //طارق عبد العال
        ["9647702580887"], //جاسم محمد خليل
        ["9647716693802"], //أسامة صديق أحمد
        ["9647714613477", "9647801995566", "9647811911618"], //عباس رشدي ومصطفى صفاء
        ["9647734928266"], //مال الدفاع
        ["9647724272787"], //علي رعد عبدالله
        ["9647714380140"], //علي ماجد حميد
        ["9647705891646"], //لينا محمد عبد الوهاب
        ["9647704337297"], //علا قتيبة عبد الوهاب
        ["9647814563060"], //عمر رياض مولود
        ["9647706951451"], //حيدر عارم
        ["9647811969049"], //حيدر عبدالامير ناهي
        ["9647844447788"], //عمر محمد روضان
        ["9647716811541"], //محمد علي عبد شناوة
      ];

      //مال الي عدهم دوائر فرعية
      var Second_Main_Foundation = [
        /*
        "وزارة التخطيط", "وزارة العدل", "وزارة الصحة",
        */
        "مكتب رئيس الوزراء"
      ],
      Sub_Foundations = [
        /*
        //وزارة التخطيط
        "وزارة التخطيط - مقر الوزارة",
        "وزارة التخطيط - هيأة الاحصاء ونظم المعلومات الجغرافية",
        "وزارة التخطيط - المركز الوطني للتطوير الاداري وتقنية المعلومات",
        "وزارة التخطيط - هيئة الاعتماد العراقية",
        "وزارة التخطيط - الجهاز المركزي للتقييس والسيطرة النوعية",
        //"وزارة العدل"
        "وزارة العدل - دائرة الدوائر العدلية",
        "وزارة العدل - دائرة التسجيل العقاري",
        "وزارة العدل - دائرة رعاية القاصرين",
        "وزارة العدل - دائرة الكتاب العدول",
        "وزارة العدل - دائرة التنفيذ",
        "وزارة العدل - دائرة الاصلاح العراقية",
        "وزارة العدل - دائرة اصلاح الاحداث",
        //وزارة الصحة
        "وزارة الصحة - دائرة صحة كركوك",
        "وزارة الصحة - دائرة صحة المثنى",
        "وزارة الصحة - دائرة صحة ذي قار",
        "وزارة الصحة - دائرة صحة ديالى",
        "وزارة الصحة - دائرة صحة الانبار",
        "وزارة الصحة - دائرة صحة كربلاء",
        "وزارة الصحة - دائرة صحة الرصافة",
        "وزارة الصحة - دائرة صحة ميسان",
        "وزارة الصحة - دائرة مدينة الطب",
        "وزارة الصحة - مركز تكنولوجيا المعلومات (مقر الوزارة)",
        "وزارة الصحة - دائرة صحة الديوانية",
        "وزارة الصحة - دائرة صحة البصرة",
        */
        //مكتب رئيس الوزراء
        "المركز الوطني للتحول الرقمي",
      ],
      Sub_Phone_Numbers = [
        /*
        //وزارة التخطيط
        "9647716506408", //كمال محمد حسين
        "9647713824781", //حمزة عدنان داود
        "9647705385189", //انمار هاتف عبد المجيد
        "9647717732958", //رند صالح مجيد
        "9647901214611", //زينب صفاء عبد الجبار
        //وزارة العدل
        "9647703823514", //مصطفى نجدت مصطفى
        "9647703285050", //حيدر محمد علوان
        "9647714439217", //ياسر محمد شاكر
        "9647703604749", //محمد وسام حسين
        "9647706527992", //محمد حسين علوان
        "9647813333233", //احمد حسام الدين عباس
        "9647710608631", //علاء حسين صاحب
        //وزارة الصحة
        "9647701350567", //توفيق قيس حسيب
        "9647813444473", //احمد سعيد عبد العزيز ابراهيم
        "9647800007054", //معتز محمد ثامر حليحل
        "9647714706115", //عمر سامر حكمت نامق
        "9647805169084", //حازم حمد حمادي جاسم
        "9647706036160", //مصطفى مهدي صالح حسين
        "9647725988139", //ميساء علي حسين حسن
        "9647705511737", //مصطفى عباس حمود حسن
        "9647702535098", //مخلد محمد فلح حسن
        "9647818614990", //احمد رشيد زرزور يونس
        "9647725254525", //علي باسم خليل
        "9647705757880", //رغد اسعد جواد كاظم
        "9647740854626", //سيف مقداد ابراهيم
        */
        //مكتب رئيس الوزراء
        "9647716646815", //محمد كريم محمد شكر
      ],
      Array_Start = [
        //وزارة التخطيط
        0,
        //وزارة العدل
        5,
        //وزارة الصحة
        12,
        //المركز
        25,
      ],
      Arrary_End = [
        //وزارة التخطيط
        5,
        //وزارة العدل
        12,
        //وزارة الصحة
        25,
        //المركز
        26
      ];

      let matchFound = false; // Flag to track if a match is found

      if(this.inputFormField.formScopeType == "مقر المؤسسة الرئيسي"){
        for(var i = 0; i < Main_Foundation.length; i++){
          if(
            Main_Foundation[i] == this.inputFormField.organizationHeadquarters &&
            Main_Phone_Numbers[i].includes(this.inputFormField.employeePhoneNumber)
          ){
            matchFound = true;
            this.Block_Groups(Groups_ID);
            loader.hide();
            this.ssingleNotification("تم الدخول بنجاح", "top-right");
            break; // Exit the loop once a match is found
          }
        }
      }else if(this.inputFormField.formScopeType == "دائرة فرعية"){
        if(this.inputFormField.subOrganizationUnit != "غير ذلك"){
          for(var i = 0; i < Sub_Foundations.length; i++){
            if(Sub_Foundations[i] == this.inputFormField.subOrganizationUnit &&
              Sub_Phone_Numbers[i] == this.inputFormField.employeePhoneNumber
            ){
              matchFound = true;
            this.Block_Groups(Groups_ID);
            loader.hide();
            this.ssingleNotification("تم الدخول بنجاح", "top-right");
            break; // Exit the loop once a match is found
            }
          }
          /*
          for(var i = 0; i < Sub_Foundations.length; i++){
            if(Second_Main_Foundation[i] == this.inputFormField.organizationHeadquarters){
              for(var j = Array_Start[i]; j < Arrary_End[i]; j++){
                if(
                  Sub_Foundations[j] == this.inputFormField.subOrganizationUnit &&
                  Sub_Phone_Numbers[j] == this.inputFormField.employeePhoneNumber
                ){
                  matchFound = true;
                  this.Block_Groups(Groups_ID);
                  loader.hide();
                  this.ssingleNotification("تم الدخول بنجاح", "top-right");
                  break; // Exit the loop once a match is found
                }
              }
            }
          }
          */
        }else{
          for(var i = 0; i < Sub_Phone_Numbers.length; i++){
            if(Sub_Phone_Numbers[i] == this.inputFormField.employeePhoneNumber){
              matchFound = true;
              this.Block_Groups(Groups_ID);
              loader.hide();
              this.ssingleNotification("تم الدخول بنجاح", "top-right");
              break; // Exit the loop once a match is found
            }
          }
        }
      }else{
        matchFound = false;
      }

      if (!matchFound) {
        loader.hide();
        this.singleNotification("رقم الهاتف غير مطابق مع المخول ", "top-right");
      }
    }
  },
}