{
    First_Function(Field_ID, Field_Prog, Field_State){
        for(var i = 0; i < Field_ID.length; i++){
            document.getElementById(Field_ID[i]).style.display = Field_State;
            this.inputFormField[Field_Prog[i]] = null;
        }
    },

    Second_Function(event, Selected_Values, Showed_Values, Group_Num, Field_Num, Error_Message){
        for(var i = 0; i < Selected_Values.length; i++){
            if(event == Selected_Values[i]){
                this.group_of_form[Group_Num].fields[Field_Num].properties[0].values = Showed_Values[i];
                break;
            }else{
                this.group_of_form[Group_Num].fields[Field_Num].properties[0].values = Error_Message;
            }
        }
    },

    Third_Function(Field_ID, Field_Prog, Field_State){
        document.getElementById(Field_ID).style.display = Field_State;
        this.inputFormField[Field_Prog] = null;
    },

    First_Hide(event){
        var IDs = ["70327", "70966", "70967", "70968", "70970", "70334",],
        Progs = ["category", "ShNam", "Conect", "ResNum", "DecDate", "Msh",];

        if(event == "نعم"){
            this.First_Function(IDs, Progs, "block");
        }else{
            this.First_Function(IDs, Progs, "none");
        }
    },

    getsubCities(event) {
        var getdistinct =
            [
                [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", 
                    "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة", "القائم", "كبيسة", "الكرمة", 
                    "النخيب", "هيت", "الوفاء", "الوليد"
                ],//اقضية الانبار
                [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", 
                    "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة", "جرف النصر (جرف الصخر)", "سدة الهندية"
                ],//اقضية بابل
                [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون", 
                    "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام", "الرشيد", "الطارمية",
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", 
                    "الرصافة", "الصديق الاكبر", "الصدر الاولى", "الصدر الثانية", "التاجي", "الزهور", "بغداد الجديدة", 
                    "ذات السلاسل", "فلسطين"
                ],//اقضية بغداد
                [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", 
                    "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب", "طلحة", "أم قصر", "الامام الصادق"
                ],//اقضية البصرة
                [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", 
                    "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب", "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", 
                    "قرة تبة", "سيف سعد"
                ],//اقضية ديالى
                [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", 
                    "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور", "كرمة بني سعد", "قلعة سكر", "سيد دخيل", 
                    "سوق الشيوخ", "عكيكة"
                ],//اقضية ذي قار
                [
                    "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي", 
                    "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "طوز خورماتو", "يثرب", "العوجة"
                ],//اقضية صلاح الدين
                [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", 
                    "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر"
                ],//اقضية القادسية
                [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق", "كركوك", 
                    "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة", "يايجي"
                ],//اقضية كركوك
                [
                    "عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء"
                ],//اقضية كربلاء
                [
                    "الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان", 
                    "السماوة", "السوير"
                ],//اقضية المثنى
                [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير", 
                    "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم", "كميت", "قلعة صالح"
                ],//اقضية ميسان
                [
                    "العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", 
                    "القادسية", "النجف", "الشبكة"
                ],//اقضية النجف
                [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة", 
                    "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة", "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة", 
                    "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف", 
                    "وانة", "زيلكان", "زمار", "الفاروق"
                ],//اقضية نينوى
                [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية",
                    "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة", "جصان", "شيخ سعد", "الحفرية (تاج الدين)", 
                    "ناحية واسط"
                ],//اقضية واسط
                [
                    "اربيل", "عينكاوه", "بحركه", "شمامك"
                ],//اقضية اربيل
                [
                    "السليمانية", "قره داغ", "شاره زور", "سيد صادق", "بنجوين", "رانية", "دوكان", "دربنديخان",
                    "كلار", "جمجمال"
                ],//اقضية سليمانية
                [
                    "دهوك", "سميل", "زاخو"
                ],//اقضية دهوك
                [
                    "حلبجة",
                ],//اقضية حلبجة
            ],
            Values = [
                "الانبار", "بابل", "بغداد", "البصرة", "ديالى", "ذي قار",
                "صلاح الدين", "القادسية", "كركوك", "كربلاء المقدسة", "المثنى",
                "ميسان", "النجف الاشرف", "نينوى", "واسط", "اربيل", "سليمانية",
                "دهوك", "حلبجة"
            ];

        this.inputFormField["district"] = null;
        this.Second_Function(event, Values, getdistinct, 2, 5, ["اختر مديرية"]);
    },

    Second_Filter(event){
        var Values = [
            "معهد التدريب النفطي/ بغداد", "معهد التدريب النفطي/ بصرة", "معهد التدريب النفطي/ بيجي", 
            "معهد التدريب النفطي/ كركوك", "معهد التدريب النفطي/ ميسان",
        ],
        Showed_Values = [
            [
                "تربية الرصافة الأولى", "تربية الرصافة الثانية", "تربية الرصافة الثالثة", "تربية الكرخ الأولى", "تربية الكرخ الثانية",
                "تربية الكرخ الثالثة", "تربية بابل", "تربية كربلاء المقدسة", "تربية النجف الاشرف", "تربية الديوانية",
                "تربية المثنى", "تربية واسط", "تربية ديالى",
            ],//معهد بغداد
            [
                "تربية البصرة",
            ],//معهد البصرة
            [
                "تربية صلاح الدين", "تربية نينوى", "تربية الانبار",
            ],//معهد بيجي
            [
                "تربية كركوك", "تربية سليمانية", "تربية أربيل", "تربية دهوك", "تربية حلبجة",
            ],//معهد كركوك
            [
                "تربية ميسان", "تربية ذي قار",
            ],//معهد ميسان
        ];
        
        this.inputFormField["Edu"] = null;
        this.Second_Function(event, Values, Showed_Values, 3, 1, ["اختر معهد التدريب النفطي"]);
    },

    Second_Hide(event){
        if(event == "صناعي"){
            this.Third_Function("70291", "Special", "block");
            this.Third_Function("70319", "degree", "none");
            this.Third_Function("70321", "chance", "none");
        }else if(event == "علمي"){
            this.Third_Function("70291", "Special", "none");
            this.Third_Function("70319", "degree", "block");
            this.Third_Function("70321", "chance", "block");
        }else{
            this.Third_Function("70291", "Special", "none");
            this.Third_Function("70319", "degree", "none");
            this.Third_Function("70321", "chance", "none");
        }
    }
}