{
  document.getElementById("71088").style.display = "none";
  document.getElementById("71213").style.display = "none";
  document.getElementById("71216").style.display = "none";
  document.getElementById("71285").style.display = "none";
  document.getElementById("71295").style.display = "none";
  document.getElementById("71328").style.display = "none";
  document.getElementById("71353").style.display = "none";
  document.getElementById("71364").style.display = "none";
  document.getElementById("71359").style.display = "none";
  document.getElementById("71377").style.display = "none";
  document.getElementById("71389").style.display = "none";
  document.getElementById("71391").style.display = "none";
  document.getElementById("71400").style.display = "none";
  document.getElementById("71426").style.display = "none";
  document.getElementById("71433").style.display = "none";
  document.getElementById("71488").style.display = "none";

  //العناوين الرئيسية
  var Main_Labels_IDs = [
      //المجموعة الاولى
      "71033", //المعلومات الاولية
      "71062", //نظرة عامة عن النظام الحالي
      "71180", //استبيان قاعدة البيانات
      "71330", //استبيان أنواع المستخدمين
      "71392", //استبيان أهداف البرنامج
      "71413", //مصدر البيانات وممكناتها
      "71478", //معايير دقة البيانات
      //المجموعة الثانية
      "71036", //معلومات عامة
      "71061", //استبيان هندسة النظام
      "71068", //استبيان قاعدة البيانات
      "71077", //استبيان أنواع المستخدمين
      "71224", //استبيان أهداف البرنامج
      "71264", //استبيان مصدر البيانات وممكناتها
      "71336", //استبيان معايير دقة البيانات
    ],
    //العناوين الفرعية
    Sub_Labels_IDs = [
      //المجموعة الاولى
      "71035", //معلومات عامة عن البرنامج
      "71125", //الربط مع نظام السجل الموحد (SRS)
      "71138", //قابلية التوسع والأداء:
      "71152", //الأمن والمرونة
      "71161", //مجموعة التقنيات والتوافقية
      "71172", //بيئة التطوير والنشر:
      "71185", //نظرة عامة على قاعدة البيانات الحالية:
      "71195", //عناصر البيانات لربط نظام السجل الموحد (SRS):
      "71212", //ترحيل البيانات والمزامنة
      "71251", //أمن قاعدة البيانات والتحكم في الوصول
      "71271", //أرشفة البيانات والاحتفاظ بها
      "71316", //أداء قاعدة البيانات وتحسينها
      "71342", //تحديد أدوار المستخدمين
      "71350", //التفاعل مع النظام المتكامل
      "71367", //وصول المستخدم والمصادقة
      "71379", //التدريب والدعم
      "71385", //تفضيلات واجهة المستخدم (UI) وتجربة المستخدم (UX)
      "71395", //الأهداف العامة للبرنامج
      "71397", //تأثير ربط نظام السجل الموحد (SRS)
      "71401", //استهداف المستفيدين واختيارهم
      "71406", //الرصد والتقييم (M&E)
      "71410", //التحديات والفرص
      "71415", //تحديد مصادر البيانات:
      "71419", //ممكني البيانات و ادوارهم:
      "71423", //طرق جمع البيانات
      "71428", //التحقق من البيانات وتنظيفها
      "71434", //ملكية البيانات وحوكمتها:
      "71438", //مصادر البيانات المستقبلية
      "71459", //الاتصال مع ممكني البيانات
      "71465", //معالجة الأخطاء والتسجيل
      "71469", //الشبكة والبنية التحتية
      "71474", //المصادقة والتفويض للاتصال
      "71483", //تعريف دقة البيانات
      "71484", //تقييم جودة البيانات الحالي
      "71489", //قواعد التحقق من البيانات
      "71492", //تنظيف البيانات وتصحيحها
      "71496", //تسوية البيانات
      "71499", //الرصد والإبلاغ عن دقة البيانات
      "71503", //الأدوار والمسؤوليات لجودة البيانات
      //المجموعة الثانية
      "71038", //معلومات عامة عن البرنامج
      "71063", //نظرة عامة على النظام الحالي
      "71069", //أرشفة البيانات والاحتفاظ بها
      "71078", //تحديد أدوار المستخدمين
      "71082", //التفاعل مع النظام المتكامل
      "71123", //وصول المستخدم والمصادقة
      "71183", //التدريب والدعم
      "71207", //تفضيلات واجهة المستخدم (UI) وتجربة المستخدم (UX)
      "71226", //الأهداف العامة للبرنامج
      "71229", //تأثير ربط نظام السجل الموحد (SRS)
      "71239", //استهداف المستفيدين واختيارهم
      "71250", //الرصد والتقييم (M&E)
      "71258", //التحديات والفرص
      "71274", //ممكنات البيانات وأدوارها
      "71278", //طرق جمع البيانات
      "71286", //التحقق من البيانات وتنظيفها
      "71297", //ملكية البيانات وحوكمتها
      "71307", //مصادر البيانات المستقبلية
      "71338", //تعريف دقة البيانات
      "71346", //تقييم جودة البيانات الحالي
      "71354", //قواعد التحقق من البيانات
      "71360", //تنظيف البيانات وتصحيحها
      "71368", //تسوية البيانات
      "71373", //رصد والإبلاغ عن دقة البيانات
      "71380", //الأدوار والمسؤوليات لجودة البيانات
    ],
    //شروحات
    Explain_Labels_IDs = [
      //المجموعة الاولى
      "71065", //اول مقطع
      "71182", //ثاني مقطع
      "71332", //ثالث مقطع
      "71394", //رابع مقطع
      "71414", //خامس مقطع
      "71479", //سادس مقطع
      //المجموعة الثانية
    ];

  //خصائص العناوين الرئيسية
  for (var i = 0; i < Main_Labels_IDs.length; i++) {
    if (i == 0) {
      document.getElementById(Main_Labels_IDs[i]).style.cssText =
        "color: #B22222; font-size: 25px; font-weight: bold; padding-bottom: 10px; text-align: center;";
    } else {
      document.getElementById(Main_Labels_IDs[i]).style.cssText =
        "color: #B22222; font-size: 25px; font-weight: bold; padding-bottom: 13px; padding-top: 18px; text-align: center;";
    }
  }

  for (var i = 0; i < Sub_Labels_IDs.length; i++) {
    document.getElementById(Sub_Labels_IDs[i]).style.cssText =
      "color: #012042ff; font-size: 20px; font-weight: bold; padding-top: 10px; padding-bottom: 10px;";
  }

  for (var i = 0; i < Explain_Labels_IDs.length; i++) {
    document.getElementById(Explain_Labels_IDs[i]).style.cssText =
      "font-size: 16px; font-weight: bold; padding-top: 10px; padding-bottom: 10px;";
  }

  //الملاحظة الي بنهاية اول استبيان
  document.getElementById("71508").style.cssText =
    "color: #124b1aff; font-size: 18px; font-weight: bold; padding-top: 10px; padding-bottom: 10px;";

  //الملاحظة الي بنهاية ثاني استبيان
  document.getElementById("71388").style.cssText =
    "color: #124b1aff; font-size: 18px; font-weight: bold; padding-top: 10px; padding-bottom: 10px;";
}
