{
  var Labels_ID = [
    "68022", //الاسم الرباعي لمؤسس المكتب (المدير)
    "68027", //اكتب الاسم الرباعي باللغة الانكليزية
    "68042", //الاسم الرباعي للمؤسس الثاني
    "68049", //اكتب الاسم الرباعي للمؤسس الثاني باللغة الانكليزية
    "68232", //معلومات عنوان المكتب
    "68238", //معلومات عنوان سكن مدير المكتب,
    "68244", //معلومات عنوان سكن المؤسس الثاني
    "68250", //في هذه الخطوة اذكر كل المعلومات التي تخص تعاملكم مع الجهات الاخرى ومدة الخدمة
    "70355", //معلومات العامل الاول
    "68984", //معلومات العامل الثاني
    "68974", //معلومات العامل الثالث
    "69052", //معلومات العامل الرابع
    "70343", //معلومات العامل الخامس
    "70349", //معلومات العامل السادس
    "70363", //معلومات العامل السابع
    "70370", //معلومات العامل الثامن
    "70377", //معلومات العامل التاسع
    "70384", //معلومات العامل العاشر
  ];

  for (var i = 0; i < Labels_ID.length; i++) {
    //لتغيير خصائص كل الليبل
    document.getElementById(Labels_ID[i]).style.cssText =
      "font-size: 20px; font-weight: bold; padding-top: 10px; padding-bottom: 10px;";
  }

  //اخفاء جزء من الليبلات
  var Hidden_Labels = [
    "68042", //الاسم الرباعي للمؤسس الثاني
    "68049", //اكتب الاسم الرباعي للمؤسس الثاني باللغة الانكليزية
    "68244", //معلومات عنوان سكن المؤسس الثاني
    "70355", //معلومات العامل الاول
    "68984", //معلومات العامل الثاني
    "68974", //معلومات العامل الثالث
    "69052", //معلومات العامل الرابع
    "70343", //معلومات العامل الخامس
    "70349", //معلومات العامل السادس
    "70363", //معلومات العامل السابع
    "70370", //معلومات العامل الثامن
    "70377", //معلومات العامل التاسع
    "70384", //معلومات العامل العاشر
  ];

  for (var i = 0; i < Hidden_Labels.length; i++) {
    document.getElementById(Hidden_Labels[i]).style.display = "none";
  }

  //-------------------------------------------------------------------------------------------------
  //لاخفاء المجاميع
  var Groups_ID = [
    "34098_group",
    "34099_group",
    "34100_group",
    "34101_group",
    "34537_group",
  ];

  for (var i = 0; i < Groups_ID.length; i++) {
    document.getElementById(Groups_ID[i]).style.display = "none";
  }

  //-------------------------------------------------------------------------------------------------
  //لحصر بعض الحقول باللغة الانكليزية فقط
  function English_Only(Fields_ID) {
    for (var i = 0; i < Fields_ID.length; i++) {
      const input = document.getElementById(Fields_ID[i]);

      input.addEventListener("keydown", (e) => {
        const ctrl = e.ctrlKey || e.metaKey;
        if (ctrl || e.key.length > 1) return; // السماح بالاختصارات والأسهم

        // السماح بالحروف الإنجليزية والمسافة فقط
        if (!/^[A-Za-z ]$/.test(e.key)) {
          e.preventDefault(); // منع أي شيء غير ذلك
        }
      });
    }
  }

  var English_Fields_ID = [
    //مجموعة المعلومات الرئيسية
    "68019", //اسم المكتب باللغة الانكليزية
    //مؤسس المكتب
    "68028", //First Name
    "68029", //Second Name
    "68034", //Third Name
    "68035", //Fourth Name
    //المؤسس الثاني
    "68043", //First Name (المؤسس الثاني)
    "68050", //Second Name (المؤسس الثاني)
    "68052", //Third Name (المؤسس الثاني)
    "68053", //Fourth Name (المؤسس الثاني)
  ];

  English_Only(English_Fields_ID);

  //-------------------------------------------------------------------------------------------------
  //حصر الحقول باللغة العربية فقط
  function Arabic_Only(Fields_ID) {
    for (var i = 0; i < Fields_ID.length; i++) {
      const input = document.getElementById(Fields_ID[i]);
      input.addEventListener("keydown", (e) => {
        const ctrl = e.ctrlKey || e.metaKey;
        if (ctrl || e.key.length > 1) return; // السماح بالاختصارات والأسهم

        // الأحرف العربية + الهمزة + المسافة
        if (!/^[\u0600-\u06FF\s]$/.test(e.key)) {
          e.preventDefault(); // منع أي شيء غير عربي
        }
      });
    }
  }

  var Arabic_Fields_ID = [
    //مجموعة المعلومات الرئيسية
    "68018", //اسم المكتب باللغة العربية
    "68020", //اختصاص المكتب
    "68021", //نشاط المكتب
    //مؤسس المكتب
    "68023", //الاسم الاول
    "68024", //الاسم الثاني
    "68025", //الاسم الثالث
    "68026", //الاسم الرابع
    //المؤسس الثاني
    "68045", //الاسم الاول للمؤسس الثاني
    "68048", //الاسم الثاني للمؤسس الثاني
    "68046", //الاسم الثالث للمؤسس الثاني
    "68047", //الاسم الرابع للمؤسس الثاني
    //مجموعة التوظيف لدى الجهات الاخرى
    "68251",
    "68252",
    "68253",
    "68254",
    "68255",
    "68256",
    "68257",
    "68258",
    "68259",
    "68260",
    //مجموعة اسماء العاملين في المكتب
    //معلومات العامل الاول
    "68899",
    "68901",
    "68908",
    "68909",
    "68913",
    //معلومات العامل الثاني
    "68900",
    "68917",
    "68919",
    "68921",
    "68925",
    //معلومات العامل الثالث
    "68981",
    "68982",
    "68985",
    "70339",
    "68988",
    //معلومات العامل الرابع
    "69053",
    "69054",
    "69055",
    "68986",
    "70342",
    //معلومات العامل الخامس
    "70294",
    "70344",
    "70345",
    "70346",
    "70348",
    //معلومات العامل السادس
    "70296",
    "70350",
    "70351",
    "70352",
    "70361",
    //معلومات العامل السابع
    "70298",
    "70364",
    "70365",
    "70366",
    "70368",
    //معلومات العامل الثامن
    "70302",
    "70371",
    "70372",
    "70373",
    "70375",
    //معلومات العامل التاسع
    "70299",
    "70378",
    "70379",
    "70380",
    "70382",
    //معلومات العامل العاشر
    "70300",
    "70385",
    "70386",
    "70387",
    "70389",
    //مجموعة الاعمال المنجزة من قبل المكتب
    "70919",
    "70921",
    "70917",
    "70925",
    "70973",
    "70974",
    "70977",
    "71016",
    "71019",
    "71020",
    "72009",
    "72010",
    "72013",
    "72014",
    "72109",
    "72110",
    "72113",
    "72114",
    "72117",
    "72118",
    "72123",
    "72124",
    "72127",
    "72128",
    "72131",
    "72132",
    "72135",
    "72136",
    "72139",
    "72140",
  ];

  Arabic_Only(Arabic_Fields_ID);
}
