{
    First_Filter(event){
        var Selected_Values = [
            "الخالص", "المقدادية", "المنصورية", "بعقوبة", "بلدروز", "خانقين", "كفري", "مندلي",
        ],
        Showed_Values = [
            ["مركز قضاء الخالص", "هبهب", "جديدة الشط", "سد العظيم", "جيزاني الجبل", "السلام",],//نواحي الخالص
            ["مركز قضاء المقدادية", "ابي صيدا", "الوجيهية",],//نواحي المقدادية
            ["مركز قضاء المنصورية",],//نواحي المنصورية
            ["مركز قضاء بعقوبة", "كنعان", "بني سعد", "بهرز", "العبارة", "محمد سكران",],//نواحي بعقوبة
            ["مركز قضاء بلدروز",],//نواحي بلدروز
            ["مركز قضاء خانقين", "جولاء", "السعدية",],//نواحي خانقين
            ["مركز قضاء كفري", "قرة تبة", "جبارة",],//نواحي كفري
            ["مركز قضاء مندلي", "قزانية",],//نواحي مندلي
        ];

        for(var i = 0; i < Selected_Values.length; i++){
            if(event == Selected_Values[i]){
                this.group_of_form[0].fields[13].properties[0].values = Showed_Values[i];
                break;
            }else{
                this.group_of_form[0].fields[13].properties[0].values = [];
            }
        }
    },
}