{
    FirstHide(event){
        var PlaceName = [
            [
                "مكتب المحافظ", "مكتب المعاون الاداري وشؤون الوحدات الادارية", "مكتب المعاون لشؤون الخدمات", "مكتب المعاون لشؤون الطاقة", "مكتب المعاون للشؤون الفنية",
                "مكتب المعاون للشؤون القانونية", "مكتب النائب الاول", "مكتب النائب الفني", "مكتب التصاريح الامنية", "دائرة الشؤون المالية والادارية", "قسم ادارة الموارد البشرية",
                "قسم الادارة العامة والتنسيق الحكومي", "قسم الاعلام والاتتصال الحكومي", "قسم الاملاك", "قسم البريد المركزي", "قسم التخطيط العام", "قسم التخطيط المالي", "قسم التدقيق",
                "قسم التعويضات", "قسم التقاعد", "قسم التنسيق الامني", "قسم التنظيم المالي", "قسم الحسابات", "قسم الخدمات", "قسم الشؤون البلدية", "قسم الشؤون الثقافية والفنون",
                "قسم الشؤون القانونية", "قسم العقود", "قسم المخازن", "قسم المراة والاسرة والطفل", "قسم الملاكات", "قسم الهندسة", "قسم تعظيم الموارد المالية",
                "قسم تقويم الاداء والجودة", "قسم شؤون المواطنين", "قسم نظم المعلومات"
            ],//ديوان محافظة بغداد

            [
                "المركز الثقافي البغدادي", "المكتبة المركزية", "مكتبة ابن الجوزي", "مكتبة ابن الملهب", "مكتبة ابن الهيثم", "مكتبة ابن خلدون", "مكتبة الدكتور حسين علي محفوظ",
                "مكتبة الحرية", "مكتبة الدورة", "مكتبة الرازي", "مكتبة الزهور", "مكتبة السلام", "مكتبة الشهيد محمد باقر الصدر", "مكتبة الصدر العامة", "مكتبة الكاظمية",
                "مكتبة الكندي", "مكتبة المامون", "مكتبة المثنى", "مكتبة المدائن", "مكتبة الوحدة", "مكتبة سبع البور"
            ],//المكتبات

            [
                "قضاء ابي غريب", "قضاء العظمية", "قضاء التاجي", "قضاء الراشدية", "قضاء الرصافة", "قضاء الزهور", "قضاء الزوراء", "قضاء الصدر / 1", "قضاء الصدر / 2",
                "قضاء الطارمية", "قضاء الكاظمية", "قضاء الكرخ", "ناحية ابناء الرافدين", "ناحية التاجي الجديدة", "ناحية الجسر", "ناحية الحرية", "ناحية الحماميات",
                "ناحية الراشدية الجديدة", "ناحية الربيع", "ناحية الرشيد", "ناحية الزعفرانية", "ناحية الصديق الاكبر", "ناحية العبايجي", "ناحية الفحامة", "ناحية الفرات",
                "ناحية الكرادة الشرقية", "ناحية اللطيفية", "ناحية المامون", "ناحية المشاهدة", "ناحية المنصور", "ناحية المنورة", "ناحية النصر والسلام", "ناحية النهروان",
                "ناحية الوحدة", "ناحية اليوسفية", "ناحية بغداد الجديدة", "ناحية بوابة السلام", "ناحية سبع البور", "ناحية عكركوف", "ناحية فلسطين"
            ],//الاقضية والنواحي
        ];

        if(event == "ديوان محافظة بغداد"){
            this.group_of_form[1].fields[1].properties[0].values = PlaceName[0];
        }else if(event == "الاقضية والنواحي"){
            this.group_of_form[1].fields[1].properties[0].values = PlaceName[2];
        }else if(event == "المكتبات"){
            this.group_of_form[1].fields[1].properties[0].values = PlaceName[1];
        }else{
            this.group_of_form[1].fields[1].properties[0].values = ["قم باختيار مكان العمل الحالي اولا"];
        }
    },

    SecondHide(event){
        this.inputFormField["nummmmm"] = null;
        if(event == "تجديد"){
            document.getElementById("53425").style.display = "block";
        }else{
            document.getElementById("53425").style.display = "none";
        }
    },

    Third_Hide(event){
        this.inputFormField["wafe"] = null; //اسم الزوج/ة
        this.inputFormField["wor"] = null; //وظيفة الزوج/ة
        if(event == "متزوج/ة"){
            document.getElementById("53428").style.display = "block"; //اسم الزوج/ة
            document.getElementById("53429").style.display = "block"; //وظيفة الزوج/ة
        }else{
            document.getElementById("53428").style.display = "none";
            document.getElementById("53429").style.display = "none";
        }
    },

    Fourth_Hide(event){
        this.inputFormField["alhj"] = null; //الجهة المنسب منها
        if(event == "نعم"){
            document.getElementById("53437").style.display = "block";
        }else{
            document.getElementById("53437").style.display = "none";
        }
    }
}