{
  /*
        * هذا الملف خاص بالحالات التي يتم تطبيقها خلال تقديم المواطن على الاستمارة
        ! الحالات الاكثر شيوعا:
        * 1- اخفاء واظهار حقول او مجاميع
        * 2- فلترة القوائم المنسدلة
        * 3- تسجيل الدخول على اساس يوزر وباسوورد او رقم هاتف او اي قيمة اخرى
        * 4- "label" تغيير خصائص حقل

        ! formfeapplyService هو "Code snippet type" لاضافة الكود البرمجي بعد اكماله يجب ان يكون نوع ملف الشفرة البرمجية
        ! during هو "Run Time" ووقت العمل

        ! :الكودات البرمجية التي سيتم كتابتها هنا تحتاج نوعين من الحقول
        * النوع الاول هو نستطيع تسميته بحقل الاساس وهو الذي سيكون عليه الاعتماد باخفاء واظهار الحقول او المجاميع
        * او الفلتره والى اخره وحسب القيمة التي سوف يختارها المواطن من هذا الحقل
        
        * النوع الثاني هو الحقول المخفيه والتي تظهر وتختفي حسب القيمة المختاره في حقل الاساس في النوع الاول
        
        ! من داخل اعدادات الحقل required والغاء خيار hidden الحقول التي نود اظهارها واخفائها يجب جعلها
        ! سوف توقف الخدمة اذا كان الحقل مخفي وتجعل المواطن لا يستطيع العبور للملفات required و hidden لكون الحقول التي تكون 
        
        * وهو الرقم الذي يميز الحقل او المجموعه عن باقي الحقول او المجاميع ID لاخفاء واظهار الحقل او المجموعه، يتم استخدام رقم مميز يدعى
       
        ! {} لكتابة الكود البرمجي يحتاج ان يتم كتابته بين اقواس من نوع
        ! يجب ان يكون مميز لكون تكرر الاسم يجعل الكود البرمجي لا يعمل لتشابه الاسماء function اسم
        ! , يتم كتابتها يجب الفصل بينهم بالفارزة function وبين كل

        * بعد ان يتم اضافة الكود البرمجي الى الخدمة نحتاج الى ان نربط الدالة مع الحقل الاساس لكي تعمل الدالة عند اي اختيار
        * ?Is_Dependable ويتم اضافة الدالة الى الحقل الاساس من خلال الذهاب الى اعدادات الحقل ومن ثم وضع علامة صح على خيار
        * ووضع اسم الدالة فقط ومن دون الاقواس والتي سوف تعمل على هذا الحقل الاساس
        
        * document.getElementById("").style.display = "block"; نستخدم هذا الايعاز
        * الخاص بالحقل ونضعه داخل الفواصل ID لاستدعاء الحقل او المجموعه المطلوب اخفائها او اظهارها من خلال رقم
        ! none لاخفاء الحقل او المجموعة نستخدم كلمة
        ! block لاظهار الحقل او المجموعة نستخدم كلمة

        * this.inputFormField["Member"] = null; نستخدم هذا الايعاز
        * لحذف القيمة التي تمت كتابتها داخل الحقل ونستخدم الاسم البرمجي للحقل ونضعه داخل الفواصل
        * لجعل النص فارغ null نستخدم القيمة
        
        * مثل اخفاء بعض المجاميع Form_Intail.js بعض الحالات تكون مرتبطة باكواد برمجية تعمل عند فتح الاستمارة والموجودة في ملف
    */

    //-----------------------------------------------------------------------------------------------------------------------------
    //! لاخفاء واظهار حقل واحد
    First_Case(event){
        this.inputFormField["ProgName"] = null; //* inputFormField نضع الاسم البرمجي للحقل داخل "" في ايعاز

        //* هنا نضع الشرط او الشروط الذي على اساسه يظهر الحقل وبخلافه يختفي
        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        if(event == "قيمة الشرط"){
            //* لاظهار الحقل عند تحقق الشرط
            document.getElementById("64413").style.display = "block";
        }else{
            //* لاخفاء الحقل عند عدم تحقق الشرط
            document.getElementById("64413").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! لاخفاء واظهار عدة حقول
    Second_Case(event){
        //* او اسم برمجي لمعرفة الحقل الخاص به ID وجود التعليقات امام كل
        //* يمكن اضافة او حذف حقول من المصفوفتين حسب عدد الحقول المطلوب اخفائهم
        //* الخاصة بكل حقل ID قيم
        var Fields_IDs = [
            "12345", //* الحقل الاول ID
            "56789", //* الحقل الثاني ID
            "14789", //* الحقل الثالث ID
        ],
        //* الاسماء البرمجية الخاصة بكل حقل
        Field_Progs = [
            "FirstProg", //* الاسم البرمجي للحقل الاول
            "SecondProg", //* الاسم البرمجي للحقل الثاني
            "ThirdProg", //* الاسم البرمجي للحقل الثالث
        ];
        
        //* تفريغ الحقول من النص الذي بداخلها
        Field_Progs.forEach((Clearing) => this.inputFormField[Clearing]);
        
        //* هنا نضع الشرط او الشروط الذي على اساسه الحقول تظهر وخلافه يختفي
        if(event == "قيمة الشرط"){
            //* لاظهار الحقول عند تحقق الشرط
            Fields_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
        }else{
            //* لاخفاء الحقول عند تحقق الشرط
            Fields_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist اخفاء واظهار حقل على اساس
    Third_Case(event){
        //* inputFormField نضع الاسم البرمجي للحقل داخل ايعاز
        this.inputFormField["namethan"] = null;

        //* في هذا المتغير نضع قيمة الشرط التي ستجعل الحقل يظهر وعند عدم اختيارها يختفي الحقل condition_Value
        let Condition_Value = "قيمة الشرط";

        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        if(event.includes(Condition_Value)){
            //* لاظهار الحقل عند تحقق الشرط
            document.getElementById("89571").style.display = "block";
        }else{
            //* لاظهار الحقل عند عدم تحقق الشرط
            document.getElementById("89571").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist اخفاء واظهار عدة حقول على اساس
    Fourth_Case(event){
        //* او اسم برمجي لمعرفة الحقل الخاص به ID وجود التعليقات امام كل
        //* يمكن اضافة او حذف حقول من المصفوفتين حسب عدد الحقول المطلوب اخفائهم
        //* الخاصة بكل حقل ID
        var Fields_IDs = [
            "12345", //* الحقل الاول ID
            "56789", //* الحقل الثاني ID
            "14789", //* الحقل الثالث ID
        ],
        //* الاسماء البرمجية الخاصة بكل حقل
        Field_Progs = [
            "FirstProg", //* الاسم البرمجي للحقل الاول
            "SecondProg", //* الاسم البرمجي للحقل الثاني
            "ThirdProg", //* الاسم البرمجي للحقل الثالث
        ];

        //! تفريغ الحقول من النص الذي بداخلها
        Field_Progs.forEach((Clearing) => this.inputFormField[Clearing]);

        //! في هذا المتغير نضع قيمة الشرط التي ستجعل الحقل يظهر وعند عدم اختيارها يختفي الحقل condition_Value
        let Condition_Value = "قيمة الشرط";

        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        if(event.includes(Condition_Value)){
            //* لاظهار الحقل عند تحقق الشرط
            Fields_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
        }else{
            //* لاظهار الحقل عند عدم تحقق الشرط
            Fields_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! اخفاء واظهار مجموعة بالاستمارة
    //* First_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Fifth_Case(event){
        //* اسماء الحقول البرمجية الخاصة بالمجموعة
        //* يمكن اضافة او حذف حقول من المصفوفة حسب عدد الحقول الموجودة في المجموعة
        var Progs = [
            "FirstProg", //* الاسم البرمجي للحقل الاول
            "SecondProg", //* الاسم البرمجي للحقل الثاني
            "ThirdProg", //* الاسم البرمجي للحقل الثالث
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* لجعل الكود يميز انها مجموعة وليس حقل _group مع اضافة getElementById الخاص بالمجموعة داخل "" في ايعاز IDنضع الـ
        //* هنا نضع الشرط او الشروط التي على اساسه المجموعة تظهر وخلافه تختقي
        if(event == "الشرط الاول"){
            //!لاظهار المجموعة عند تحقق الشرط
            document.getElementById("12345_group").style.display = "block";
        }else{
            //! لاخفاء المجموعة عند تحقق الشرط
            document.getElementById("12345_group").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! اخفاء واظهار مجاميع بالاستمارة
    //* Second_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Sixth_Case(event){
        //* لجعل الكود يميز انها مجموعة وليس حقل _group المجاميع ويتم اضافة IDمصفوفة خاصة بالـ
        //* يمكن اضافة او حذف عدد المجاميع حسب عدد المجاميع المطلوب اظهارهم او اخفائهم في الخدمة
        var Group_IDs = [
            "12345_group", //* المجموعة الاولى ID
            "56789_group", //* المجموعة الثانية ID
        ],
        //* الاسماء البرمجية الخاصة بكل حقول المجاميع
        //* يمكن اضافة او حذف حقول من المصفوفة حسب عدد الحقول الموجودة في كل مجموعة
        Progs = [
            //* الاسماء البرمجية للمجموعة الاولى
            "FirstName", //* الاسم البرمجي للحقل الاول
            "SecondName", //* الاسم البرمجي للحقل الثاني
            "ThirdName", //* الاسم البرمجي للحقل الثالث
            //* الاسماء البرمجية للمجموعة الثانية
            "FourthName", //* الاسم البرمجي للحقل الاول
            "FifthName", //* الاسم البرمجي للحقل الثاني
            "SixthName", //* الاسم البرمجي للحقل الثالث
        ];

        //* لافراغ محتوى حقول المجاميع
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* هنا نضع الشرط او الشروط التي على اساسها المجموعة تظهر وخلافه تختقي
        if(event == "الشرط الاول"){
            //! لاظهار المجاميع عند تحقق الشرط
            Group_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
        }else{
            //! لاخفاء المجاميع عند تحقق الشرط
            Group_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist اخفاء واظهار مجموعة على اساس
    //* First_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Seventh_Case(event){
        //* اسماء الحقول البرمجية الخاصة بالمجموعة
        //* يمكن اضافة او حذف حقول من المصفوفة حسب عدد الحقول الموجودة المجموعة
        var Progs = [
            "FirstName", //الاسم البرمجي للحقل الاول
            "SecondName", //الاسم البرمجي للحقل الثاني
            "ThirdName", //الاسم البرمجي للحقل الثالث
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* في هذا المتغير نضع قيمة الشرط التي ستجعل الحقل يظهر وعند عدم اختيارها يختفي الحقل condition_Value
        let Condition_Value = "قيمة الشرط";

        //* لجعل الكود يميز انها مجموعة وليس حقل _group مع اضافة getElementById الخاص بالمجموعة داخل "" في ايعاز IDنضع الـ
        if(event.includes(Condition_Value)){
            //! لاظهار المجموعة عند تحقق الشرط
            document.getElementById("12345_group").style.display = "block";
        }else{
            //! لاخفاء المجموعة عند تحقق الشرط
            document.getElementById("12345_group").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist اخفاء واظهار عدة مجاميع على اساس
    //* Second_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Eighth_Case(event){
        //* لجعل الكود البرمجي يتعرف على انها مجموعة وليس حقل _group الخاصة بكل مجموعة مع اضافة جملة ID
        var Group_IDs = [
            "12345_group", //* المجموعة الاولى ID
            "56789_group", //* المجموعة الثانية ID
        ],
        //* الاسماء البرمجية الخاصة بكل حقول المجاميع
        Progs = [
            //* الاسماء البرمجية للمجموعة الاولى
            "FirstName", //* الاسم البرمجي للحقل الاول
            "SecondName", //* الاسم البرمجي للحقل الثاني
            "ThirdName", //* الاسم البرمجي للحقل الثالث
            //* الاسماء البرمجية للمجموعة الثانية
            "FourthName", //* الاسم البرمجي للحقل الاول
            "FifthName", //* الاسم البرمجي للحقل الثاني
            "SixthName", //* الاسم البرمجي للحقل الثالث
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* في هذا المتغير نضع قيمة الشرط التي ستجعل الحقل يظهر وعند عدم اختيارها يختفي الحقل condition_Value
        let Condition_Value = "قيمة الشرط";

        if(event.includes(Condition_Value)){
            //! لاظهار المجاميع عند تحقق الشرط
            Group_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");
        }else{
            //! لاخفاء المجاميع عند تحقق الشرط
            Group_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! لاخفاء حقلين وكل حقل يظهر على اساس شرط معين
    Ninth_Case(event){
        //لتفريغ محتوى الحقول
        this.inputFormField["FirstField"] = null; //* inputFormField نضع الاسم البرمجي للحقل الاول داخل "" في ايعاز
        this.inputFormField["SecondField"] = null; //* inputFormField نضع الاسم البرمجي للحقل الاول داخل "" في ايعاز

        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        //* نضع الشرط او الشروط التي ستظهر الحقل او الحقول التابعه لها وتخفي الحقل او الحقول غير التابعه لها if مع كل شرط
        if(event == "القيمة الاولى"){
            //! اظهار الحقل الاول التابع لهذا الشرط
            document.getElementById("12345").style.display = "block";

            //! اخفاء الحقل الثاني التابع للشرط الثاني
            document.getElementById("67890").style.display = "none";
        }else if(event == "القيمة الثانية"){
            //! اظهار الحقل الاول التابع لهذا الشرط
            document.getElementById("67890").style.display = "block";

            //! اخفاء الحقل الاول التابع للشرط الاول
            document.getElementById("12345").style.display = "none";
        }else{
            //! اخفاء كل الحقول في حال عد اختيار اي قيمة متطابقة مع اي شرط
            document.getElementById("12345").style.display = "none";
            document.getElementById("67890").style.display = "none";
        }
    },
    
    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist لاخفاء حقلين وكل حقل يظهر على اساس شرط معين وعلى اساس
    Tenth_Case(event){
        //* لتفريغ محتوى الحقول
        this.inputFormField["FirstField"] = null; //* inputFormField نضع الاسم البرمجي للحقل الاول داخل "" في ايعاز
        this.inputFormField["SecondField"] = null; //* inputFormField نضع الاسم البرمجي للحقل الاول داخل "" في ايعاز

        let First_Conidtion = "القيمة الاولى", //* خاص بالشرط او الشروط التي عند تحققها يظهر الحقل الاول First_Condition
        Second_Condition = "القيمة الثانية"; //* خاص بالشرط او الشروط التي عند تحققها يظهر الحقل الثاني Second_Condition

        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        //* نضع الشرط او الشروط التي ستظهر الحقل او الحقول التابعه لها وتخفي الحقل او الحقول غير التابعه لها if مع كل شرط
        if(event.includes(First_Conidtion)){
            //! اظهار الحقل الاول التابع بهذا الشرط
            document.getElementById("12345").style.display = "block";

            //! اخفاء الحقل الثاني التابع للشرط الثاني
            document.getElementById("67890").style.display = "none";
        }else if(event.includes(Second_Condition)){
            //! اظهار الحقل الاول التابع بهذا الشرط
            document.getElementById("67890").style.display = "block";

            //! اخفاء الحقل الاول التابع للشرط الاول
            document.getElementById("12345").style.display = "none";
        }else{
            //! اخفاء كل الحقول في حال عد اختيار اي قيمة متطابقة مع اي شرط
            document.getElementById("12345").style.display = "none";
            document.getElementById("67890").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! لاخفاء عدة حقول وكل مجموعة حقول تظهر على اساس شرط معين
    Eleventh_Case(event){
        //! الخاصة بالحقول التابعة للشرط الاول IDتمثل قيم الـ First_IDs
        //! الخاصة بالحقول التابعة للشرط الثاني IDتمثل قيم الـ Second_IDs
        let First_IDs = [
            "12345", //الحقل الاول ID
            "67890", //الحقل الثاني ID
            "14789", //الحقل الثالث ID
        ],
        Second_IDs = [
            "36987", //الحقل الاول ID
            "78965", //الحقل الثاني ID
            "98741", //الحقل الثالث ID
        ];

        //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
        //! Selected_Value قيمة الشرط
        //! Showed_Fields الحقول التي ستظهر عند تحقق الشرط ID قيم
        //! Hidden_Fields الحقول التي ستختفي عند تحقق الشرط ID قيم
        //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
        let Values = [
            {
                Selected_Value: "قيمة الشرط الاول",
                Showed_Fields: First_IDs,
                Hidden_Fields: Second_IDs
            },
            {
                Selected_Value: "قيمة الشرط الثاني",
                Showed_Fields: Second_IDs,
                Hidden_Fields: First_IDs,
            },
        ];
        
        //* الاسماء البرمجية للحقول
        var Progs = [
            //الاسماء البرمجية لحقول اول شرط
            "FirstField", //الحقل الاول
            "SecondField", //الحقل الثاني
            "ThirdField", //الحقل الثالث
            //الاسماء البرمجية لحقول ثاني شرط
            "FourthField", //الحقل الاول
            "FifthField", //الحقل الثاني
            "SixthField", //الحقل الثالث
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* الموجود في المصفوفة اعلاه Selected_Value للتاكد من وجود القيمة التي اختارها المواطن ضمن شروط حقل
        let Result = Values.find((Finding) => event === Finding.Selected_Value);

        if(Result){
            //! لاظهار الحقول الخاصة بالشرط الذي تحقق
            Result.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");

            //! لاخفاء الحقول غير التابعة للشرط الذي تحقق
            Result.Hidden_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else{
            //! لاخفاء جميع الحقول عند عدم تحقق اي شرط
            Values.forEach((Moving) => {
                Moving.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            })
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist لاخفاء عدة حقول وكل مجموعة حقول تظهر على اساس شرط معين وعلى اساس
    Twelveth_Case(event){
        //! الخاصة بالحقول التابعة للشرط الاول IDتمثل قيم الـ First_IDs
        //! الخاصة بالحقول التابعة للشرط الثاني IDتمثل قيم الـ Second_IDs
        let First_IDs = [
            "12345", //الحقل الاول ID
            "67890", //الحقل الثاني ID
            "14789", //الحقل الثالث ID
        ],
        Second_IDs = [
            "36987", //الحقل الاول ID
            "78965", //الحقل الثاني ID
            "98741", //الحقل الثالث ID
        ];

        //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
        //! Selected_Value قيمة الشرط
        //! Showed_Fields الحقول التي ستظهر عند تحقق الشرط ID قيم
        //! Hidden_Fields الحقول التي ستختفي عند تحقق الشرط ID قيم
        //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
        let Values = [
            {
                Selected_Value: "قيمة الشرط الاول",
                Showed_Fields: First_IDs,
                Hidden_Fields: Second_IDs,
            },
            {
                Selected_Value: "قيمة الشرط الثاني",
                Showed_Fields: Second_IDs,
                Hidden_Fields: First_IDs,
            },
        ];

        //* الاسماء البرمجية للحقول
        var Progs = [
            //* حقول اول شرط
            "FirstField", //* الاسم البرمجي للحقل الاول
            "SecondField", //* الاسم البرمجي للحقل الثاني
            "ThirdField", //* الاسم البرمجي للحقل الثالث
            //حقول ثاني شرط
            "FourthField", //* الاسم البرمجي للحقل الاول
            "FifthField", //* الاسم البرمجي للحقل الثاني
            "SixthField", //* الاسم البرمجي للحقل الثالث
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* الموجود في المصفوفة اعلاه Selected_Value للتاكد من وجود القيمة التي اختارها المواطن ضمن شروط حقل
        let Result = Values.find((Finding) => event.includes(Finding.Selected_Value));

        if(Result){
            //! اظهار الحقول الخاصة بالشرط المتحقق مع القيمة التي اختارها المواطن
            Result.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");

            //! اخفاء الحقول التي لا علاقه لها مع قيمة الشرط الذي تحقق
            Result.Hidden_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else{
            //! لاخفاء جميع الحقول في حال عدم تحقق اي شرط
            Values.forEach((Looping) => {
                Looping.Showed_Fields.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            })
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! لاخفاء مجموعتين وكل مجموعة تظهر على اساس شرط معين
    //* Second_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Thirteenth_Case(event){
        //* الاسماء البرمجية لحقول كل مجموعة
        var Progs = [
            //* حقول المجموعة الاولى
            "FirstField", //* الاسم البرمجي للحقل الاول
            "SecondField", //* الاسم البرمجي للحقل الثاني
            "ThirdField", //* الاسم البرمجي للحقل الثالث
            //* حقول المجموعة الثانية
            "FourthField", //* الاسم البرمجي للحقل الاول
            "FifthField", //* الاسم البرمجي للحقل الثاني
            "SixthField", //* الاسم البرمجي للحقل الثالث
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);
        
        //* نضع الشرط او الشروط التي ستظهر الحقل او الحقول التابعه لها وتخفي الحقل او الحقول غير التابعه لها if مع كل شرط
        //* لجعل الكود يميز انها مجموعة وليس حقل _group مع اضافة getElementById الخاص بالمجموعة داخل "" في ايعاز IDنضع الـ
        if(event == "قيمة الشرط الاول"){
            //! اظهار الحقل الاول التابع لهذا الشرط
            document.getElementById("12345_group").style.display = "block";

            //! اخفاء الحقل الثاني التابع للشرط الثاني
            document.getElementById("67890_group").style.display = "none";
        }else if(event == "قيمة الشرط الثانية"){
            //! اظهار الحقل الاول التابع لهذا الشرط
            document.getElementById("67890_group").style.display = "block";

            //! اخفاء الحقل الاول التابع للشرط الاول
            document.getElementById("12345_group").style.display = "none";
        }else{
            //! اخفاء كل الحقول في حال عد اختيار اي قيمة متطابقة مع اي شرط
            document.getElementById("12345_group").style.display = "none";
            document.getElementById("67890_group").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! لاخفاء عدة مجاميع وكل مجموعة مجاميع تظهر على اساس شرط معين
    //* Second_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Fourteenth_Case(event){
        //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
        //! Selected_Value قيمة الشرط
        //! Showed_Fields الحقول التي ستظهر عند تحقق الشرط ID قيم
        //! Hidden_Fields الحقول التي ستختفي عند تحقق الشرط ID قيم
        //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
        let Values = [
            {
                Selected_Value: "قيمة الشرط الاول",
                Showed_Groups: [
                    "12345_group", //المجموعة الاولى ID
                    "67890_group", //المجموعة الثانية ID
                ],
                Hidden_Groups: [
                    "14789_group", //المجموعة الاولى ID
                    "36987_group", //المجموعة الثانية ID
                ],
            },
            {
                Selected_Value: "قيمة الشرط الثانية",
                Showed_Groups: [
                    "14789_group", //المجموعة الاولى ID
                    "36987_group", //المجموعة الثانية ID
                ],
                Hidden_Groups: [
                    "12345_group", //المجموعة الاولى ID
                    "67890_group", //المجموعة الثانية ID
                ],
            },
        ];
        
        //* الاسماء البرمجية لحقول كل المجاميع
        var Progs = [
            //مجاميع اول شرط
            //المجموعة الاولى
            "FirstName", //الاسم البرمجي للحقل الاول
            "SecondName", //الاسم البرمجي للحقل الثاني
            //المجموعة الثانية
            "ThirdName", //الاسم البرمجي للحقل الاول
            "FourthName", //الاسم البرمجي للحقل الثاني
            //مجاميع ثاني شرط
            //المجموعة الاولى
            "FifthName", //الاسم االبرمجي للحقل الاول
            "SixthName", //الاسم البرمجي للحقل الثاني
            //المجموعة الثانية
            "SeventhName", //الاسم البرمجي للحقل الاول
            "EightName", //الاسم البرمجي للحقل الثاني
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* الموجود في المصفوفة اعلاه Selected_Value للتاكد من وجود القيمة التي اختارها المواطن ضمن شروط حقل
        let Result = Values.find((Finding) => event === Finding.Selected_Value);

        if(Result){
            //! اظهار المجاميع الخاصة بالشرط المتحقق مع القيمة التي اختارها المواطن
            Result.Showed_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");

            //! اخفاء المجاميع التي لا علاقه لها مع قيمة الشرط الذي تحقق
            Result.Hidden_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else{
            //! لاخفاء جميع المجاميع في حال عدم تحقق اي شرط
            Values.forEach((Looping) => {
                Looping.Showed_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            });
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! checklist لاخفاء مجموعتين وكل مجموعة تظهر على اساس شرط معين وعلى اساس
    //* Second_Case في الحالة رقم Form_Intail.js توجد تكملة للكود بالملف المسمى
    Fifteenth_Case(event){
        //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
        //! Selected_Value قيمة الشرط
        //! Showed_Fields الحقول التي ستظهر عند تحقق الشرط ID قيم
        //! Hidden_Fields الحقول التي ستختفي عند تحقق الشرط ID قيم
        //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
        let Values = [
            {
                Selected_Value: "قيمة الشرط الاول",
                Showed_Groups: [
                    "12345_group", //المجموعة الاولى ID
                    "67890_group", //المجموعة الثانية ID
                ],
                Hidden_Groups: [
                    "14789_group", //المجموعة الاولى ID
                    "36987_group", //المجموعة الثانية ID
                ],
            },
            {
                Selected_Value: "قيمة الشرط الثانية",
                Showed_Groups: [
                    "14789_group", //المجموعة الاولى ID
                    "36987_group", //المجموعة الثانية ID
                ],
                Hidden_Groups: [
                    "12345_group", //المجموعة الاولى ID
                    "67890_group", //المجموعة الثانية ID
                ],
            },
        ];

        //* الاسماء البرمجية لحقول كل المجاميع
        var Progs = [
            //مجاميع اول شرط
            //المجموعة الاولى
            "FirstName", //الاسم البرمجي للحقل الاول
            "SecondName", //الاسم البرمجي للحقل الثاني
            //المجموعة الثانية
            "ThirdName", //الاسم البرمجي للحقل الاول
            "FourthName", //الاسم البرمجي للحقل الثاني
            //مجاميع ثاني شرط
            //المجموعة الاولى
            "FifthName", //الاسم االبرمجي للحقل الاول
            "SixthName", //الاسم البرمجي للحقل الثاني
            //المجموعة الثانية
            "SeventhName", //الاسم البرمجي للحقل الاول
            "EightName", //الاسم البرمجي للحقل الثاني
        ];

        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        //* للتاكد من تطابق القيمة مع احد الشروط Selected_Valueلمقارنة القيمة التي يختارها المواطن مع قيم الـ
        let Result = Values.find((Finding) => event.includes(Finding.Selected_Value));
        
        if(Result){
            //! اظهار المجاميع الخاصة بالشرط المتحقق مع القيمة التي اختارها المواطن
            Result.Showed_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");

            //! اخفاء المجاميع التي لا علاقه لها مع قيمة الشرط الذي تحقق
            Result.Hidden_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }else{
            //! لاخفاء جميع المجاميع في حال عدم تحقق اي شرط
            Values.forEach((Looping) => {
                Looping.Showed_Groups.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
            });
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    /*
        * اذا كان اظهار حقل معين يعتمد على اكثر من قيمة واحد وليس فقط قيمة واحدة كما في الحالات السابقة
        * يمكن استعمال الرمز (||) والذي يرمز الى (أو) والذي معناه
        *  اذا تحقق او تساوى اختيار المواطن مع اي شرط من هذه الشروط فقم باظهار الحقل او المجموعة
        * واذا لم يتحقق اي شرط من الشروط فقم باخفاء الحقل او المجموعة
        *  على سبيل المثال:
        * اظهار حقل عدد الاطفال عند اختيار متزوج/ة او ارمل/ة او مطلق/ة
    */
    Sixteenth_Case(event){
        //* لتفريغ محتوى الحقل
        this.inputFormField["FieldProg"] = null; //* inputFormField نضع الاسم البرمجي للحقل داخل "" في ايعاز

        //* ويمكن تطبيق نفس مبدا هذا الشرط على الحالات السابقة
        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        if(event == "الشرط الاول" || event == "الشرط الثاني" || event == "الشرط الثالث"){
            //! لاظهار الحقل عند تحقق احد الشروط
            document.getElementById("12345").style.display = "block";
        }else{
            //! لاخفاء الحقل عند عدم تحقق اي من الشروط
            document.getElementById("12345").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    /*
        * || بدلا من كتابة الرمز ORتوجد طريقة اخرى لكتابة الشرط الخاص بـ
        * includes() وذلك باستخدام الايعاز
        * ولكن قيم الشروط يجب كتابتها داخل مصفوفة
        * وعمل هذا الايعاز هو التاكد من وجود اختيار المواطن داخل هذه المصفوفة الخاصة بالشروط
        * يمكن رؤية الحالة التالية لايضاح عمل الايعاز
    */
    Seventeenth_Case(event){
        var Selected_Value = ["الشرط الاول", "الشرط الثاني", "الشرط الثالث"]; //* قيم الشروط التي عند تحقق احداها يظهر الحقل

        //* لتفريغ محتوى الحقل
        this.inputFormField["FieldProg"] = null; //* inputFormField نضع الاسم البرمجي للحقل داخل "" في ايعاز

        //getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        if(Selected_Value.includes(event)){
            //! لاظهار الحقل عند تحقق احد الشروط
            document.getElementById("12345").style.display = "block";
        }else{
            //! لاخفاء الحقل عند عدم تحقق اي من الشروط
            document.getElementById("12345").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    /*
       * اذا كان اخفاء واظهار حقل يعتمد على اختيارات المواطن من حقلين او اكثر
       * يمكن استعمال الرمز (&) والذي يرمز الى (و) والذي معناه
       * اذا تحققت او تساوت خيارات المواطن مع جميع الشروط فقم باظهار الحقل او المجموعه
       * واذا لم تتحقق جميع الشروط فقم باخفاء الحقل او المجموعة
       * على سبيل المثال:
       * اظهار حقل وقت الحجز عند اختيار المحافظة والتاريخ
       * التي تاتي من الدالةevent يتم الوصول الى قيم الحقل الاول من خلال
       * this.inputFormField.ProgName ويتم الوصول الى قيم الحقل الثاني من خلال استعمال الايعاز
       * الذي بعد النقطة يمثل الاسم البرمجي للحقل الثاني ProgName
    */
    Eighteenth_Case(event){
        //* لتفريغ محتوى الحقل
        this.inputFormField["PorgName"] = null; //* inputFormField نضع الاسم البرمجي للحقل داخل "" في ايعاز

        //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
        if(event == "الشرط الاول" && this.inputFormField.ProgName == "الشرط الثاني"){
            //! لاظهار الحقل عند تحقق الشرطين
            document.getElementById("12345").style.display = "block";
        }else{
            //! لاخفاء الحقل عند عدم تحقق الشرطين او احد الشروط
            document.getElementById("12345").style.display = "none";
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //وتغيير خصائصه Label اخفاء واظهار عدة حقول واحد الحقول
    Nintheenth_Case(event){
        //* حقول اول شرط ID ارقام
        var First_IDs = [
            "12345", //* الحقل الاول ID
            "67890", //* الحقل الثاني ID
            "14789", //* الحقل الثالث ID
        ],
        //* الاسماء البرمجية للحقول
        Progs = [
            "FirstField", //* الاسم البرمجي للحقل الاول
            "SecondField", //* الاسم البرمجي للحقل الثاني
            "ThirdField", //* الاسم البرمجي للحقل الثالث
        ];

        //! لكونه حقل لا يُمكن الكتابه بداخله فلا يحتاج لتفريغ النص الذي بداخله Labelلا يحتاج اضافة الاسم البرمجي لحقل الـ
        //* لافراغ محتوى حقول المجموعة
        Progs.forEach((Clearing) => this.inputFormField[Clearing] = null);

        if(event == "الشرط الاول"){
            //! لاظهار الحقول عند تحقق الشرط
            Fields_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "block");

            //* Labelهذا الايعاز يقوم بتغيير خصائص حقل الـ
            /*
                * getElementByIdالخاص بالحقل داخل الـ IDنضع الـ
                * تقوم بتغيير لون النص الخاص بالحقل color
                * تقوم بتغيير حجم النص الخاص بالحقل font-size
                * bold تجعل النص اغمق اذا كانت القيمة font-weight
                * تغير لون الخلفيه الخاص بالحقل background-color
                * تقوم بوضع او زيادة المسافة بين الحقل والحقل او الفراغ الذي في اعلاه padding-top
                * تقوم بوضع او زيادة المسافة بين الحقل والحقل او الفراغ الذي في اسفله padding-bottom
                * تقوم بتحديد موضع النص من الشاشة وتوجد لها ثلاثة قيم وهم كالاتي text-align
                * وتضع النص في منتصف الشاشة center
                * تضع النص في يمين الشاشة right
                * تضع النص في يسار الشاشة left
                ! ويحتاج ان يتم التعديل على خصائصه label ويمكن استخدام هذا الايعاز مع اي حاله من الحالات السابقة التي تحتوي على
            */
            document.getElementById("12345").style.cssText =
                "color: #000000; font-size: 25px; font-weight: bold; background-color: #b2def6ff; padding-top: 10px; padding-bottom: 10px; text-align: center;";
        }else{
            //! لاخفاء الحقول عند عدم تحقق الشرط
            Fields_IDs.forEach((Hiding) => document.getElementById(Hiding).style.display = "none");
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    /*
        * القائمة المنسدلة يمكن فلترة قيمها على اساس اختيار المواطن لتظهر فقط القيم التي تكون خاصة باختيار المواطن
        * وعلى سبيل فلترة قيم الاقضية على اساس اختيار المواطن للمحافظة
    */
    Twentyth_Case(event){
        //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
        //! قيمة الشرط Selected_Value
        //! خاص بالقيم التي سوف تظهر بداخل القائمة المنسدلة عند تحقق الشرط Showed_Value
        //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
        let Values = [
            { Selected_Value: "الشرط الاول", Showed_Value: ["القيمة الاولى", "القيمة الثانية", "القيمة الثالثة"] },
            { Selected_Value: "الشرط الثاني", Showed_Value: ["القيمة الرابعة", "القيمة الخامسة", "القيمة السادسة"] },
            { Selected_Value: "الشرط الثالث", Showed_Value: ["القيمة السابعه", "القيمة الثامنة", "القيمة التاسعة"] },
        ];

        /*
            * document.getElementById("12345").style.display = "block"; ايعاز
            * يمكن ابقائه في حالة كان حقل القائمة المنسدلة الذي ستظهر القيم بداخله مخفي فيمكن اظهاره ومن ثم فلترة قيمة من خلال الايعاز الثاني
            * ولكن اذا كان حقل القائمة المنسدلة ظاهر في جميع الاحوال فيمكن حذف هذا الايعاز
            * this.group_of_form[0].fields[9].properties[0].values = Values[0]; اما ايعاز
            * فانه يقوم بفلترة القيم على اساس اختيار المواطن  والذي نحتاج بتتغيره في هذا الايعاز هو قيمتين فقط
            * group_of_form القيمة الاولى هي قيمة
            * والتي تمثل تسلسل المجموعة التي تحتوي على حقل القائمة المنسدلة التي تمت فلترة قيمها
            * group_of_form ونطرح 1 من تسلسل المجموعة قبل اضافته الى
            * fields والقيمة الثانية هي
            * والتي تمثل تسلسل حقل القائمة المنسدلة داخل مجموعته
            * fields ونطرح 1 من تسلسل الحقل قبل اضافته الى
            ! في التسلسلين نحتاج ان نطرح ما قميته 1 من التسلسل الذي يتم اخذه
            * مثلا اذا كان تسلسل المجموعة هو 3 فنكتب الرقم 2 داخل الايعاز ونفس الشيء مع تسلسل الحقل
        */

       //* للتاكد من وجود القيمة من ضمن الشروط في المصفوفة وارجاع قيمه عند وجوده
       let Result = Values.find((Finding) => event == Finding.Selected_Value);

       //* نستعمل السطر البرمجي الخاص باخفاء واظهار القائمة المنسدلة اذا في حال كان الحقل مخفي
       //* لكن اذا كان الحقل ظاهر في كل الاحوال فيمكن حذف هذا السطر الخاص باخفاء واظهار القائمة المنسدلة
       //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
       if(Result){
            document.getElementById("12345").style.display = "block";
            this.group_of_form[0].fields[9].properties[0].values = Result.Showed_Value;
       }else{
            document.getElementById("12345").style.display = "none";
            //* عند عدم وجود القيمة المختارة من ضمن خيارات المصفوفة يتم تفريغ القائمة المنسدلة من اي قيم
            this.group_of_form[0].fields[9].properties[0].values = [];
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! فلترة اقضية العراق
    Twenty_First_Case(event){
        //* تفريغ حقل الاقضية
        this.inputFormField["district"] = null; //* inputFormField نضع الاسم البرمجي لحقل الاقضية داخل "" في ايعاز
        //! لا يحتاج اي تغيير للمصفوفة الا في حالة تغير بعض الاقضية او اضافة قيم جديدة او حذف بعضهم
        //! منهم يمثل محافظة من المحافظات التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
        //! قيمة الشرط Selected_Value
        //! خاص بالقيم التي سوف تظهر بداخل القائمة المنسدلة عند تحقق الشرط Showed_Value
        let Values = [
            {
                Selected_Value: "الانبار",
                Showed_Value: [
                    "بروانة", "البغدادي", "الحبانية", "الحقلانية", "حديثة", "راوة", "الرطبة", "الرمادي", "الصقلاوية", "العامرية", "عنه", "الرمانة", "العبيدي", "الفرات", "الفلوجة",
                    "القائم", "كبيسة", "الكرمة", "النخيب", "هيت", "الوفاء", "الوليد",
                ]
            },
            {
                Selected_Value: "بابل",
                Showed_Value: [
                    "أبي غرق", "الهاشمية", "الحلة", "الامام", "الاسكندرية", "الكفل", "المدحتية", "المحاويل", "المشروع", "المسيب", "القاسم", "النيل", "الشوملي", "الطليعة",
                    "جرف النصر (جرف الصخر)", "سدة الهندية",
                ]
            },
            {
                Selected_Value: "بغداد",
                Showed_Value: [
                    "ابي غريب", "العبايجي", "الفحامة", "الفرات", "الكرخ", "الكاظمية", "اللطيفية", "المحمودية", "المأمون", "المنصور", "المشاهدة", "اليوسفية", "النصر والسلام",
                    "الرشيد", "الطارمية",//الكرخ
                    "ابناء الرافدين", "الاعظمية", "الجسر", "الكرادة الشرقية", "المدائن", "المنورة", "الوحدة", "الراشدية", "الرصافة", "الصديق الاكبر", "التاجي", "الزهور", "فلسطين",
                    "الصدر الاولى", "الصدر الثانية", "بغداد الجديدة", "ذات السلاسل", //الرصافة
                ]
            },
            {
                Selected_Value: "البصرة",
                Showed_Value: [
                    "أبي الخصيب", "الدير", "البصرة", "الفاو", "الهارثة", "المدينة", "القرنة", "النشوة", "السيبة", "الثغر", "الشهيد عز الدين سليم", "الزبير", "سفوان", "شط العرب",
                    "طلحة", "أم قصر", "الامام الصادق",
                ]
            },
            {
                Selected_Value: "ديالى",
                Showed_Value: [
                    "أبي صيدا", "العبارة", "الخالص", "المنصورية", "المقدادية", "الوجيهية", "السد العظيم", "السعدية", "السلام", "بلدروز", "بني سعد", "بعقوبة", "بهرز", "هبهب",
                    "جبارة", "جلولاء", "كنعان", "خانقين", "مندلي", "قرة تبة", "سيف سعد",
                ]
            },
            {
                Selected_Value: "ذي قار",
                Showed_Value: [
                    "الدواية", "البطحاء", "الفضيلة", "الفجر", "الفهود", "الغراف", "الحمار (المنار)", "الاصلاح", "الجبايش", "الناصرية", "النصر", "الرفاعي", "الشطرة", "الطار", "أور",
                    "كرمة بني سعد", "قلعة سكر", "سيد دخيل", "سوق الشيوخ", "عكيكة",
                ]
            },
            {
                Selected_Value: "صلاح الدين",
                Showed_Value: [
                    "الدور", "الدجيل", "الضلوعية", "العلم", "الإسحاقي", "المعتصم", "امرلي", "الشرقاط", "الصينية", "بيجي", "بلد", "دجلة", "سامراء", "سليمان بيك", "تكريت", "العوجة",
                    "طوز خورماتو", "يثرب",
                ]
            },
            {
                Selected_Value: "القادسية",
                Showed_Value: [
                    "الدغارة", "الديوانية", "عفك", "البدير", "الحمزة", "المهناوية", "الشافعية", "الشامية", "الشنافية", "الصلاحية", "السنية", "السدير", "غماس", "نفر", "سومر",
                ]
            },
            {
                Selected_Value: "كركوك",
                Showed_Value: [
                    "دبس", "العباسي", "الحويجة", "الملتقى", "التون كبري", "الرشاد", "الرياض", "الزاب", "داقوق","كركوك", "ليلان", "قرة هنجير", "سركوان (القدس)", "شوان", "تازة",
                    "يايجي",
                ]
            },
            {
                Selected_Value: "كربلاء المقدسة",
                Showed_Value: ["عين تمر", "الهندية", "الحر", "الحسينية", "الجدول الغربي", "ناحية الخيرات", "كربلاء",]
            },
            {
                Selected_Value: "المثنى",
                Showed_Value: ["الدراجي", "البصية", "الهلال", "الكرامة", "الخضر", "المجد", "الوركاء", "النجمي", "الرميثة", "السلمان", "السماوة", "السوير",]
            },
            {
                Selected_Value: "ميسان",
                Showed_Value: [
                    "العدل", "العمارة", "علي الغربي", "علي الشرقي", "الكحلاء", "الخير", "الميمونة", "المجر الكبير", "المشرح", "العزيز", "سيد أحمد الرفاعي", "السلام", "بني هاشم",
                    "كميت", "قلعة صالح",
                ]
            },
            {
                Selected_Value: "النجف الاشرف",
                Showed_Value: ["العباسية", "الحيدرية", "الحيرة", "الحرية", "الكوفة", "المناذرة", "المشخاب", "القادسية", "النجف", "الشبكة",]
            },
            {
                Selected_Value: "نينوى",
                Showed_Value: [
                    "العياضية", "البعاج", "الحضر", "الكوير", "الموصل", "المحلبية", "القحطانية", "القيروان", "القيارة", "القوش", "الشمال", "شبخان", "الشورة", "تل عبطة",
                    "الحمدانية (بغديدا)", "برطلة", "بعشيقة", "فايدة", "حمام العليل", "كنديناوة", "مخمور", "ملاقرة", "نمرود", "قراج", "ربيعة", "سنجار", "تلعفر", "تلكيف", "وانة",
                    "زيلكان", "زمار", "الفاروق",
                ]
            },
            {
                Selected_Value: "واسط",
                Showed_Value: [
                    "الخلفاء (دبوني)", "الذهب (زرباطية)", "الاحرار", "العزيزية", "البشائر", "الحي", "الكوت", "الموفقية", "النعمانية", "الشحمية", "الصويرة", "الزبيدية", "بدرة",
                    "جصان", "شيخ سعد", "الحفرية (تاج الدين)", "ناحية واسط",
                ]
            },
        ];

        /*
            * document.getElementById("12345").style.display = "block"; ايعاز
            * يمكن ابقائه في حالة كان حقل الاقضية مخفي فيمكن اظهاره ومن ثم فلترة قيمة من خلال الايعاز الثاني
            * ولكن اذا كان حقل الاقضية ظاهر في جميع الاحوال فيمكن حذف هذا الايعاز
            * 
            ! حتى القيم تتسكن بالحقل الصحيح
            * المقصود بيه رقم المجموعه الي بيه القائمة المنسدله الي راح تتسكن بيها القيم بس ننقص من الرقم 1 group_of_form
            * المقصود بيه تسلسل الحقل داخل المجموعه مالته بس ننقص من الرقم 1 Fields
           
            * في التسلسلين نحتاج ان نطرح ما قميته 1 من التسلسل الذي يتم اخذه
            * مثلا اذا كان تسلسل المجموعة هو 3 فنكتب الرقم 2 داخل الايعاز  ونفس الشيء مع تسلسل الحقل
        */

        //* للتاكد من وجود القيمة من ضمن الشروط في المصفوفة وارجاع قيمه عند وجوده
        let Result = Values.find((Finding) => event == Finding.Selected_Value);

        //! نستعمل السطر البرمجي الخاص باخفاء القائمة المنسدلة اذا في حال كان الحقل مخفي
        //! لكن اذا كان الحقل ظاهر في كل الاحوال فيمكن حذف هذا السطر الخاص باخفاء واظهار القائمة المنسدلة
        //* getElementById الخاص بحقل القضاء داخل "" في ايعاز IDنضع الـ
        if(Result){
            document.getElementById("35051").style.display = "block";
            this.group_of_form[0].fields[3].properties[0].values = Result.Showed_Value;
        }else{
            document.getElementById("35051").style.display = "none";
            //! عند عدم وجود القيمة المختارة من ضمن خيارات المصفوفة يتم تفريغ القائمة المنسدلة من اي قيم
            this.group_of_form[0].fields[3].properties[0].values = [];
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! هذه الحالة لعمل واجهة تسجيل دخول تعتمد على حقل واحد وعلى سبيل المثال رقم الهاتف
    /*
        ! الكود يتكون من ثلاثة دوال
        ! هي التي يتم التعديل عليها وحسب المطلوب Twenty_Second_Case الدالتين الاولى ثابته واما الثالثة والمسمى
        ! في هذه الحالة تسجيل الدخول يعتمد على حقل رقم الهاتف
        ! Form_Intail.js في ملف Second_Case وتوجد تكملة للكود في الحالة رقم
        ! الخاصة بالزر المضاف في مجموعة تسجيل الدخول dependcyفي الـ Twenty_Second_Case نضع اسم الدالة والتي هي
    */
    //! الدالة خاصة بفشل علمية تسجيل الدخول
    singleNotification(notifyText, position) {
        this.$toast.error(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    //! الدالة خاصة بنجاح عملية تسجيل الدخول
    ssingleNotification(notifyText, position) {
        this.$toast.success(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    //! الدالة الرئيسية التي يتم التاكد من خلالها من صحة المعلومات المدخلة ام لا
    Twenty_Second_Case(event){
        if (event) {
            let loader = this.$loading.show({
                container: this.$refs.formContainer,
                loader: "dots",
                transition: "fade",
                color: "#c30734"
            });

            var Checking_Values = [
                "9647812345678", //* رقم هاتف الموظف الاول
                "9647812345678", //* رقم هاتف الموظف الثاني
                "9647812345678", //* رقم هاتف الموظف الثالث
                "9647812345678", //* رقم هاتف الموظف الرابع
                "9647812345678", //* رقم هاتف الموظف الخامس
            ];

            //* inputFormField نضع الاسم البرمجي لحقل رقم الهاتف داخل "" في ايعاز
            if(Checking_Values.includes(this.inputFormField["FieldProg"])){
                //! عندما يتم تسجيل الدخول بنجاح، يتم اخفاء المجموعة الخاصة بتسجيل الدخول واظهار باقي المجاميع   
                document.getElementById("33820_group").style.display = "none";
                document.getElementById("33764_group").style.display = "block";
                document.getElementById("12345_group").style.display = "block";

                loader.hide();
                //* يمكن تغيير الجملة الخاصة بنجاح التسجيل من هنا
                this.ssingleNotification("تم الدخول بنجاح", "top-right");
            }else{
                loader.hide();
                //* يمكن تغيير رسالة فشل تسجيل الدخول من هنا
                this.singleNotification("رقم الهاتف غير مطابق مع المخول ", "top-right");
            }
        }
    },

    //-----------------------------------------------------------------------------------------------------------------------------
    //! هذه الحالة لعمل واجهة تسجيل دخول تعتمد على حقلين وعلى سبيل المثال يوزر وباسوورد
    /*
        ! الكود يتكون من ثلاثة دوال
        ! هي التي يتم التعديل عليها وحسب المطلوب Twenty_Third_Case الدالتين الاولى ثابته واما الثالثة والمسمى
        ! في هذه الحالة تسجيل الدخول يعتمد على حقلين وعلى سبيل المثال يوزر وباسوورد
        ! Form_Intail.js في ملف Second_Case وتوجد تكملة للكود في الحالة رقم
        ! الخاصة بالزر المضاف في مجموعة تسجيل الدخول dependcyفي الـ Twenty_Third_Case نضع اسم الدالة والتي هي
    */
    //! الدالة خاصة بفشل علمية تسجيل الدخول
    singleNotification(notifyText, position) {
        this.$toast.error(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    //! الدالة خاصة بنجاح عملية تسجيل الدخول
    ssingleNotification(notifyText, position) {
        this.$toast.success(notifyText, {
            position: position,
            timeout: 6000,
            closeOnClick: false,
            pauseOnFocusLoss: true,
            pauseOnHover: true,
            draggable: true,
            draggablePercent: 0.6,
            showCloseButtonOnHover: false,
            hideProgressBar: false,
            closeButton: "button",
            icon: true,
            rtl: true
        });
    },

    //! الدالة الرئيسية التي يتم التاكد من خلالها من صحة المعلومات المدخلة ام لا
    Twenty_Third_Case(event){
        if (event) {
            let loader = this.$loading.show({
                container: this.$refs.formContainer,
                loader: "dots",
                transition: "fade",
                color: "#c30734"
            });

            //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة او حذف يوزر مستخدم
            //! منهم يمثل يوزر من اليوزرات التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
            //! القيمة الخاصة باسم اليوزر الخاص بالمستخدم UserName
            //! خاص بكملة مرور اليوزر الخاص بالمستخدم Password
            let Values = [
                { UserName: "Username1", Password: "Password1", }, //* اليوزر الاول
                { UserName: "Username2", Password: "Password2", }, //* اليوزر الثاني
                { UserName: "Username3", Password: "Password3", }, //* اليوزر الثالث
                { UserName: "Username4", Password: "Password4", }, //* اليوزر الرابع
            ];

            
            let First_Condition = this.inputFormField["FirstFieldsProg"]; //* inputFormField نضع الاسم البرمجي لحقل اليوزر داخل "" في ايعاز
            let Second_Condition = this.inputFormField["SecondFieldProg"]; //* inputFormField نضع الاسم البرمجي لحقل كملة المرور داخل "" في ايعاز

            //* Values للتاكد من وجود اليوزر والباسوورد ضمن مصفوفة
            let Result = Values.find((Finding) => First_Condition === Finding.UserName && Second_Condition === Finding.Password);

            if(Result){
                //* عند نجاح تسجيل الدخول يتم اخفاء مجموعة تسجيل الدخول واظهار باقي المجاميع
                document.getElementById("33820_group").style.display = "none";
                document.getElementById("33764_group").style.display = "block";
                document.getElementById("12345_group").style.display = "block";

                loader.hide();
                //! يمكن من هنا تغيير رسالة نجاح تسجيل الدخول
                this.ssingleNotification("تم الدخول بنجاح", "top-right");
            }else{
                loader.hide();
                //! يمكن تغيير رسالة فشل تسجيل الدخول من هنا
                this.singleNotification("رقم الهاتف غير مطابق مع المخول ", "top-right");
            }
        }
    },
}