{
  /*
    * هذا الملف خاص بالحالات التي تجعل الحقل يكون مطلوب عند ظهوره وغير مطلوب عند اختفائه في الاستمارة وللتحقق من ان رقم الهاتف يبدا بالـ07
    * formfeapplyService هو sinppet code type لاضافة الكود البرمجي بعد اكماله يجب ان يكون نوع ملف الشفرة البرمجية
    * before هو Run Time ووقت عمل الملف
    ! {} لكتابة الكود البرمجي يحتاج ان يتم كتابته بين اقواس من نوع

    ! الموجودة في اعدادات الحقل اذا في حال كان الحقل مخفي وكان مطلوب سيجعل الخدمة تتوقف Required وسبب عدم استعمال خاصية
    ! ويظهر للمواطن ان هناك حقل غير مملؤة وعند البحث عنه لن يجده لكونه مخفي
    ! ولهذا من خلال الكود البرمجي في هذا الملف سوف يجعل الحقل المخفي مطلوب فقط عند ظهوره

    * :ولجعل الحقل مطلوب نحتاج الى شرطين (شرط خارجي وشرط داخلي)
    * 1- الشرط الاول يتاكد من كون المواطن قد اختار القيمة التي تجعل الحقل يظهر وهذا الشرط الخارجي
    * 2- والشرط الثاني يتاكد اذا الحقل قد تم تركه فارغا من قبل المواطن وهذا الشرط الداخلي

    * وعند تحقق الشرطين هذا يعني ان الحقل ظاهر والمواطن قد تركه فارغا وعندها لن يمكنه من الاستمرار والانتقال الى الملفات الا بعد ملئ الحقل بالبيانات المطلوبة
    * عند عدم تحقق الشرط الخارجي هذا يعني ان المواطن لم يختر القيمة التي تجعل الحقل يظهر وعندها لن نحتاج لجعل الحقل مطلوب
    * ولكن اذا تحقق الشرط الخارجي ولكن لم يتحقق الشرط الداخلي هذا يعني ان المواطن اختار القيمة التي تجعل الخقل يظهر
    * وقد ملئ الحقل بالبيانات وعندها لن نحتاج لجعل الحقل مطلوب

    * عند اخفاء واظهار مجموعة، لا يمكن جعل المجموعة مطلوبة ولهذا يجب ان نجعل الحقول الموجودة داخلها مطلوبة عندما تظهر المجموعة
  */

  //--------------------------------------------------------------------------------------------------------//
  //!-------------------------------------------First_Case--------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! هذه الحالة للتاكد من حقل واحد
  //* في الشرط الخارجي نحتاج الاسم البرمجي للحقل الذي يحتوي على القيمة التي تجعل الحقل يظهر
  //* للحقل inputFormField ونضع الاسم البرمجي بعد النقطة التي بعد ايعاز
  if (this.inputFormField.ProgName == "القيمة التي تجعل الحقل يظهر") {
    //* في الشرط الداخلي نحتاج الاسم البرمجي للحقل الذي يختفي ويظهر
    //* inputFormField وكما في الشرط الخارجي نضع الاسم البرمجي داخل الاقواس المربعه التي مع ايعاز
    //* وهنا نتاكد اذا الحقل كان فارغا ام لا
    if (
      this.inputFormField["ProgName"] == null ||
      this.inputFormField["ProgName"] == ""
    ) {
      //! المقصود به هو تسلسل المجموعة التي تحتوي على الحقل بعد طرح 1 منه group_of_form
      //! المقصود به تسلسل الحقل داخل مجموعته بعد طرح 1 منه fields
      this.evalErr.push(`الحقل ${this.group_of_form[1].fields[1].label} مطلوب`);
    }
  }

  //--------------------------------------------------------------------------------------------------------//
  //!------------------------------------------Second_Case--------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! هذه الحالة للتاكد من عدة حقول
  //* في الشرط الخارجي نحتاج الاسم البرمجي للحقل الذي يحتوي على القيمة التي تجعل الحقل يظهر
  //* inputFormField ونضع الاسم البرمجي بعد النقطة التي بعد ايعاز

  //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
  //! خاص بالاسم البرمجي للحقل الذي سوف يتم التاكد هل المواطن قام بملئ الحقل ام لا Field_Prog
  //! خاص بتسلسل الحقل داخل المجموعه الخاصه به ولكن بعد طرح 1 من قيمة التسلسل Field_Location
  //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
  let Values = [
    {
      Field_Prog: "FirstProg", //الاسم البرمجي للحقل الاول
      Field_Location: 1, //تسلسل الحقل الاول
    },
    {
      Field_Prog: "SecondProg", //الاسم البرمجي للحقل الثاني
      Field_Location: 2, //تسلسل الحقل الثاني
    },
    {
      Field_Prog: "ThirdPRog", //الاسم البرمجي للحقل الثالث
      Field_Location: 3, //تسلسل الحقل الثالث
    },
  ];

  //* في الشرط الخارجي نحتاج الاسم البرمجي للحقل الذي يحتوي على القيمة التي تجعل الحقل يظهر
  //* inputFormField ونضع الاسم البرمجي بعد النقطة التي بعد ايعاز
  if (this.inputFormField.ProgName == "القيمة التي تجعل الحقل يظهر") {
    Values.forEach((Checking) => {
      //* وهنا نتاكد اذا الحقول التي تختفي وتظهر فارغة ام لا
      if (
        this.inputFormField[Checking.Field_Prog] == null ||
        this.inputFormField[Checking.Field_Prog] == ""
      ) {
        //! المقصود به هو تسلسل المجموعة التي تحتوي على الحقل بعد طرح 1 منه group_of_form
        //! المقصود به تسلسل الحقل داخل مجموعته fields
        this.evalErr.push(
          `الحقل ${this.group_of_form[1].fields[Checking.Field_Location].label} مطلوب`,
        );
      }
    });
  }

  //--------------------------------------------------------------------------------------------------------//
  //!-------------------------------------------Third_Case--------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! للتاكد من حقل واحد وعلى اساس عدة شروط
  //* قيم الحقل التي سوف يختار المواطن منه
  var Selected_Values = [
    "قيمة الشرط الاول",
    "قيمة الشرط الثاني",
    "قيمة الشرط الثالث",
    "قيمة الشرط الرابع",
  ];

  //* في الشرط الخارجي نحتاج الاسم البرمجي للحقل الذي يحتوي على القيمة التي تجعل الحقل يظهر
  //* inputFormField ونضع الاسم البرمجي بعد النقطة التي بعد ايعاز
  if (Selected_Values.includes(this.inputFormField.ProgName)) {
    //* في الشرط الداخلي نحتاج الاسم البرمجي للحقل الذي يختفي ويظهر
    //* inputFormField وكما في الشرط الخارجي نضع الاسم البرمجي داخل الاقواس المربعه التي مع ايعاز
    //* وهنا نتاكد اذا الحقل كان فارغا ام لا
    if (
      this.inputFormField["ProgName"] == null ||
      this.inputFormField["ProgName"] == ""
    ) {
      //! المقصود به هو تسلسل المجموعة التي تحتوي على الحقل بعد طرح 1 منه group_of_form
      //! المقصود به تسلسل الحقل داخل مجموعته بعد طرح 1 منه fields
      this.evalErr.push(`الحقل ${this.group_of_form[1].fields[1].label} مطلوب`);
    }
  }

  //--------------------------------------------------------------------------------------------------------//
  //!------------------------------------------Fourth_Case--------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! للتاكد من عدة حقول على اساس عدة شروط
  //* قيم الحقل التي سوف يختار المواطن منه
  var Selected_Values = [
    "قيمة الشرط الاول",
    "قيمة الشرط الثاني",
    "قيمة الشرط الثالث",
    "قيمة الشرط الرابع",
  ];

  //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
  //! خاص بالاسم البرمجي للحقل الذي سوف يتم التاكد هل المواطن قام بملئ الحقل ام لا Field_Prog
  //! خاص بتسلسل الحقل داخل المجموعه الخاصه به ولكن بعد طرح 1 من قيمة التسلسل Field_Location
  //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
  let Values = [
    {
      Field_Prog: "FirstProg", //الاسم البرمجي للحقل الاول
      Field_Location: 1, //تسلسل الحقل الاول
    },
    {
      Field_Prog: "SecondProg", //الاسم البرمجي للحقل الثاني
      Field_Location: 2, //تسلسل الحقل الثاني
    },
    {
      Field_Prog: "ThirdPRog", //الاسم البرمجي للحقل الثالث
      Field_Location: 3, //تسلسل الحقل الثالث
    },
  ];

  //* في الشرط الخارجي نحتاج الاسم البرمجي للحقل الذي يحتوي على القيمة التي تجعل الحقل يظهر
  //* inputFormField ونضع الاسم البرمجي بعد النقطة التي بعد ايعاز
  if (Selected_Values.includes(this.inputFormField.ProgName)) {
    //* في الشرط الداخلي نحتاج الاسم البرمجي للحقل الذي يختفي ويظهر
    //* وهنا نتاكد اذا الحقول كانت فارغة ام لا
    Values.forEach((Checking) => {
      if (
        this.inputFormField[Checking.Field_Prog] == null ||
        this.inputFormField[Checking.Field_Prog] == ""
      ) {
        //! المقصود به هو تسلسل المجموعة التي تحتوي على الحقل بعد طرح 1 منه group_of_form
        //! المقصود به تسلسل الحقل داخل مجموعته بعد طرح 1 منه fields
        this.evalErr.push(
          `الحقل ${this.group_of_form[1].fields[Checking.Field_Location].label} مطلوب`,
        );
      }
    });
  }

  //--------------------------------------------------------------------------------------------------------//
  //!-------------------------------------------Ffith_Case--------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! Checklist للتاكد من حقل على اساس
  //* this.inputFormField بعد النقطة في ايعاز CheckList نضع الاسم البرمجي الخاص بحقل
  //* CheckList خاص بالقيمة او القيم التي سوف يختارها المواطن من حقل Selected_Value
  var Selected_Value = this.inputFormField.nameincom;

  //* للتاكد من ان المواطن قد اختار القيمة المطلوبة
  if (Selected_Value.includes("قيمة الشرط")) {
    //* inputFormField للتاكد من كون الحقل فارغ او لا ونضع الاسم البرمجي للحقل داخل ايعاز
    if (
      this.inputFormField["ProgName"] == null ||
      this.inputFormField["ProgName"] == ""
    ) {
      //! المقصود به هو تسلسل المجموعة التي تحتوي على الحقل بعد طرح 1 منه group_of_form
      //! المقصود به تسلسل الحقل داخل مجموعته بعد طرح 1 منه fields
      this.evalErr.push(
        `الحقل ${this.group_of_form[0].fields[24].label} مطلوب`,
      );
    }
  }

  //--------------------------------------------------------------------------------------------------------//
  //!-------------------------------------------Sixth_Case--------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! CheckList للتاكد من عدة حقول على اساس
  //* this.inputFormField بعد النقطة في ايعاز CheckList نضع الاسم البرمجي الخاص بحقل
  //* CheckList خاص بالقيمة او القيم التي سوف يختارها المواطن من حقل Selected_Value
  var Selected_Value = this.inputFormField.nameincom;

  //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
  //! خاص بالاسم البرمجي للحقل الذي سوف يتم التاكد هل المواطن قام بملئ الحقل ام لا Field_Prog
  //! خاص بتسلسل الحقل داخل المجموعه الخاصه به ولكن بعد طرح 1 من قيمة التسلسل Field_Location
  //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
  let Values = [
    {
      Field_Prog: "FirstProg", //الاسم البرمجي للحقل الاول
      Field_Location: 1, //تسلسل الحقل الاول
    },
    {
      Field_Prog: "SecondProg", //الاسم البرمجي للحقل الثاني
      Field_Location: 2, //تسلسل الحقل الثاني
    },
    {
      Field_Prog: "ThirdPRog", //الاسم البرمجي للحقل الثالث
      Field_Location: 3, //تسلسل الحقل الثالث
    },
  ];

  if (Selected_Value.includes("قيمة الشرط")) {
    Values.forEach((Checking) => {
      //* inputFormField للتاكد من كون الحقل فارغ او لا ونضع الاسم البرمجي للحقل داخل ايعاز
      if (
        this.inputFormField[Checking.Field_Prog] == null ||
        this.inputFormField[Checking.Field_Prog] == ""
      ) {
        //! المقصود به هو تسلسل المجموعة التي تحتوي على الحقل بعد طرح 1 منه group_of_form
        //! المقصود به تسلسل الحقل داخل مجموعته fields
        this.evalErr.push(
          `الحقل ${this.group_of_form[0].fields[Fields_Location[i]].label} مطلوب`,
        );
      }
    });
  }

  //--------------------------------------------------------------------------------------------------------//
  //!-------------------------------------------Seventh_Case------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! للتاكد من عدة حقول في اكثر من مجموعة على اساس شرط واحد
  /*
   ! منهم يمثل مجموعة من مجاميع الاستمارة object وكل Objects تحتوي على Values المصفوفة
   ! يمثل تسلسل المجموعة التي تحتوي على الحقول بعد طرح 1 من قيمة تسلسلها Group_Number
   ! يمثل الاسماء البرمجية للحقول داخل هذه المجموعة Fields_Prog
   ! يمثل تسلسل الحقول داخل مجموعتهم بعد طرح 1 من قيمة تسلسلهم Fields_Location
   ! ويتم تكرار الاسطر التي داخل اقواس {} مع ااقواسها مع كل مجموعة يتم اضافتها للمصفوفة
   */
  let Values = [
    {
      Group_Number: 1,
      Fields_Prog: ["First_Prog", "Second_Prog"],
      Fields_Location: [0, 1],
    }, //قيم المجموعة الاولى
    {
      Group_Number: 2,
      Fields_Prog: ["Third_Prog", "Fourth_Prog"],
      Fields_Location: [0, 1],
    }, //قيم المجموعة الثانية
  ];

  if (this.inputFormField.nameincom == "قيمة الشرط") {
    Values.forEach((Checking) => {
      for (var i = 0; i < Checking.Fields_Prog.length; i++) {
        if (
          this.inputFormField[Checking.Fields_Prog[i]] == null ||
          this.inputFormField[Checking.Fields_Prog[i]] == ""
        ) {
          this.evalErr.push(
            `الحقل ${this.group_of_form[Checking.Group_Number].fields[Checking.Fields_Location[i]].label} مطلوب`,
          );
        }
      }
    });
  }

  //--------------------------------------------------------------------------------------------------------//
  //!--------------------------------------------Eigth_Case-------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------//
  //! للتاكد من بداية رقم الهاتف ب07
  //* inputFormField نضع الاسم البرمجي لحقل رقم الهاتف بعد النقطة الخاصة بايعاز
  if (this.inputFormField.lfhfd) {
    const phoneNo = this.inputFormField.lfhfd;
    let startNo = phoneNo.substring(0, 2);
    if (startNo != "07") {
      this.evalErr.push("يجب أن يبدأ رقم الهاتف بالرقم 07.");
    }
  }
}
