{
  /*
    * هذا الملف خاص بالحقول التي يتم اخفائها واظهارها لكي يتم اخفائها من مرحلة ارسال الطلب في حال عدم ملئ هذه الحقول
    ! يمكن اخفاء:
    * 1- الحقول او المجاميع التي بقت خفيه في الاستمارة
    * 2- الحقول او المجاميع التي اصبحت غير مطلوبة في الخدمة

    ! submitfeapplyService هو "Code snippet type" لاضافة الكود البرمجي بعد اكماله يجب ان يكون نوع ملف الشفرة البرمجية
    ! init هو "Run Time" ووقت العمل
    ! {} لكتابة الكود البرمجي يحتاج ان يتم كتابته بين اقواس من نوع

    * ثابت مع كل الحالات فيمكن كتابة هذا الشرط مع كل اقواسة مره واحدة this.tab_click == "form" الشرط الخاص بايعاز
    * بدلا عن تكراره مع كل حاله واضافة محتوى الشرط الخاص بكل الحالات داخله
  */

  //--------------------------------------------------------------------------------------------------------------------------//
  //!---------------------------------------------------First_Case------------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء حقل واحد
  if (this.tab_click == "form") {
    //form_data الاسم البرمجي الخاص بالحقل نضعه بعد النقطة الخاصه بايعاز
    if (this.form_data.FirstSponsorName == null) {
      //* getElementById الخاص بالحقل داخل "" في ايعاز IDنضع الـ
      document.getElementById("49166").style.visibility = "collapse";
    }
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!---------------------------------------------------Second_Case-----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة حقول
  if (this.tab_click == "form") {
    //! منهم يمثل حقل من الحقول التي سوف نتاكد منهم object وكل objects تحتوي على Values المصفوفة
    //! خاص بالاسم البرمجي للحقل Field_Prog
    //! الخاص بالحقل IDخاص بالـ Field_ID
    //! يتم تكرار الجزء المحصور داخل اقواس {} مع اقواسه مع كل اضافة جديدة لحقل من نوع تاريخ داخل المصفوفة
    let Values = [
      {
        Field_Prog: "FirstField", //الاسم البرمجي للحقل الاول
        Field_ID: "12345", //الحقل الاول ID
      },
      {
        Field_Prog: "SecondField", //الاسم البرمجي للحقل الثاني
        Field_ID: "45678", //الحقل الثاني ID
      },
      {
        Field_Prog: "ThirdField", //الاسم البرمجي للحقل الثالث
        Field_ID: "78912", //الحقل الثالث ID
      },
    ];

    Values.forEach((Checking) => {
      if (this.form_data[Checking.Field_Prog] == null) {
        document.getElementById(Checking.Field_ID).style.visibility =
          "collapse";
      }
    });
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!---------------------------------------------------Third_Case------------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء مجموعة
  if (this.tab_click == "form") {
    //* = لاخفاء مجموعة نستعمل الاسم البرمجي للحقل الذي بسببه تختفي وتظهر المجموعة في الاستمارة ونضع القيمة التي تجعل المجموعة تختفي بعد علامة
    //* form_data الاسم البرمجي الخاص بالحقل نضعه بعد النقطة الخاصه بايعاز
    if (this.form_data.FirstSponsorName == "الاختيار الذي يخفي المجموعه") {
      //* لجعل الكود يميز انها مجموعة وليس حقل _group مع اضافة getElementById الخاص بالمجموعة داخل "" في ايعاز IDنضع الـ
      document.getElementById("49166_group").style.visibility = "collapse";
    }
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!---------------------------------------------------Fourth_Case-----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء عدة مجاميع
  if (this.tab_click == "form") {
    //الخاصة بالمجموعة IDخاصة بقيمة الـ Groups_ID مصفوفة
    var Groups_ID = [
      "12345_group", //* المجموعة الاولى ID
      "45678_group", //* المجموعة الثانية ID
      "78912_group", //* المجموعة الثالثة ID
      "14789_group", //* المجموعة الرابعة ID
    ];

    //* = لاخفاء مجموعة نستعمل الاسم البرمجي للحقل الذي بسببه تختفي وتظهر المجموعة في الاستمارة ونضع القيمة التي تجعل المجموعة تختفي بعد علامة
    //* form_data الاسم البرمجي الخاص بالحقل نضعه بعد النقطة الخاصه بايعاز
    if (this.form_data.FirstSponsorName == "الاختيار الذي يخفي المجموعه") {
      Groups_ID.forEach(
        (Hiding) =>
          (document.getElementById(Hiding).style.visibility = "collapse"),
      );
    }
  }

  //--------------------------------------------------------------------------------------------------------------------------//
  //!----------------------------------------------------Fifth_Case-----------------------------------------------------------//
  //--------------------------------------------------------------------------------------------------------------------------//
  //! لاخفاء الحقل او الحقول التي لم تعد مطلوبة في الخدمة ولا يمكن حذفها لكون الخدمة نشطة
  if (this.tab_click == "form") {
    //الخاصة بالحقول IDخاصة بقيمة الـ Fields_ID مصفوفة
    var Fields_ID = [
      "12345", //* الخاص بالحقل الاول ID
      "67890", //* الخاص بالحقل الثاني ID
    ];

    Fields_ID.forEach(
      (Hiding) =>
        (document.getElementById(Hiding).style.visibility = "collapse"),
    );
  }
}
