{
    First_Hide(event){
        var First_Choice = [
            "مكتب الوزير"
        ],
        Second_Choice = [
            "مكتب السيد الوكيل الفني", "مكتب السيد الوكيل الإداري", "مكتب السيد المستشار", "الدائرة الإدارية والمالية",
            "دائرة شؤون الهجرة", "دائرة شؤون الفروع", "دائرة التخطيط والمتابعة", "دائرة المعلومات والبحوث",
            "الدائرة القانونية"
        ];
        if(First_Choice.includes(event)){
            //اسم القسم مال مكتب الوزير
            document.getElementById("73838").style.display = "block";
            this.inputFormField["MinsterDeptName"] = null;
            //اسم القسم مال باقي الدوائر
            document.getElementById("51611").style.display = "none";
            this.inputFormField["SectionName"] = null;
            //اسم الشعبة
            document.getElementById("51612").style.display = "block";
            this.inputFormField["DivisionName"] = null;
        }else if(Second_Choice.includes(event)){
            //اسم القسم مال مكتب الوزير
            document.getElementById("73838").style.display = "none";
            this.inputFormField["MinsterDeptName"] = null;
            //اسم القسم مال باقي الدوائر
            document.getElementById("51611").style.display = "block";
            this.inputFormField["SectionName"] = null;
            //اسم الشعبة
            document.getElementById("51612").style.display = "block";
            this.inputFormField["DivisionName"] = null;
        }else{
            //اسم القسم مال مكتب الوزير
            document.getElementById("73838").style.display = "none";
            this.inputFormField["MinsterDeptName"] = null;
            //اسم القسم مال باقي الدوائر
            document.getElementById("51611").style.display = "none";
            this.inputFormField["SectionName"] = null;
            //اسم الشعبة
            document.getElementById("51612").style.display = "none";
            this.inputFormField["DivisionName"] = null;
        }
    },
    
    CourseTypeFun(course){
        const courseType = {
            //مشتركة
            'ترقية موظفي الدولة': 'عام',
            'رفع المستوى التخطيطي للموظفين': 'تخصصي',
            'صياغة الكتب الرسمية': 'عام',
            'رفع المستوى التخطيطي لموظفي الفروع': 'تخصصي',
            //الفصل الاول
            'إدارة ملف النزوح والعودة': 'تخصصي',
            'التخطيط الاستراتيجي المؤسسي': 'عام',
            'آلية تسوية السنوات السابقة': 'تخصصي',
            'المهارات الرقمية والأتمتة الحكومية': 'تخصصي',
            'التوعية بالنزاهة ومكافحة الفساد': 'توعوي',
            'التوعية بحقوق الإنسان في بيئة العمل': 'توعوي',
            'التوعية بالسلامة المهنية': 'توعوي',
            //الفصل الثاني
            'حوكمة إجراءات العودة الطوعية': 'تخصصي',
            'التخطيط المالي وإدارة الميزانيات': 'تخصصي',
            'إدارة المخاطر المؤسسية': 'عام',
            'أدوات الاتصال والإعلام الرقمي': 'تخصصي',
            'إدارة الضغوط النفسية في الأزمات': 'عام',
            'نظم الحوكمة والامتثال والشفافية': 'تخصصي',
            'آلية إعداد الموازنات': 'تخصصي',
            'الترجمة الفورية والتتبعية (أساسية)': 'تخصصي',
            'التوعية بدعم الطاقة وتقليل الانبعاثات': 'توعوي',
            'التوعية بحقوق الفئات الهشة': 'توعوي',
            //الفصل الثالث
            'حل النزاعات والتسوية المجتمعية': 'عام',
            'الابتكار وإدارة التغيير': 'عام',
            'تمكين النساء والشباب في قطاع الهجرة': 'عام',
            'الأمن المعلوماتي وحماية البيانات': 'تخصصي',
            'المشتريات وإدارة العقود والمناقصات': 'تخصصي',
            'آلية الربط بين التمويل والتخصيص': 'تخصصي',
            'المهارات الشخصية في القيادة وصنع القرار': 'عام',
            'التقارير الإدارية والتحليل الإحصائي': 'عام',
            'إدارة الازمات': 'عام',
            'الترجمة الفورية والتتبعية (متقدمة)': 'تخصصي',
            'التوعية بالتحول الرقمي': 'توعوي',
            'التوعية بالتنوع الثقافي واللغوي': 'توعوي',
            'التوعية بالهوية المؤسسية': 'توعوي',
            //الفصل الرابع
            'حوكمة الهجرة عبر الحدود': 'تخصصي',
            'التسويق المؤسسي وتنمية الشراكات': 'تخصصي',
            'الصحة والسلامة المهنية لمواقع العمل': 'تخصصي',
            'المفاوضات الدولية وسياسات الهجرة': 'تخصصي',
            'التدريب على البحث والإحصاء وسياسات البيانات': 'تخصصي',
            'الإدارة الذكية وحلول التحول الرقمي': 'عام',
            'إدارة تقييم الأثر للمشاريع الحكومية': 'تخصصي',
            'آلية العمل على التحول المالي (POS)': 'تخصصي',
            'التوعية بالاستجابة الإنسانية': 'توعوي',
            'التوعية بالخصوصية وحماية البيانات': 'توعوي',
            'التوعية بالشفافية المؤسسية': 'توعوي',
            'التوعية بالسلامة النفسية في بيئة العمل': 'توعوي',
            /*
            'تبسيط الإجراءات والتحول الرقمي': 'عام',
            'إجراءات مكافحة الفساد':'توعوي',
            'نشر ثقافة التعايش السلمي': 'توعوي',
            'تأثير التصحر والجفاف على المجتمع': 'توعوي',
            'تأثير المخدرات وسبل مكافحتها': 'توعوي',
            'التوعية بمخاطر الهجرة غير الشرعية': 'توعوي',
            'التعريف بحقوق الانسان وفق الاتفاقات الدولية': 'توعوي',
            'إدارة الازمات والكوارث': 'توعوي',
            'اساسيات في excel,word': 'عام',
            'تبسيط الإجراءات والتحول الرقمي': 'عام'
            */
        }
        if(course){
            document.getElementById("51727").style.display = "block"  
            document.getElementById("51727").classList.add("isDisabled")
        }
        if(!course &&  document.getElementById("51727")){ 
            document.getElementById("51727").style.display = "none"
        }else if (courseType.hasOwnProperty(course)) {  
            this.inputFormField["TrainingNature"] = courseType[course]
        }else{
            this.inputFormField.TrainingNature = "تخصصي"	  
        }
    },
}